# -*- coding:utf-8 -*-
detail_2283 = {
	'title':'uReal-diva 2283 素人オリジナル生ハメ撮り さき 25歳',
	'description':u'''街行く女の子をナンパしてハメちゃうという設定らしいですがちょっと無理がある感じですがそこはあまり触れずにおきましょう！っということで、すぐさま部屋に連れ込みエッチなインタビューが始まります！敏感なオッパイを触られると速攻感じちゃうさきちゃん。本当は気持ちイイのに我慢している感が興奮させられます。パンティー越しにオマンコをグリグリ弄られると思わず声をあげちゃう可愛いさきちゃん♪シーン2では大胆な彼女が見られます！ローター責めには顔を赤らめ腰を浮かせ「イ、イクぅ～」と昇天。バイブで気持ち良くなったお返しにフェラ！ビンビンのチンポを美味しそうに咥えます！正常位でズッポリ奥まで挿入されると顔をしかめ快楽に浸ります。激しい突きに「イクぅ～ヤメてぇ～」と即イッちゃう超敏感なさきちゃん。こんな簡単にナンパが成功して性交まで漕ぎ着けるなんてありえないですよね～<br />''',
	'cover_img':u'http://img58.imagetwist.com/th/07692/1mdhjlt4fymq.jpg',
	'screenshosts':[u'http://img21.imagetwist.com/i/07692/xpvng04awvdz.jpeg'],
	'categories':[u'Real-diva', u'Uncensored'],
	'tags':[u'Real-diva',u'ハメ撮り',],
	'file_name':u'detail_2283',
}
