# -*- coding:utf-8 -*-
detail_5745 = {
	'title':'uReal-diva 5745 悲劇の流出！個人撮影 ～中華圏編～萌え系スレンダーギャルが真昼間からカーセックス',
	'description':u'''若いカップルが日常のハメ撮りを取った映像です。ギターを弾きながら登場したスレンダー美脚の彼女。なかなかの腕前です。全裸でベッドに寝そべると、スタイル抜群の裸体を披露！カメラを向けられて恥ずかしそうに両手で顔を隠す仕草が可愛らしいですね♪特にオススメなのが、6分20秒あたりから始まるカーセックス映像です。人気の無いところで車を止めて真昼間からハメまくり！助手席にカメラを置いての撮影なので、挿入中は2人の下半身が中心で映っていますが、彼女の可愛らしい喘ぎ声を聞くだけで興奮度が急上昇！明るい車内というシチュエーションもたまりません！エッチの後にティッシュで自分のおまんこをふきふきする様子が生々しくて最高です！カーセックスの次の場面で30秒ほど音が割れている場面も有りますが、若いカップルの日常的なエッチの様子を取った映像は一見の価値アリです！是非、本編をダウンロードしてお楽しみ下さい。<br />''',
	'cover_img':u'http://img108.imagetwist.com/th/07670/gf8j9hjbx8r9.jpg',
	'screenshosts':[u'http://img21.imagetwist.com/i/07670/4cg19qjprwt4.jpeg'],
	'categories':[u'Real-diva', u'Uncensored'],
	'tags':[u'Real-diva',u'個人撮影',u'中華圏編',],
	'file_name':u'detail_5745',
}
