# -*- coding: utf-8 -*-
"""
    ISO3166 http://en.wikipedia.org/wiki/ISO_3166
"""

COUNTRY_CHOICES = (
    ('1', u'中国'),
    ('ALB', u'阿尔巴尼亚'),
    ('DZA', u'阿尔及利亚'),
    ('AFG', u'阿富汗'),
    ('ARG', u'阿根廷'),
    ('ARE', u'阿拉伯联合酋长国'),
    ('ABW', u'阿鲁巴'),
    ('OMN', u'阿曼'),
    ('AZE', u'阿塞拜疆'),
    ('ASC', u'阿森松岛'),
    ('EGY', u'埃及'),
    ('ETH', u'埃塞俄比亚'),
    ('IRL', u'爱尔兰'),
    ('EST', u'爱沙尼亚'),
    ('AND', u'安道尔'),
    ('AGO', u'安哥拉'),
    ('AIA', u'安圭拉'),
    ('ATG', u'安提瓜岛和巴布达'),
    ('AUS', u'澳大利亚'),
    ('AUT', u'奥地利'),
    ('ALA', u'奥兰群岛'),
    ('BRB', u'巴巴多斯岛'),
    ('PNG', u'巴布亚新几内亚'),
    ('BHS', u'巴哈马'),
    ('PAK', u'巴基斯坦'),
    ('PRY', u'巴拉圭'),
    ('PSE', u'巴勒斯坦'),
    ('BHR', u'巴林'),
    ('PAN', u'巴拿马'),
    ('BRA', u'巴西'),
    ('BLR', u'白俄罗斯'),
    ('BMU', u'百慕大'),
    ('BGR', u'保加利亚'),
    ('MNP', u'北马里亚纳群岛'),
    ('BEN', u'贝宁'),
    ('BEL', u'比利时'),
    ('ISL', u'冰岛'),
    ('PRI', u'波多黎各'),
    ('POL', u'波兰'),
    ('BOL', u'玻利维亚'),
    ('BIH', u'波斯尼亚和黑塞哥维那'),
    ('BWA', u'博茨瓦纳'),
    ('BLZ', u'伯利兹'),
    ('BTN', u'不丹'),
    ('BFA', u'布基纳法索'),
    ('BDI', u'布隆迪'),
    ('BVT', u'布韦岛'),
    ('PRK', u'朝鲜'),
    ('DNK', u'丹麦'),
    ('DEU', u'德国'),
    ('TLS', u'东帝汶'),
    ('TGO', u'多哥'),
    ('DMA', u'多米尼加'),
    ('DOM', u'多米尼加共和国'),
    ('RUS', u'俄罗斯'),
    ('ECU', u'厄瓜多尔'),
    ('ERI', u'厄立特里亚'),
    ('FRA', u'法国'),
    ('FRO', u'法罗群岛'),
    ('PYF', u'法属波利尼西亚'),
    ('GUF', u'法属圭亚那'),
    ('ATF', u'法属南部领地'),
    ('VAT', u'梵蒂冈'),
    ('PHL', u'菲律宾'),
    ('FJI', u'斐济'),
    ('FIN', u'芬兰'),
    ('CPV', u'佛得角'),
    ('FLK', u'弗兰克群岛'),
    ('GMB', u'冈比亚'),
    ('COG', u'刚果'),
    ('COD', u'刚果民主共和国'),
    ('COL', u'哥伦比亚'),
    ('CRI', u'哥斯达黎加'),
    ('GGY', u'格恩西岛'),
    ('GRD', u'格林纳达'),
    ('GRL', u'格陵兰'),
    ('CUB', u'古巴'),
    ('GLP', u'瓜德罗普'),
    ('GUM', u'关岛'),
    ('GUY', u'圭亚那'),
    ('KAZ', u'哈萨克斯坦'),
    ('HTI', u'海地'),
    ('KOR', u'韩国'),
    ('NLD', u'荷兰'),
    ('ANT', u'荷属安地列斯'),
    ('HMD', u'赫德和麦克唐纳群岛'),
    ('HND', u'洪都拉斯'),
    ('KIR', u'基里巴斯'),
    ('DJI', u'吉布提'),
    ('KGZ', u'吉尔吉斯斯坦'),
    ('GIN', u'几内亚'),
    ('GNB', u'几内亚比绍'),
    ('CAN', u'加拿大'),
    ('GHA', u'加纳'),
    ('GAB', u'加蓬'),
    ('KHM', u'柬埔寨'),
    ('CZE', u'捷克共和国'),
    ('ZWE', u'津巴布韦'),
    ('CMR', u'喀麦隆'),
    ('QAT', u'卡塔尔'),
    ('CYM', u'开曼群岛'),
    ('CCK', u'科科斯群岛'),
    ('COM', u'科摩罗'),
    ('CIV', u'科特迪瓦'),
    ('KWT', u'科威特'),
    ('HRV', u'克罗地亚'),
    ('KEN', u'肯尼亚'),
    ('COK', u'库克群岛'),
    ('LVA', u'拉脱维亚'),
    ('LSO', u'莱索托'),
    ('LAO', u'老挝'),
    ('LBN', u'黎巴嫩'),
    ('LBR', u'利比里亚'),
    ('LBY', u'利比亚'),
    ('LTU', u'立陶宛'),
    ('LIE', u'列支敦士登'),
    ('REU', u'留尼旺岛'),
    ('LUX', u'卢森堡'),
    ('RWA', u'卢旺达'),
    ('ROU', u'罗马尼亚'),
    ('MDG', u'马达加斯加'),
    ('MDV', u'马尔代夫'),
    ('MLT', u'马耳他'),
    ('MWI', u'马拉维'),
    ('MYS', u'马来西亚'),
    ('MLI', u'马里'),
    ('MKD', u'马其顿'),
    ('MHL', u'马绍尔群岛'),
    ('MTQ', u'马提尼克'),
    ('MYT', u'马约特岛'),
    ('IMN', u'曼岛'),
    ('MUS', u'毛里求斯'),
    ('MRT', u'毛里塔尼亚'),
    ('USA', u'美国'),
    ('ASM', u'美属萨摩亚'),
    ('UMI', u'美属外岛'),
    ('MNG', u'蒙古'),
    ('MSR', u'蒙特塞拉特'),
    ('BGD', u'孟加拉'),
    ('FSM', u'密克罗尼西亚'),
    ('PER', u'秘鲁'),
    ('MMR', u'缅甸'),
    ('MDA', u'摩尔多瓦'),
    ('MAR', u'摩洛哥'),
    ('MCO', u'摩纳哥'),
    ('MOZ', u'莫桑比克'),
    ('MEX', u'墨西哥'),
    ('NAM', u'纳米比亚'),
    ('ZAF', u'南非'),
    ('ATA', u'南极洲'),
    ('SGS', u'南乔治亚和南桑德威奇群岛'),
    ('NRU', u'瑙鲁'),
    ('NPL', u'尼泊尔'),
    ('NIC', u'尼加拉瓜'),
    ('NER', u'尼日尔'),
    ('NGA', u'尼日利亚'),
    ('NIU', u'纽埃'),
    ('NOR', u'挪威'),
    ('NFK', u'诺福克'),
    ('PLW', u'帕劳群岛'),
    ('PCN', u'皮特凯恩'),
    ('PRT', u'葡萄牙'),
    ('GEO', u'乔治亚'),
    ('JPN', u'日本'),
    ('SWE', u'瑞典'),
    ('CHE', u'瑞士'),
    ('SLV', u'萨尔瓦多'),
    ('WSM', u'萨摩亚'),
    ('SCG', u'塞尔维亚,黑山'),
    ('SLE', u'塞拉利昂'),
    ('SEN', u'塞内加尔'),
    ('CYP', u'塞浦路斯'),
    ('SYC', u'塞舌尔'),
    ('SAU', u'沙特阿拉伯'),
    ('CXR', u'圣诞岛'),
    ('STP', u'圣多美和普林西比'),
    ('SHN', u'圣赫勒拿'),
    ('KNA', u'圣基茨和尼维斯'),
    ('LCA', u'圣卢西亚'),
    ('SMR', u'圣马力诺'),
    ('SPM', u'圣皮埃尔和米克隆群岛'),
    ('VCT', u'圣文森特和格林纳丁斯'),
    ('LKA', u'斯里兰卡'),
    ('SVK', u'斯洛伐克'),
    ('SVN', u'斯洛文尼亚'),
    ('SJM', u'斯瓦尔巴和扬马廷'),
    ('SWZ', u'斯威士兰'),
    ('SDN', u'苏丹'),
    ('SUR', u'苏里南'),
    ('SLB', u'所罗门群岛'),
    ('SOM', u'索马里'),
    ('TJK', u'塔吉克斯坦'),
    ('THA', u'泰国'),
    ('TZA', u'坦桑尼亚'),
    ('TON', u'汤加'),
    ('TCA', u'特克斯和凯克特斯群岛'),
    ('TAA', u'特里斯坦达昆哈'),
    ('TTO', u'特立尼达和多巴哥'),
    ('TUN', u'突尼斯'),
    ('TUV', u'图瓦卢'),
    ('TUR', u'土耳其'),
    ('TKM', u'土库曼斯坦'),
    ('TKL', u'托克劳'),
    ('WLF', u'瓦利斯和福图纳'),
    ('VUT', u'瓦努阿图'),
    ('GTM', u'危地马拉'),
    ('VIR', u'维尔京群岛，美属'),
    ('VGB', u'维尔京群岛，英属'),
    ('VEN', u'委内瑞拉'),
    ('BRN', u'文莱'),
    ('UGA', u'乌干达'),
    ('UKR', u'乌克兰'),
    ('URY', u'乌拉圭'),
    ('UZB', u'乌兹别克斯坦'),
    ('ESP', u'西班牙'),
    ('GRC', u'希腊'),
    ('SGP', u'新加坡'),
    ('NCL', u'新喀里多尼亚'),
    ('NZL', u'新西兰'),
    ('HUN', u'匈牙利'),
    ('SYR', u'叙利亚'),
    ('JAM', u'牙买加'),
    ('ARM', u'亚美尼亚'),
    ('YEM', u'也门'),
    ('IRQ', u'伊拉克'),
    ('IRN', u'伊朗'),
    ('ISR', u'以色列'),
    ('ITA', u'意大利'),
    ('IND', u'印度'),
    ('IDN', u'印度尼西亚'),
    ('GBR', u'英国'),
    ('IOT', u'英属印度洋领地'),
    ('JOR', u'约旦'),
    ('VNM', u'越南'),
    ('ZMB', u'赞比亚'),
    ('JEY', u'泽西岛'),
    ('TCD', u'乍得'),
    ('GIB', u'直布罗陀'),
    ('CHL', u'智利'),
    ('CAF', u'中非共和国')
)

STATE_CHOICES_MAP = {
    '1': (
        ('11', u'北京'),
        ('12', u'天津'),
        ('13', u'河北'),
        ('14', u'山西'),
        ('15', u'内蒙古'),
        ('21', u'辽宁'),
        ('22', u'吉林'),
        ('23', u'黑龙江'),
        ('31', u'上海'),
        ('32', u'江苏'),
        ('33', u'浙江'),
        ('34', u'安徽'),
        ('35', u'福建'),
        ('36', u'江西'),
        ('37', u'山东'),
        ('41', u'河南'),
        ('42', u'湖北'),
        ('43', u'湖南'),
        ('44', u'广东'),
        ('45', u'广西'),
        ('46', u'海南'),
        ('50', u'重庆'),
        ('51', u'四川'),
        ('52', u'贵州'),
        ('53', u'云南'),
        ('54', u'西藏'),
        ('61', u'陕西'),
        ('62', u'甘肃'),
        ('63', u'青海'),
        ('64', u'宁夏'),
        ('65', u'新疆'),
        ('71', u'台湾'),
        ('81', u'香港'),
        ('82', u'澳门')
    ),

    'AUS': (
        ('NT', u'北部地区'),
        ('ACT', u'堪培拉'),
        ('QLD', u'昆士兰'),
        ('SA', u'南澳大利亚'),
        ('TAS', u'塔斯马尼亚'),
        ('VIC', u'维多利亚'),
        ('WA', u'西澳大利亚'),
        ('NSW', u'新南威尔士')
    ),

    'KOR': (
        ('27', u'大邱'),
        ('30', u'大田'),
        ('26', u'釜山'),
        ('29', u'光州'),
        ('41', u'济州特别自治道'),
        ('42', u'江原道'),
        ('49', u'京畿道'),
        ('43', u'庆尚北道'),
        ('44', u'庆尚南道'),
        ('47', u'全罗北道'),
        ('48', u'全罗南道'),
        ('28', u'仁川'),
        ('11', u'首尔'),
        ('31', u'蔚山'),
        ('45', u'忠清北道'),
        ('46', u'忠清南道')
    ),

    'MYS': (
        ('PH', u'槟榔屿'),
        ('PS', u'玻璃市'),
        ('TR', u'丁加奴'),
        ('KD', u'吉打'),
        ('KN', u'吉兰丹'),
        ('KL', u'吉隆坡'),
        ('ML', u'马六甲'),
        ('LB', u'纳闽'),
        ('PG', u'彭亨'),
        ('PK', u'霹雳'),
        ('JH', u'柔佛'),
        ('NS', u'森美兰'),
        ('SB', u'沙巴'),
        ('SR', u'沙捞越'),
        ('SL', u'雪兰莪')
    ),

    'USA': (
        ('AR', u'阿肯色'),
        ('AL', u'阿拉巴马'),
        ('AK', u'阿拉斯加'),
        ('ID', u'爱达荷'),
        ('IA', u'爱荷华'),
        ('ND', u'北达科他'),
        ('NC', u'北卡罗来纳'),
        ('PA', u'宾夕法尼亚'),
        ('TX', u'德克萨斯'),
        ('OH', u'俄亥俄'),
        ('OK', u'俄克拉荷马'),
        ('OR', u'俄勒冈'),
        ('FL', u'佛罗里达'),
        ('VT', u'佛蒙特'),
        ('DC', u'哥伦比亚特区'),
        ('WA', u'华盛顿'),
        ('WY', u'怀俄明'),
        ('CA', u'加利福尼亚'),
        ('KS', u'堪萨斯'),
        ('CT', u'康涅狄格'),
        ('CO', u'科罗拉多'),
        ('KY', u'肯塔基'),
        ('LA', u'路易斯安那'),
        ('RI', u'罗德岛'),
        ('MD', u'马里兰'),
        ('MA', u'马萨诸塞'),
        ('MT', u'蒙大拿'),
        ('MO', u'密苏里'),
        ('MS', u'密西西比'),
        ('MI', u'密歇根'),
        ('ME', u'缅因'),
        ('MN', u'明尼苏达'),
        ('SD', u'南达科他'),
        ('SC', u'南卡罗来纳'),
        ('NE', u'内布拉斯加'),
        ('NV', u'内华达'),
        ('NY', u'纽约'),
        ('DE', u'特拉华'),
        ('TN', u'田纳西'),
        ('WI', u'威斯康星'),
        ('VA', u'维吉尼亚'),
        ('WV', u'西佛吉尼亚'),
        ('HI', u'夏威夷'),
        ('NH', u'新罕布什尔'),
        ('NM', u'新墨西哥'),
        ('NJ', u'新泽西'),
        ('AZ', u'亚利桑那'),
        ('IL', u'伊利诺斯'),
        ('IN', u'印第安那'),
        ('UT', u'犹他'),
        ('GA', u'佐治亚')
    ),

    'GBR': (
        ('NIR', u'北爱尔兰'),
        ('SCT', u'苏格兰'),
        ('WLS', u'威尔士'),
        ('ENG', u'英格兰')
    )
}

CITY_CHOICES_MAP = {
    '1:11': (
        ('1', u'东城'),
        ('2', u'西城'),
        ('5', u'朝阳'),
        ('6', u'丰台'),
        ('7', u'石景山'),
        ('8', u'海淀'),
        ('9', u'门头沟'),
        ('11', u'房山'),
        ('12', u'通州'),
        ('13', u'顺义'),
        ('21', u'昌平'),
        ('24', u'大兴'),
        ('26', u'平谷'),
        ('27', u'怀柔'),
        ('28', u'密云'),
        ('29', u'延庆')
    ),

    '1:12': (
        ('1', u'和平'),
        ('2', u'河东'),
        ('3', u'河西'),
        ('4', u'南开'),
        ('5', u'河北'),
        ('6', u'红桥'),
        ('26', u'滨海新区'),
        ('10', u'东丽'),
        ('11', u'西青'),
        ('12', u'津南'),
        ('13', u'北辰'),
        ('21', u'宁河'),
        ('22', u'武清'),
        ('23', u'静海'),
        ('24', u'宝坻'),
        ('25', u'蓟县')
    ),

    '1:13': (
        ('1', u'石家庄'),
        ('2', u'唐山'),
        ('3', u'秦皇岛'),
        ('4', u'邯郸'),
        ('5', u'邢台'),
        ('6', u'保定'),
        ('7', u'张家口'),
        ('8', u'承德'),
        ('9', u'沧州'),
        ('10', u'廊坊'),
        ('11', u'衡水')
    ),

    '1:14': (
        ('1', u'太原'),
        ('2', u'大同'),
        ('3', u'阳泉'),
        ('4', u'长治'),
        ('5', u'晋城'),
        ('6', u'朔州'),
        ('7', u'晋中'),
        ('8', u'运城'),
        ('9', u'忻州'),
        ('10', u'临汾'),
        ('11', u'吕梁')
    ),

    '1:15': (
        ('1', u'呼和浩特'),
        ('2', u'包头'),
        ('3', u'乌海'),
        ('4', u'赤峰'),
        ('5', u'通辽'),
        ('6', u'鄂尔多斯'),
        ('7', u'呼伦贝尔'),
        ('8', u'巴彦淖尔'),
        ('9', u'乌兰察布'),
        ('22', u'兴安'),
        ('25', u'锡林郭勒'),
        ('29', u'阿拉善')
    ),

    '1:21': (
        ('1', u'沈阳'),
        ('2', u'大连'),
        ('3', u'鞍山'),
        ('4', u'抚顺'),
        ('5', u'本溪'),
        ('6', u'丹东'),
        ('7', u'锦州'),
        ('8', u'营口'),
        ('9', u'阜新'),
        ('10', u'辽阳'),
        ('11', u'盘锦'),
        ('12', u'铁岭'),
        ('13', u'朝阳'),
        ('14', u'葫芦岛')
    ),

    '1:22': (
        ('1', u'长春'),
        ('2', u'吉林'),
        ('3', u'四平'),
        ('4', u'辽源'),
        ('5', u'通化'),
        ('6', u'白山'),
        ('7', u'松原'),
        ('8', u'白城'),
        ('24', u'延边')
    ),

    '1:23': (
        ('1', u'哈尔滨'),
        ('2', u'齐齐哈尔'),
        ('3', u'鸡西'),
        ('4', u'鹤岗'),
        ('5', u'双鸭山'),
        ('6', u'大庆'),
        ('7', u'伊春'),
        ('8', u'佳木斯'),
        ('9', u'七台河'),
        ('10', u'牡丹江'),
        ('11', u'黑河'),
        ('12', u'绥化'),
        ('27', u'大兴安岭')
    ),

    '1:31': (
        ('1', u'黄浦'),
        ('3', u'卢湾'),
        ('4', u'徐汇'),
        ('5', u'长宁'),
        ('6', u'静安'),
        ('7', u'普陀'),
        ('8', u'闸北'),
        ('9', u'虹口'),
        ('11', u'杨浦'),
        ('12', u'闵行'),
        ('13', u'宝山'),
        ('14', u'嘉定'),
        ('15', u'浦东新'),
        ('16', u'金山'),
        ('17', u'松江'),
        ('26', u'奉贤'),
        ('29', u'青浦'),
        ('30', u'崇明')
    ),

    '1:32': (
        ('1', u'南京'),
        ('2', u'无锡'),
        ('3', u'徐州'),
        ('4', u'常州'),
        ('5', u'苏州'),
        ('6', u'南通'),
        ('7', u'连云港'),
        ('8', u'淮安'),
        ('9', u'盐城'),
        ('10', u'扬州'),
        ('11', u'镇江'),
        ('12', u'泰州'),
        ('13', u'宿迁')
    ),

    '1:33': (
        ('1', u'杭州'),
        ('2', u'宁波'),
        ('3', u'温州'),
        ('4', u'嘉兴'),
        ('5', u'湖州'),
        ('6', u'绍兴'),
        ('7', u'金华'),
        ('8', u'衢州'),
        ('9', u'舟山'),
        ('10', u'台州'),
        ('11', u'丽水')
    ),

    '1:34': (
        ('1', u'合肥'),
        ('2', u'芜湖'),
        ('3', u'蚌埠'),
        ('4', u'淮南'),
        ('5', u'马鞍山'),
        ('6', u'淮北'),
        ('7', u'铜陵'),
        ('8', u'安庆'),
        ('10', u'黄山'),
        ('11', u'滁州'),
        ('12', u'阜阳'),
        ('13', u'宿州'),
        ('14', u'巢湖'),
        ('15', u'六安'),
        ('16', u'亳州'),
        ('17', u'池州'),
        ('18', u'宣城')
    ),

    '1:35': (
        ('1', u'福州'),
        ('2', u'厦门'),
        ('3', u'莆田'),
        ('4', u'三明'),
        ('5', u'泉州'),
        ('6', u'漳州'),
        ('7', u'南平'),
        ('8', u'龙岩'),
        ('9', u'宁德')
    ),

    '1:36': (
        ('1', u'南昌'),
        ('2', u'景德镇'),
        ('3', u'萍乡'),
        ('4', u'九江'),
        ('5', u'新余'),
        ('6', u'鹰潭'),
        ('7', u'赣州'),
        ('8', u'吉安'),
        ('9', u'宜春'),
        ('10', u'抚州'),
        ('11', u'上饶')
    ),

    '1:37': (
        ('1', u'济南'),
        ('2', u'青岛'),
        ('3', u'淄博'),
        ('4', u'枣庄'),
        ('5', u'东营'),
        ('6', u'烟台'),
        ('7', u'潍坊'),
        ('8', u'济宁'),
        ('9', u'泰安'),
        ('10', u'威海'),
        ('11', u'日照'),
        ('12', u'莱芜'),
        ('13', u'临沂'),
        ('14', u'德州'),
        ('15', u'聊城'),
        ('16', u'滨州'),
        ('17', u'菏泽')
    ),

    '1:41': (
        ('1', u'郑州'),
        ('2', u'开封'),
        ('3', u'洛阳'),
        ('4', u'平顶山'),
        ('5', u'安阳'),
        ('6', u'鹤壁'),
        ('7', u'新乡'),
        ('8', u'焦作'),
        ('9', u'濮阳'),
        ('10', u'许昌'),
        ('11', u'漯河'),
        ('12', u'三门峡'),
        ('13', u'南阳'),
        ('14', u'商丘'),
        ('15', u'信阳'),
        ('16', u'周口'),
        ('17', u'驻马店'),
        ('18', u'济源')
    ),

    '1:42': (
        ('1', u'武汉'),
        ('2', u'黄石'),
        ('3', u'十堰'),
        ('5', u'宜昌'),
        ('6', u'襄阳'),
        ('7', u'鄂州'),
        ('8', u'荆门'),
        ('9', u'孝感'),
        ('10', u'荆州'),
        ('11', u'黄冈'),
        ('12', u'咸宁'),
        ('13', u'随州'),
        ('28', u'恩施'),
        ('94', u'仙桃'),
        ('95', u'潜江'),
        ('96', u'天门'),
        ('A21', u'神农架')
    ),

    '1:43': (
        ('1', u'长沙'),
        ('2', u'株洲'),
        ('3', u'湘潭'),
        ('4', u'衡阳'),
        ('5', u'邵阳'),
        ('6', u'岳阳'),
        ('7', u'常德'),
        ('8', u'张家界'),
        ('9', u'益阳'),
        ('10', u'郴州'),
        ('11', u'永州'),
        ('12', u'怀化'),
        ('13', u'娄底'),
        ('31', u'湘西')
    ),

    '1:44': (
        ('1', u'广州'),
        ('2', u'韶关'),
        ('3', u'深圳'),
        ('4', u'珠海'),
        ('5', u'汕头'),
        ('6', u'佛山'),
        ('7', u'江门'),
        ('8', u'湛江'),
        ('9', u'茂名'),
        ('12', u'肇庆'),
        ('13', u'惠州'),
        ('14', u'梅州'),
        ('15', u'汕尾'),
        ('16', u'河源'),
        ('17', u'阳江'),
        ('18', u'清远'),
        ('19', u'东莞'),
        ('20', u'中山'),
        ('51', u'潮州'),
        ('52', u'揭阳'),
        ('53', u'云浮')
    ),

    '1:45': (
        ('1', u'南宁'),
        ('2', u'柳州'),
        ('3', u'桂林'),
        ('4', u'梧州'),
        ('5', u'北海'),
        ('6', u'防城港'),
        ('7', u'钦州'),
        ('8', u'贵港'),
        ('9', u'玉林'),
        ('10', u'百色'),
        ('11', u'贺州'),
        ('12', u'河池'),
        ('13', u'来宾'),
        ('14', u'崇左')
    ),

    '1:46': (
        ('1', u'海口'),
        ('2', u'三亚'),
        ('91', u'五指山'),
        ('92', u'琼海'),
        ('93', u'儋州'),
        ('95', u'文昌'),
        ('96', u'万宁'),
        ('97', u'东方'),
        ('A25', u'定安'),
        ('A26', u'屯昌'),
        ('A27', u'澄迈'),
        ('A28', u'临高'),
        ('A30', u'白沙'),
        ('A31', u'昌江'),
        ('A33', u'乐东'),
        ('A34', u'陵水'),
        ('A35', u'保亭'),
        ('A36', u'琼中'),
        ('A37', u'西沙'),
        ('A38', u'南沙'),
        ('A39', u'中沙')
    ),

    '1:50': (
        ('1', u'万州'),
        ('2', u'涪陵'),
        ('3', u'渝中'),
        ('4', u'大渡口'),
        ('5', u'江北'),
        ('6', u'沙坪坝'),
        ('7', u'九龙坡'),
        ('8', u'南岸'),
        ('9', u'北碚'),
        ('85', u'两江新区'),
        ('10', u'万盛'),
        ('11', u'双桥'),
        ('12', u'渝北'),
        ('13', u'巴南'),
        ('21', u'长寿'),
        ('22', u'綦江'),
        ('23', u'潼南'),
        ('24', u'铜梁'),
        ('25', u'大足'),
        ('26', u'荣昌'),
        ('27', u'璧山'),
        ('28', u'梁平'),
        ('29', u'城口'),
        ('30', u'丰都'),
        ('31', u'垫江'),
        ('32', u'武隆'),
        ('33', u'忠县'),
        ('34', u'开县'),
        ('35', u'云阳'),
        ('36', u'奉节'),
        ('37', u'巫山'),
        ('38', u'巫溪'),
        ('39', u'黔江'),
        ('40', u'石柱'),
        ('41', u'秀山'),
        ('42', u'酉阳'),
        ('43', u'彭水'),
        ('81', u'江津'),
        ('82', u'合川'),
        ('83', u'永川'),
        ('84', u'南川')
    ),

    '1:51': (
        ('1', u'成都'),
        ('3', u'自贡'),
        ('4', u'攀枝花'),
        ('5', u'泸州'),
        ('6', u'德阳'),
        ('7', u'绵阳'),
        ('8', u'广元'),
        ('9', u'遂宁'),
        ('10', u'内江'),
        ('11', u'乐山'),
        ('13', u'南充'),
        ('14', u'眉山'),
        ('15', u'宜宾'),
        ('16', u'广安'),
        ('17', u'达州'),
        ('18', u'雅安'),
        ('19', u'巴中'),
        ('20', u'资阳'),
        ('32', u'阿坝'),
        ('33', u'甘孜'),
        ('34', u'凉山')
    ),

    '1:52': (
        ('1', u'贵阳'),
        ('2', u'六盘水'),
        ('3', u'遵义'),
        ('4', u'安顺'),
        ('22', u'铜仁'),
        ('23', u'黔西南'),
        ('24', u'毕节'),
        ('26', u'黔东南'),
        ('27', u'黔南')
    ),

    '1:53': (
        ('1', u'昆明'),
        ('3', u'曲靖'),
        ('4', u'玉溪'),
        ('5', u'保山'),
        ('6', u'昭通'),
        ('7', u'丽江'),
        ('8', u'普洱'),
        ('9', u'临沧'),
        ('23', u'楚雄'),
        ('25', u'红河'),
        ('26', u'文山'),
        ('28', u'西双版纳'),
        ('29', u'大理'),
        ('31', u'德宏'),
        ('33', u'怒江'),
        ('34', u'迪庆')
    ),

    '1:54': (
        ('1', u'拉萨'),
        ('21', u'昌都'),
        ('22', u'山南'),
        ('23', u'日喀则'),
        ('24', u'那曲'),
        ('25', u'阿里'),
        ('26', u'林芝')
    ),

    '1:61': (
        ('1', u'西安'),
        ('2', u'铜川'),
        ('3', u'宝鸡'),
        ('4', u'咸阳'),
        ('5', u'渭南'),
        ('6', u'延安'),
        ('7', u'汉中'),
        ('8', u'榆林'),
        ('9', u'安康'),
        ('10', u'商洛')
    ),

    '1:62': (
        ('1', u'兰州市'),
        ('2', u'嘉峪关'),
        ('3', u'金昌'),
        ('4', u'白银'),
        ('5', u'天水'),
        ('6', u'武威'),
        ('7', u'张掖'),
        ('8', u'平凉'),
        ('9', u'酒泉'),
        ('10', u'庆阳'),
        ('11', u'定西'),
        ('12', u'陇南'),
        ('29', u'临夏'),
        ('30', u'甘南')
    ),

    '1:63': (
        ('1', u'西宁'),
        ('21', u'海东'),
        ('22', u'海北'),
        ('23', u'黄南'),
        ('25', u'海南'),
        ('26', u'果洛'),
        ('27', u'玉树'),
        ('28', u'海西')
    ),

    '1:64': (
        ('1', u'银川'),
        ('2', u'石嘴山'),
        ('3', u'吴忠'),
        ('4', u'固原'),
        ('5', u'中卫')
    ),

    '1:65': (
        ('1', u'乌鲁木齐'),
        ('2', u'克拉玛依'),
        ('21', u'吐鲁番'),
        ('22', u'哈密'),
        ('23', u'昌吉'),
        ('27', u'博尔塔拉'),
        ('28', u'巴音郭楞'),
        ('29', u'阿克苏'),
        ('30', u'克孜勒苏'),
        ('31', u'喀什'),
        ('32', u'和田'),
        ('40', u'伊犁'),
        ('42', u'塔城'),
        ('43', u'阿勒泰'),
        ('91', u'石河子'),
        ('92', u'阿拉尔'),
        ('93', u'图木舒克'),
        ('94', u'五家渠')
    ),

    '1:71': (
        ('1', u'台北市'),
        ('2', u'高雄市'),
        ('3', u'基隆市'),
        ('4', u'台中市'),
        ('5', u'台南市'),
        ('6', u'新竹市'),
        ('7', u'嘉义市'),
        ('8', u'台北县'),
        ('9', u'宜兰县'),
        ('10', u'桃园县'),
        ('11', u'新竹县'),
        ('12', u'苗栗县'),
        ('13', u'台中县'),
        ('14', u'彰化县'),
        ('15', u'南投县'),
        ('16', u'云林县'),
        ('17', u'嘉义县'),
        ('18', u'台南县'),
        ('19', u'高雄县'),
        ('20', u'屏东县'),
        ('22', u'台东县'),
        ('23', u'花莲县'),
        ('21', u'澎湖县')
    ),

    '1:81': (
        ('HCW', u'中西区'),
        ('HEA', u'东区'),
        ('KKC', u'九龙城区'),
        ('KKT', u'观塘区'),
        ('HSO', u'南区'),
        ('KSS', u'深水埗区'),
        ('KWT', u'黄大仙区'),
        ('HWC', u'湾仔区'),
        ('KYT', u'油尖旺区'),
        ('NIS', u'离岛区'),
        ('NKT', u'葵青区'),
        ('NNO', u'北区'),
        ('NSK', u'西贡区'),
        ('NST', u'沙田区'),
        ('NTM', u'屯门区'),
        ('NTP', u'大埔区'),
        ('NTW', u'荃湾区'),
        ('NYL', u'元朗区')
    ),

    '1:82': (
        ('OLF', u'花地玛堂区'),
        ('ANT', u'圣安多尼堂区'),
        ('CAT', u'大堂区'),
        ('LAW', u'望德堂区'),
        ('LAZ', u'风顺堂区'),
        ('TPA', u'氹仔'),
        ('CLN', u'路环')
    ),

    'ALB': (
        ('EL', u'爱尔巴桑'),
        ('DI', u'迪勃拉'),
        ('TR', u'地拉那'),
        ('DR', u'都拉斯'),
        ('VL', u'发罗拉'),
        ('FR', u'费里'),
        ('GJ', u'吉诺卡斯特'),
        ('KO', u'科尔察'),
        ('KU', u'库克斯'),
        ('LE', u'莱什'),
        ('BR', u'培拉特'),
        ('SH', u'斯库台')
    ),

    'DZA': (
        ('ADR', u'阿德拉尔'),
        ('ALG', u'阿尔及尔'),
        ('ADE', u'艾因·德夫拉'),
        ('ATE', u'艾因·蒂姆尚特'),
        ('AAE', u'安纳巴'),
        ('ORA', u'奥兰'),
        ('BAT', u'巴特纳'),
        ('BJA', u'贝贾亚'),
        ('BEC', u'贝沙尔'),
        ('EBA', u'贝伊德'),
        ('BIS', u'比斯克拉'),
        ('BOR', u'布尔吉·布阿雷里吉'),
        ('BLI', u'布利达'),
        ('BOU', u'布迈德斯'),
        ('BOA', u'布依拉'),
        ('TIP', u'蒂巴扎'),
        ('TIS', u'蒂斯姆西勒特'),
        ('GHA', u'盖尔达耶'),
        ('GUE', u'盖尔马'),
        ('KHE', u'罕西拉'),
        ('REL', u'赫利赞'),
        ('JIJ', u'吉杰尔'),
        ('DJE', u'杰勒法'),
        ('CZL', u'君士坦丁'),
        ('LAG', u'拉格瓦特'),
        ('MUA', u'马斯卡拉'),
        ('MED', u'麦迪亚'),
        ('MIL', u'密拉'),
        ('MOS', u'莫斯塔加纳姆'),
        ('MSI', u'姆西拉'),
        ('NAA', u'纳阿马'),
        ('SET', u'塞蒂夫'),
        ('SAI', u'赛伊达'),
        ('SKI', u'斯基克达'),
        ('SAH', u'苏克·阿赫拉斯'),
        ('ETA', u'塔里夫'),
        ('TAM', u'塔曼拉塞特'),
        ('TEB', u'特贝萨'),
        ('TLE', u'特莱姆森'),
        ('IOU', u'提济乌祖'),
        ('TIA', u'提亚雷特'),
        ('TIN', u'廷杜夫'),
        ('EOU', u'瓦德'),
        ('OUA', u'瓦尔格拉'),
        ('OEB', u'乌姆布阿基'),
        ('SBA', u'西迪贝勒阿贝斯'),
        ('CHL', u'谢里夫'),
        ('ILL', u'伊利齐')
    ),

    'AFG': (
        ('HEA', u'赫拉特'),
        ('KBL', u'喀布尔'),
        ('KDH', u'坎大哈'),
        ('MZR', u'马扎里沙里夫')
    ),

    'ARG': (
        ('PRA', u'巴拉那'),
        ('VDM', u'别德马'),
        ('PSS', u'波萨达斯'),
        ('BHI', u'布兰卡港'),
        ('BUE', u'布宜诺斯艾利斯'),
        ('FMA', u'福莫萨'),
        ('JUJ', u'胡胡伊'),
        ('CTC', u'卡塔马卡'),
        ('COR', u'科尔多瓦'),
        ('CNQ', u'科连特斯'),
        ('VLK', u'克劳斯城'),
        ('COC', u'肯考迪娅'),
        ('IRJ', u'拉里奥哈'),
        ('LPG', u'拉普拉塔'),
        ('RES', u'雷西斯滕匹亚'),
        ('RGL', u'里奥加耶戈斯'),
        ('RCU', u'里奥夸尔托'),
        ('CRD', u'里瓦达维亚海军准将城'),
        ('ROS', u'罗萨里奥'),
        ('RWO', u'罗森'),
        ('MDQ', u'马德普拉塔'),
        ('MDZ', u'门多萨'),
        ('NQN', u'内乌肯'),
        ('SLA', u'萨尔塔'),
        ('SDE', u'圣地亚哥-德尔埃斯特罗'),
        ('SFN', u'圣菲'),
        ('UAQ', u'圣胡安'),
        ('AFA', u'圣拉斐尔'),
        ('LUQ', u'圣路易斯'),
        ('RSA', u'圣罗莎'),
        ('SMC', u'圣米格尔-德图库曼'),
        ('SNS', u'圣尼古拉斯'),
        ('REL', u'特雷利乌'),
        ('USH', u'乌斯怀亚')
    ),

    'ARE': (
        ('AZ', u'阿布扎比'),
        ('AL', u'艾因'),
        ('DU', u'迪拜'),
        ('SH', u'沙迦')
    ),

    'OMN': (
        ('BA', u'巴提奈地区'),
        ('ZA', u'达希莱地区'),
        ('SH', u'东部地区'),
        ('MA', u'马斯喀特省'),
        ('MU', u'穆桑达姆省'),
        ('DA', u'内地地区'),
        ('WU', u'中部地区'),
        ('ZU', u'佐法尔省')
    ),

    'AZE': (
        ('ABS', u'阿布歇隆'),
        ('XAC', u'哈奇马斯'),
        ('KAL', u'卡尔巴卡尔'),
        ('QAZ', u'卡扎赫'),
        ('LAN', u'连科兰'),
        ('MQA', u'密尔-卡拉巴赫'),
        ('MSA', u'穆甘-萨连'),
        ('NQA', u'纳戈尔诺－卡拉巴赫'),
        ('NX', u'纳希切万'),
        ('PRI', u'普利亚拉克斯'),
        ('SA', u'舍基'),
        ('SMC', u'苏姆盖特'),
        ('SIR', u'锡尔万'),
        ('GA', u'占贾')
    ),

    'EGY': (
        ('ASW', u'阿斯旺'),
        ('GBY', u'古尔代盖'),
        ('CAI', u'开罗'),
        ('SKH', u'苏布拉开马'),
        ('ALY', u'亚历山大')
    ),

    'ETH': (
        ('AF', u'阿法尔'),
        ('AH', u'阿姆哈拉'),
        ('OR', u'奥罗米亚'),
        ('BG', u'宾香古尔'),
        ('DD', u'德雷达瓦'),
        ('GB', u'甘贝拉各族'),
        ('HR', u'哈勒里民族'),
        ('SN', u'南方各族'),
        ('SM', u'索马里'),
        ('TG', u'提格雷'),
        ('AA', u'亚的斯亚贝巴')
    ),

    'IRL': (
        ('OF', u'奥法利'),
        ('TP', u'蒂珀雷里'),
        ('DB', u'都柏林'),
        ('DG', u'多内加尔'),
        ('GW', u'戈尔韦'),
        ('KD', u'基尔代尔'),
        ('KK', u'基尔肯尼'),
        ('CV', u'卡范'),
        ('CW', u'卡洛'),
        ('KR', u'凯里'),
        ('CK', u'科克'),
        ('CL', u'克莱尔'),
        ('LF', u'朗福德'),
        ('LT', u'劳斯'),
        ('LA', u'崂斯'),
        ('LM', u'利默里克'),
        ('LR', u'利特里姆'),
        ('RC', u'罗斯康芒'),
        ('MY', u'梅奥'),
        ('MT', u'米斯'),
        ('MG', u'莫内根'),
        ('SL', u'斯莱戈'),
        ('WK', u'威克洛'),
        ('WX', u'韦克斯福德'),
        ('WF', u'沃特福德'),
        ('WM', u'西米斯')
    ),

    'EST': (
        ('65', u'贝尔瓦'),
        ('37', u'哈留'),
        ('70', u'拉普拉'),
        ('57', u'里亚内'),
        ('67', u'帕尔努'),
        ('74', u'萨雷'),
        ('78', u'塔尔图'),
        ('82', u'瓦尔加'),
        ('84', u'维良地'),
        ('59', u'维鲁'),
        ('86', u'沃鲁'),
        ('39', u'希尤'),
        ('51', u'耶尔韦'),
        ('49', u'耶盖瓦'),
        ('44', u'依达－维鲁')
    ),

    'AND': (
        ('7', u'安道尔城'),
        ('5', u'奥尔迪诺'),
        ('3', u'恩坎普'),
        ('2', u'卡尼略'),
        ('8', u'莱塞斯卡尔德－恩戈尔达'),
        ('4', u'马萨纳'),
        ('6', u'圣胡利娅－德洛里亚')
    ),

    'AGO': (
        ('CNO', u'北宽扎'),
        ('LNO', u'北隆达'),
        ('BGO', u'本戈'),
        ('BGU', u'本格拉'),
        ('BIE', u'比耶'),
        ('CAB', u'卡宾达'),
        ('CNN', u'库内内'),
        ('CCU', u'宽多库邦戈'),
        ('LUA', u'罗安达'),
        ('MAL', u'马兰热'),
        ('MOX', u'莫希科'),
        ('NAM', u'纳米贝'),
        ('CUS', u'南宽扎'),
        ('LSU', u'南隆达'),
        ('HUA', u'万博'),
        ('HUI', u'威拉'),
        ('UIG', u'威热'),
        ('ZAI', u'扎伊尔')
    ),

    'AUS:NT': (
        ('PAL', u'北帕默斯顿'),
        ('DRW', u'达尔文')
    ),

    'AUS:ACT': (
        ('CBR', u'堪培拉')
    ),

    'AUS:QLD': (
        ('BNE', u'布里斯班'),
        ('OOL', u'黄金海岸'),
        ('CNS', u'凯恩斯'),
        ('CUD', u'日光海岸'),
        ('TSV', u'汤斯维尔'),
        ('TWB', u'图文巴')
    ),

    'AUS:SA': (
        ('ADL', u'阿德莱德'),
        ('PUG', u'奥古斯塔港'),
        ('MGB', u'甘比亚山'),
        ('WAY', u'怀阿拉'),
        ('PLO', u'林肯港'),
        ('MYB', u'默里布里奇'),
        ('PPI', u'皮里港'),
        ('VHA', u'维克托港')
    ),

    'AUS:TAS': (
        ('BWT', u'伯尼港'),
        ('DPO', u'德文波特'),
        ('HBA', u'霍巴特'),
        ('LST', u'朗塞斯顿')
    ),

    'AUS:VIC': (
        ('GEX', u'吉朗'),
        ('MEL', u'墨尔本')
    ),

    'AUS:WA': (
        ('ALH', u'奥尔巴尼'),
        ('BUY', u'班伯里'),
        ('FRE', u'弗里曼特尔港'),
        ('GET', u'杰拉尔顿'),
        ('KGI', u'卡尔古利'),
        ('MDU', u'曼哲拉'),
        ('PER', u'珀斯')
    ),

    'AUS:NSW': (
        ('NTL', u'纽卡斯尔'),
        ('WOL', u'伍伦贡'),
        ('HBS', u'悉尼')
    ),

    'AUT': (
        ('BUR', u'布尔根兰'),
        ('TYR', u'蒂罗尔'),
        ('VOR', u'福拉尔贝格'),
        ('CAT', u'克恩顿'),
        ('SZG', u'萨尔茨堡'),
        ('UAU', u'上奥地利'),
        ('STY', u'施蒂利亚'),
        ('VDD', u'维也纳'),
        ('LAU', u'下奥地利')
    ),

    'PNG': (
        ('NO', u'北部'),
        ('BV', u'布干维尔'),
        ('EH', u'东部高地'),
        ('ES', u'东塞皮克'),
        ('EB', u'东新不列颠'),
        ('EN', u'恩加'),
        ('GU', u'海湾'),
        ('MD', u'马当'),
        ('MN', u'马努斯'),
        ('MB', u'米尔恩湾'),
        ('NC', u'莫尔兹比港'),
        ('MR', u'莫罗贝'),
        ('SH', u'南部高地'),
        ('SI', u'钦布'),
        ('SA', u'桑道恩'),
        ('WE', u'西部'),
        ('WH', u'西部高地'),
        ('WB', u'西新不列颠'),
        ('NI', u'新爱尔兰')
    ),

    'PAK': (
        ('PEW', u'白沙瓦'),
        ('LYP', u'费萨拉巴德'),
        ('GUJ', u'故吉软瓦拉'),
        ('HDD', u'海德拉巴'),
        ('KCT', u'卡拉奇'),
        ('LHE', u'拉合尔'),
        ('RWP', u'拉瓦尔品第'),
        ('MUX', u'木尔坦'),
        ('ISB', u'伊斯兰堡')
    ),

    'PRY': (
        ('AM', u'阿曼拜'),
        ('PH', u'阿耶斯总统省'),
        ('PA', u'巴拉瓜里'),
        ('BO', u'博克龙'),
        ('GU', u'瓜伊拉'),
        ('CG', u'卡瓜苏'),
        ('CN', u'卡嫩迪尤'),
        ('CZ', u'卡萨帕'),
        ('CC', u'康塞普西翁'),
        ('CD', u'科迪勒拉'),
        ('MI', u'米西奥内斯'),
        ('NE', u'涅恩布库'),
        ('AG', u'上巴拉圭'),
        ('AN', u'上巴拉那'),
        ('SP', u'圣佩德罗'),
        ('AS', u'亚松森特别区'),
        ('IT', u'伊塔普亚'),
        ('CE', u'中央')
    ),

    'PSE': (
        ('GZ', u'加沙地带'),
        ('WE', u'西岸')
    ),

    'BHR': (
        ('5', u'北部'),
        ('1', u'哈德'),
        ('12', u'哈马德'),
        ('9', u'里法'),
        ('3', u'麦纳麦'),
        ('2', u'穆哈拉格'),
        ('10', u'西部'),
        ('8', u'伊萨城'),
        ('7', u'中部')
    ),

    'BRA': (
        ('AC', u'阿克里'),
        ('AL', u'阿拉戈斯'),
        ('AP', u'阿马帕'),
        ('PR', u'巴拉那'),
        ('BSB', u'巴西利亚'),
        ('BA', u'巴伊亚'),
        ('RN', u'北里奥格兰德'),
        ('PE', u'伯南布哥'),
        ('GO', u'戈亚斯'),
        ('RO', u'朗多尼亚'),
        ('RJ', u'里约热内卢'),
        ('RR', u'罗赖马'),
        ('MA', u'马拉尼昂'),
        ('MT', u'马托格罗索'),
        ('MG', u'米纳斯吉拉斯'),
        ('RS', u'南里奥格兰德'),
        ('MS', u'南马托格罗索'),
        ('PA', u'帕拉'),
        ('PB', u'帕拉伊巴'),
        ('PI', u'皮奥伊'),
        ('CE', u'塞阿拉'),
        ('SE', u'塞尔希培'),
        ('ES', u'圣埃斯皮里图'),
        ('SP', u'圣保罗'),
        ('SC', u'圣卡塔琳娜'),
        ('TO', u'托坎廷斯'),
        ('AM', u'亚马孙')
    ),

    'BLR': (
        ('BR', u'布列斯特'),
        ('HO', u'戈梅利'),
        ('HR', u'格罗德诺'),
        ('MI', u'明斯克市'),
        ('MA', u'莫吉廖夫'),
        ('VI', u'维捷布斯克')
    ),

    'BGR': (
        ('BOJ', u'布尔加斯'),
        ('KHO', u'卡斯科伏'),
        ('ROU', u'鲁塞'),
        ('LVP', u'洛维奇'),
        ('OZA', u'蒙塔纳'),
        ('PDV', u'普罗夫迪夫'),
        ('SOF', u'索非亚'),
        ('GSO', u'索非亚市'),
        ('VAR', u'瓦尔纳')
    ),

    'BEN': (
        ('AL', u'阿黎博里'),
        ('AK', u'阿塔科拉'),
        ('LI', u'滨海'),
        ('BOH', u'波希康市'),
        ('BO', u'博尔古'),
        ('AQ', u'大西洋'),
        ('PL', u'高原'),
        ('KO', u'库福'),
        ('MO', u'莫诺'),
        ('CO', u'丘陵'),
        ('OU', u'韦梅'),
        ('DO', u'峡谷'),
        ('ZO', u'祖')
    ),

    'BEL': (
        ('WHT', u'埃诺'),
        ('VAN', u'安特卫普'),
        ('WBR', u'布拉班特-瓦隆'),
        ('BRU', u'布鲁塞尔'),
        ('VOV', u'东佛兰德'),
        ('VBR', u'佛兰芒-布拉班特'),
        ('WLG', u'列日'),
        ('VLI', u'林堡'),
        ('WLX', u'卢森堡'),
        ('WNA', u'那慕尔'),
        ('VWV', u'西佛兰德')
    ),

    'POL': (
        ('ELB', u'埃尔布隆格'),
        ('OLS', u'奥尔什丁'),
        ('OSS', u'奥斯特罗文卡'),
        ('BZG', u'比得哥什'),
        ('PIO', u'彼得库夫'),
        ('BYT', u'比托姆'),
        ('BAP', u'比亚瓦波德拉斯卡'),
        ('BIA', u'比亚维斯托克'),
        ('OPO', u'波莱'),
        ('POZ', u'波兹南'),
        ('DAB', u'达布罗瓦戈尼察'),
        ('GOW', u'大波兰地区戈茹夫'),
        ('WRO', u'弗罗茨瓦夫'),
        ('WLO', u'弗沃茨瓦韦克'),
        ('GDN', u'格但斯克'),
        ('GDY', u'格丁尼亚'),
        ('GWC', u'格利维采'),
        ('GRU', u'格鲁琼兹'),
        ('CHO', u'海乌姆'),
        ('WAW', u'华沙'),
        ('CHZ', u'霍茹夫'),
        ('KAL', u'卡利什'),
        ('KTW', u'卡托维兹'),
        ('KLC', u'凯尔采'),
        ('KON', u'科宁'),
        ('OSZ', u'科沙林'),
        ('KRK', u'克拉科夫'),
        ('KRO', u'克罗斯诺'),
        ('RDM', u'拉多姆'),
        ('LEG', u'莱格尼察'),
        ('LEZ', u'莱什诺'),
        ('LUL', u'卢布林'),
        ('RDS', u'鲁达'),
        ('LOD', u'罗兹'),
        ('IEG', u'绿山城'),
        ('MYL', u'米什洛维采'),
        ('PIL', u'皮瓦'),
        ('PRZ', u'普热梅希尔'),
        ('PLO', u'普沃茨克'),
        ('CIE', u'切哈努夫'),
        ('RZE', u'热舒夫'),
        ('SZZ', u'什切青'),
        ('SKI', u'斯凯尔涅维采'),
        ('SLP', u'斯武普斯克'),
        ('SWL', u'苏瓦乌基'),
        ('SOP', u'索波特'),
        ('SWC', u'索斯诺维茨'),
        ('TAR', u'塔尔努夫'),
        ('QEP', u'塔尔诺布热格'),
        ('TYY', u'特切'),
        ('TOR', u'托伦'),
        ('WZH', u'瓦乌布日赫'),
        ('QOY', u'沃姆扎'),
        ('SOW', u'希米亚诺维采'),
        ('SWI', u'希维诺乌伊希切'),
        ('SWT', u'希维托赫洛维采'),
        ('SDC', u'谢德尔采'),
        ('SIR', u'谢拉兹'),
        ('NOW', u'新松奇'),
        ('JAW', u'雅沃兹诺'),
        ('JEG', u'耶莱尼亚古拉'),
        ('ZAB', u'扎布热'),
        ('ZAM', u'扎莫希奇')
    ),

    'BOL': (
        ('ALT', u'奥尔托'),
        ('ORU', u'奥鲁罗'),
        ('BEN', u'贝尼'),
        ('POI', u'波多西'),
        ('QUI', u'基拉科洛'),
        ('CBB', u'科恰班巴'),
        ('LPB', u'拉巴斯'),
        ('PAN', u'潘多'),
        ('CHU', u'丘基萨卡'),
        ('SAC', u'萨卡巴'),
        ('SRZ', u'圣克鲁斯'),
        ('TJA', u'塔里哈')
    ),

    'BIH': (
        ('FPO', u'波萨维纳'),
        ('FBP', u'波斯尼亚－波德里涅'),
        ('FTO', u'多米斯拉夫格勒'),
        ('FHN', u'黑塞哥维那－涅雷特瓦'),
        ('FSA', u'萨拉热窝'),
        ('FTU', u'图兹拉－波德里涅'),
        ('FUS', u'乌纳－萨纳'),
        ('FHB', u'西波斯尼亚'),
        ('FZH', u'西黑塞哥维那'),
        ('FZE', u'泽尼察－多博伊'),
        ('FSB', u'中波斯尼亚')
    ),

    'BLZ': (
        ('BZ', u'伯利兹'),
        ('OW', u'橘园'),
        ('CY', u'卡约'),
        ('CR', u'科罗萨尔'),
        ('SC', u'斯坦港'),
        ('TO', u'托莱多')
    ),

    'BFA': (
        ('BAL', u'巴雷'),
        ('BAM', u'巴姆'),
        ('BAN', u'巴瓦'),
        ('BAZ', u'巴泽加'),
        ('PON', u'波尼'),
        ('BLG', u'布尔古'),
        ('BOK', u'布尔基恩德'),
        ('BOR', u'布古里巴'),
        ('GAN', u'冈祖尔古'),
        ('GOU', u'古尔马'),
        ('ZIR', u'济罗'),
        ('KAD', u'卡焦戈'),
        ('KEN', u'凯内杜古'),
        ('KOO', u'科蒙加里'),
        ('COM', u'科莫埃'),
        ('KOP', u'孔皮恩加'),
        ('KOS', u'孔西'),
        ('KOL', u'库尔佩罗戈'),
        ('KOW', u'库尔维奥戈'),
        ('KOT', u'库里滕加'),
        ('LER', u'雷拉巴'),
        ('LOR', u'罗卢姆'),
        ('MOU', u'穆翁'),
        ('NAM', u'纳门滕加'),
        ('NAH', u'纳乌里'),
        ('NAY', u'纳亚拉'),
        ('GNA', u'尼亚尼亚'),
        ('NOU', u'努姆比埃尔'),
        ('PAS', u'帕索雷'),
        ('SEN', u'塞诺'),
        ('SAG', u'桑吉'),
        ('SAM', u'桑马滕加'),
        ('SOR', u'苏鲁'),
        ('SOM', u'苏姆'),
        ('TAP', u'塔波阿'),
        ('TUY', u'图伊'),
        ('HOU', u'乌埃'),
        ('OUB', u'乌布里滕加'),
        ('OUD', u'乌达兰'),
        ('SIS', u'锡西里'),
        ('YAG', u'亚加'),
        ('YAT', u'亚滕加'),
        ('IOA', u'伊奥巴'),
        ('ZOW', u'宗德韦奥戈'),
        ('ZOD', u'宗多马')
    ),

    'BDI': (
        ('BB', u'布班扎'),
        ('BR', u'布鲁里'),
        ('BM', u'布琼布拉城市'),
        ('BU', u'布琼布拉乡村'),
        ('NG', u'恩戈齐'),
        ('KI', u'基龙多'),
        ('GI', u'基特加'),
        ('KR', u'卡鲁济'),
        ('KY', u'卡扬扎'),
        ('CA', u'坎库佐'),
        ('RT', u'鲁塔纳'),
        ('RY', u'鲁伊吉'),
        ('MA', u'马坎巴'),
        ('MU', u'穆拉姆维亚'),
        ('MW', u'穆瓦洛'),
        ('MY', u'穆因加'),
        ('CI', u'锡比托凯')
    ),

    'PRK': (
        ('HAE', u'海州'),
        ('HYE', u'惠山'),
        ('KAN', u'江界'),
        ('KSN', u'开城'),
        ('NAS', u'罗先'),
        ('NAM', u'南浦'),
        ('FNJ', u'平壤'),
        ('CHO', u'清津'),
        ('SAR', u'沙里院'),
        ('HAM', u'咸兴'),
        ('SII', u'新义州'),
        ('WON', u'元山')
    ),

    'DNK': (
        ('AR', u'奥胡斯'),
        ('VSV', u'北日德兰'),
        ('BO', u'博恩霍尔姆'),
        ('FRE', u'菲特烈堡'),
        ('FY', u'菲茵'),
        ('CPH', u'哥本哈根'),
        ('RIB', u'里伯'),
        ('RKG', u'灵克宾'),
        ('RKE', u'罗斯基勒'),
        ('VBI', u'南日德兰'),
        ('ST', u'斯多斯特姆'),
        ('VIB', u'维堡'),
        ('VEJ', u'维厄勒'),
        ('VS', u'西希兰')
    ),

    'DEU': (
        ('ARN', u'阿恩斯贝格'),
        ('ERF', u'爱尔福特'),
        ('ANS', u'安斯巴格'),
        ('AGB', u'奥格斯堡'),
        ('BE', u'柏林'),
        ('BYU', u'拜伊罗特'),
        ('BFE', u'比勒费尔德'),
        ('POT', u'波茨坦'),
        ('BOM', u'波鸿'),
        ('HB', u'不来梅'),
        ('BRW', u'不伦瑞克'),
        ('DAR', u'达姆施塔特'),
        ('DET', u'代特莫尔特'),
        ('DRS', u'德累斯顿'),
        ('DES', u'德绍'),
        ('DUS', u'杜塞尔多夫'),
        ('FFO', u'法兰克福'),
        ('FBG', u'弗赖堡'),
        ('HAE', u'哈雷'),
        ('HH', u'汉堡'),
        ('HAJ', u'汉诺威'),
        ('KEL', u'基尔'),
        ('GBN', u'吉森'),
        ('KAE', u'卡尔斯鲁厄'),
        ('KAS', u'卡塞尔'),
        ('CHE', u'开姆尼斯'),
        ('KOB', u'科布伦次'),
        ('CGN', u'科隆'),
        ('LEJ', u'莱比锡'),
        ('LDH', u'兰茨胡特'),
        ('LBG', u'吕讷堡'),
        ('MAG', u'马格德堡'),
        ('MHG', u'曼海姆'),
        ('MAI', u'美因兹'),
        ('MUN', u'明斯特'),
        ('MUC', u'慕尼黑'),
        ('NUE', u'纽伦堡'),
        ('SWH', u'什未林'),
        ('STR', u'斯图加特'),
        ('TRI', u'特里尔'),
        ('WIB', u'威斯巴登'),
        ('WUG', u'维尔茨堡')
    ),

    'TLS': (
        ('AL', u'阿伊莱乌'),
        ('AN', u'阿伊纳罗'),
        ('ER', u'埃尔梅拉'),
        ('AM', u'安贝诺'),
        ('BA', u'包考'),
        ('BO', u'博博纳罗'),
        ('DI', u'帝力'),
        ('KO', u'科瓦利马'),
        ('LA', u'劳滕'),
        ('LI', u'利基卡'),
        ('MT', u'马纳图托'),
        ('MF', u'马努法伊'),
        ('VI', u'维克克')
    ),

    'TGO': (
        ('M', u'滨海区'),
        ('S', u'草原区'),
        ('P', u'高原区'),
        ('K', u'卡拉区'),
        ('C', u'中部区')
    ),

    'RUS': (
        ('ABA', u'阿巴坎'),
        ('ARK', u'阿尔汉格尔斯克'),
        ('AGI', u'阿金斯科耶'),
        ('DYR', u'阿纳德尔'),
        ('AST', u'阿斯特拉罕'),
        ('ESL', u'埃利斯塔'),
        ('ORL', u'奥廖尔'),
        ('ORE', u'奥伦堡'),
        ('BAX', u'巴尔瑙尔'),
        ('PNZ', u'奔萨'),
        ('PKC', u'彼得罗巴甫洛夫斯克'),
        ('PES', u'彼得罗扎沃茨克'),
        ('PER', u'彼尔姆'),
        ('BBZ', u'比罗比詹'),
        ('BEL', u'别尔哥罗德'),
        ('COK', u'伯力'),
        ('BQS', u'布拉戈维申斯克'),
        ('BRY', u'布良斯克'),
        ('CHE', u'车里雅宾斯克'),
        ('CHI', u'赤塔'),
        ('ROS', u'顿河畔罗斯托夫'),
        ('OMS', u'鄂木斯克'),
        ('VOG', u'伏尔加格勒'),
        ('VMR', u'弗拉基米尔'),
        ('VLA', u'弗拉季高加索'),
        ('GOA', u'戈尔诺－阿尔泰斯克'),
        ('GRV', u'格罗兹尼'),
        ('VVO', u'海参崴'),
        ('KHM', u'汉特－曼西斯克'),
        ('KIR', u'基洛夫'),
        ('KGD', u'加里宁格勒'),
        ('KZN', u'喀山'),
        ('KLF', u'卡卢加'),
        ('KOS', u'科斯特罗马'),
        ('KRR', u'克拉斯诺达尔'),
        ('KYA', u'克拉斯诺亚尔斯克'),
        ('KEM', u'克麦罗沃'),
        ('KYZ', u'克孜勒'),
        ('KUD', u'库德姆卡尔'),
        ('KRO', u'库尔干'),
        ('URS', u'库尔斯克'),
        ('LIP', u'利佩茨克'),
        ('RYA', u'梁赞'),
        ('MCX', u'马哈奇卡拉'),
        ('MAG', u'马加丹'),
        ('IN', u'马加斯'),
        ('MAY', u'迈科普'),
        ('MMK', u'摩尔曼斯克'),
        ('MOW', u'莫斯科'),
        ('NAL', u'纳尔奇克'),
        ('NNM', u'纳里扬马尔'),
        ('JSA', u'南萨哈林斯克'),
        ('VUS', u'诺夫哥罗德'),
        ('PAL', u'帕拉纳'),
        ('PSK', u'普斯科夫'),
        ('CSY', u'切博克萨雷'),
        ('CKS', u'切尔克斯克'),
        ('TYU', u'秋明'),
        ('SAR', u'萨拉托夫'),
        ('SKX', u'萨兰斯克'),
        ('SLY', u'萨列哈尔德'),
        ('SAM', u'萨马拉'),
        ('SCW', u'瑟克特夫卡尔'),
        ('SPE', u'圣彼得堡'),
        ('LNX', u'斯摩棱斯克'),
        ('STA', u'斯塔夫罗波尔'),
        ('TAM', u'坦波夫'),
        ('TVE', u'特维尔'),
        ('TUL', u'图拉'),
        ('TOM', u'托木斯克'),
        ('VOR', u'沃罗涅什'),
        ('VLG', u'沃洛格达'),
        ('UFA', u'乌法'),
        ('UUD', u'乌兰乌德'),
        ('ULY', u'乌里扬诺夫斯克'),
        ('UOB', u'乌斯季奥尔登斯基'),
        ('GOJ', u'下诺夫哥罗德'),
        ('NVS', u'新西伯利亚'),
        ('JAK', u'雅库茨克'),
        ('JAR', u'雅罗斯拉夫尔'),
        ('JEK', u'叶卡捷林堡'),
        ('IKT', u'伊尔库茨克'),
        ('IJK', u'伊热夫斯克'),
        ('IVO', u'伊万诺沃'),
        ('YOL', u'约什卡尔奥拉')
    ),

    'ECU': (
        ('A', u'阿苏艾'),
        ('O', u'埃尔奥罗'),
        ('E', u'埃斯梅拉尔达斯'),
        ('B', u'玻利瓦尔'),
        ('G', u'瓜亚斯'),
        ('W', u'加拉帕戈斯'),
        ('C', u'卡尔奇'),
        ('F', u'卡尼亚尔'),
        ('X', u'科托帕希'),
        ('L', u'洛哈'),
        ('R', u'洛斯里奥斯'),
        ('M', u'马纳比'),
        ('S', u'莫罗纳－圣地亚哥'),
        ('D', u'纳波，奥雷利亚纳'),
        ('Y', u'帕斯塔萨'),
        ('P', u'皮钦查'),
        ('H', u'钦博拉索'),
        ('Z', u'萨莫拉－钦奇佩'),
        ('U', u'苏昆毕奥斯'),
        ('T', u'通古拉瓦'),
        ('I', u'因巴布拉')
    ),

    'ERI': (
        ('KE', u'安塞巴'),
        ('SK', u'北红海'),
        ('BR', u'加什·巴尔卡'),
        ('DE', u'南部'),
        ('DK', u'南红海'),
        ('MA', u'中部')
    ),

    'FRA': (
        ('ARL', u'阿尔勒'),
        ('AJA', u'阿雅克修'),
        ('QXB', u'艾克斯'),
        ('ORR', u'奥尔良'),
        ('PAR', u'巴黎'),
        ('BSN', u'贝桑松'),
        ('DIJ', u'第戎'),
        ('FRJ', u'弗雷瑞斯'),
        ('CFR', u'卡昂'),
        ('RNS', u'雷恩'),
        ('LIO', u'里昂'),
        ('LLE', u'里尔'),
        ('LIG', u'利摩日'),
        ('URO', u'鲁昂'),
        ('MRS', u'马赛'),
        ('MZM', u'梅斯'),
        ('MPL', u'蒙彼利埃'),
        ('NTE', u'南特'),
        ('NCE', u'尼斯'),
        ('CSM', u'沙隆'),
        ('TLS', u'图卢兹'),
        ('VAA', u'瓦朗斯'),
        ('AMI', u'亚眠')
    ),

    'PHL': (
        ('DOR', u'达沃'),
        ('CAO', u'卡卢坎'),
        ('MNL', u'马尼拉'),
        ('CEB', u'宿务')
    ),

    'FIN': (
        ('ESP', u'埃斯波'),
        ('OLU', u'奥卢'),
        ('POR', u'波里'),
        ('PRV', u'博尔沃'),
        ('HMY', u'海门林纳'),
        ('HEL', u'赫尔辛基'),
        ('KAJ', u'卡亚尼'),
        ('KOK', u'科科拉'),
        ('KTK', u'科特卡'),
        ('KUO', u'库奥皮奥'),
        ('LHI', u'拉赫蒂'),
        ('LPP', u'拉彭兰塔'),
        ('RVN', u'罗瓦涅米'),
        ('MHQ', u'玛丽港'),
        ('MIK', u'米凯利'),
        ('TMP', u'坦佩雷'),
        ('TKU', u'图尔库'),
        ('VAA', u'瓦萨'),
        ('VAT', u'万塔'),
        ('JOE', u'约恩苏')
    ),

    'CPV': (
        ('PA', u'保尔'),
        ('PN', u'波多诺伏'),
        ('BV', u'博阿维斯塔岛'),
        ('BR', u'布拉瓦岛'),
        ('RG', u'大里贝拉'),
        ('FO', u'福古岛'),
        ('MA', u'马尤岛'),
        ('MO', u'莫斯特罗'),
        ('PR', u'普拉亚'),
        ('SL', u'萨尔岛'),
        ('SA', u'圣安唐岛'),
        ('IA', u'圣地亚哥岛'),
        ('SD', u'圣多明戈'),
        ('SF', u'圣菲利普'),
        ('CA', u'圣卡塔琳娜'),
        ('CR', u'圣克鲁斯'),
        ('SM', u'圣米戈尔'),
        ('SN', u'圣尼古拉岛'),
        ('SV', u'圣维森特岛'),
        ('TA', u'塔拉法尔')
    ),

    'COL': (
        ('ARA', u'阿劳卡'),
        ('ANT', u'安提奥基亚'),
        ('NDS', u'北桑坦德'),
        ('BDC', u'波哥大首都区'),
        ('BOL', u'博利瓦尔'),
        ('BOY', u'博亚卡'),
        ('ATL', u'大西洋'),
        ('GVR', u'瓜维亚雷'),
        ('GJR', u'瓜希拉'),
        ('GNA', u'瓜伊尼亚'),
        ('QUI', u'金迪奥'),
        ('CAL', u'卡尔达斯'),
        ('CAQ', u'卡克塔'),
        ('CAS', u'卡萨纳雷'),
        ('CAU', u'考卡'),
        ('VDC', u'考卡山谷'),
        ('COR', u'科尔多巴'),
        ('CAM', u'昆迪纳马卡'),
        ('RIS', u'利萨拉尔达'),
        ('MAG', u'马格达雷那'),
        ('MET', u'梅塔'),
        ('NAR', u'纳里尼奥'),
        ('PUT', u'普图马约'),
        ('CHO', u'乔科'),
        ('CES', u'塞萨尔'),
        ('SAN', u'桑坦德'),
        ('SAP', u'圣安德烈斯-普罗维登西亚'),
        ('SUC', u'苏克雷'),
        ('TOL', u'托利马'),
        ('VIC', u'维查达'),
        ('VAU', u'沃佩斯'),
        ('HUI', u'乌伊拉'),
        ('AMZ', u'亚马孙')
    ),

    'CRI': (
        ('A', u'阿拉胡埃拉'),
        ('H', u'埃雷迪亚'),
        ('G', u'瓜纳卡斯特'),
        ('C', u'卡塔戈'),
        ('L', u'利蒙'),
        ('P', u'蓬塔雷纳斯'),
        ('SJ', u'圣何塞')
    ),

    'CUB': (
        ('11', u'奥尔金'),
        ('1', u'比那尔德里奥'),
        ('5', u'比亚克拉拉'),
        ('12', u'格拉玛'),
        ('14', u'关塔那摩'),
        ('2', u'哈瓦那'),
        ('3', u'哈瓦那城'),
        ('9', u'卡马圭'),
        ('10', u'拉斯图纳斯'),
        ('4', u'马坦萨斯'),
        ('MAY', u'马亚里'),
        ('MZO', u'曼萨尼罗'),
        ('99', u'青年岛特区'),
        ('13', u'圣地亚哥'),
        ('7', u'圣斯皮里图斯'),
        ('6', u'西恩富戈斯'),
        ('8', u'谢戈德阿维拉')
    ),

    'GUY': (
        ('EW', u'埃塞奎博群岛-西德梅拉拉'),
        ('BW', u'巴里马-瓦伊尼'),
        ('PM', u'波默伦-苏佩纳姆'),
        ('PI', u'波塔罗-锡帕鲁尼'),
        ('DM', u'德梅拉拉-马海卡'),
        ('EC', u'东伯比斯-科兰太因'),
        ('CM', u'库尤尼-马扎鲁尼'),
        ('MB', u'马海卡-伯比斯'),
        ('UD', u'上德梅拉拉-伯比斯'),
        ('UT', u'上塔库图-上埃塞奎博')
    ),

    'KAZ': (
        ('AYK', u'阿尔卡累克'),
        ('AKM', u'阿克莫拉'),
        ('AKS', u'阿克苏'),
        ('AKT', u'阿克托别'),
        ('ALA', u'阿拉木图'),
        ('ARY', u'阿雷斯'),
        ('AST', u'阿斯塔纳市'),
        ('ATY', u'阿特劳'),
        ('EKB', u'埃基巴斯图兹'),
        ('BXH', u'巴尔喀什'),
        ('PAV', u'巴甫洛达尔'),
        ('SEV', u'北哈萨克斯坦'),
        ('VOS', u'东哈萨克斯坦'),
        ('ZYR', u'济良诺夫斯克'),
        ('DMB', u'江布尔'),
        ('DZH', u'杰兹卡兹甘'),
        ('KAR', u'卡拉干达'),
        ('KZO', u'卡拉扎尔'),
        ('KAP', u'卡普恰盖'),
        ('KST', u'科斯塔奈'),
        ('KZY', u'克孜勒奥尔达'),
        ('KEN', u'肯套'),
        ('KUR', u'库尔恰托夫'),
        ('LKK', u'利萨科夫斯克'),
        ('LEN', u'列宁诺戈尔斯克'),
        ('RUD', u'鲁德内'),
        ('MAN', u'曼格斯套'),
        ('KGT', u'南哈萨克斯坦'),
        ('SAR', u'萨兰'),
        ('SEM', u'塞梅伊'),
        ('SAK', u'沙赫京斯克'),
        ('STE', u'斯捷普诺戈尔斯克'),
        ('TEK', u'铁克利'),
        ('TEM', u'铁米尔套'),
        ('TUR', u'突厥斯坦'),
        ('ZAP', u'西哈萨克斯坦'),
        ('ZHA', u'扎纳奥津')
    ),

    'KOR:27': (
        ('DSG', u'达城郡'),
        ('TAE', u'大邱'),
        ('SUS', u'寿城区')
    ),

    'KOR:42': (
        ('CHC', u'春川市'),
        ('TGH', u'东海市'),
        ('GSG', u'高城郡'),
        ('HSG', u'横城郡'),
        ('HCN', u'洪川郡'),
        ('HCH', u'华川郡'),
        ('KAG', u'江陵市'),
        ('JSE', u'旌善郡'),
        ('IJE', u'麟蹄郡'),
        ('YWL', u'宁越郡'),
        ('POG', u'平昌郡'),
        ('SUK', u'三陟市'),
        ('SHO', u'束草市'),
        ('TBK', u'太白市'),
        ('CWN', u'铁原郡'),
        ('YNY', u'襄阳郡'),
        ('YGU', u'杨口郡'),
        ('WJU', u'原州市')
    ),

    'KOR:49': (
        ('ASG', u'安城市'),
        ('ASN', u'安山市'),
        ('ANY', u'安养市'),
        ('POC', u'抱川市'),
        ('SEO', u'城南市'),
        ('DDC', u'东豆川市'),
        ('BCN', u'富川市'),
        ('GYG', u'高阳市'),
        ('GMG', u'光明市'),
        ('KWU', u'广州市'),
        ('GCN', u'果川市'),
        ('HNM', u'河南市'),
        ('HCH', u'华城市'),
        ('GPG', u'加平郡'),
        ('GMP', u'金浦市'),
        ('GRI', u'九里市'),
        ('GUN', u'军浦市'),
        ('YJU', u'骊州郡'),
        ('ICE', u'利川市'),
        ('YCN', u'涟川郡'),
        ('YNG', u'龙仁市'),
        ('NYU', u'南杨州市'),
        ('PTK', u'平泽市'),
        ('PJU', u'坡州市'),
        ('SHE', u'始兴市'),
        ('SUO', u'水原市'),
        ('OSN', u'乌山市'),
        ('YPG', u'扬平郡'),
        ('YYU', u'杨州市'),
        ('UWN', u'仪旺市'),
        ('UIJ', u'议政府市')
    ),

    'KOR:43': (
        ('ADG', u'安东市'),
        ('BHA', u'奉化郡'),
        ('GRG', u'高灵郡'),
        ('KUM', u'龟尾市'),
        ('KMC', u'金泉市'),
        ('GWI', u'军威郡'),
        ('YEC', u'醴泉郡'),
        ('KPO', u'浦项市'),
        ('CGK', u'漆谷郡'),
        ('CDO', u'淸道郡'),
        ('CSG', u'靑松郡'),
        ('GYS', u'庆山市'),
        ('GJU', u'庆州市'),
        ('YEJ', u'荣州市'),
        ('SJU', u'尙州市'),
        ('UJN', u'蔚珍郡'),
        ('MGG', u'闻庆市'),
        ('SEJ', u'星州郡'),
        ('USG', u'义城郡'),
        ('YYG', u'英阳郡'),
        ('YDK', u'盈德郡'),
        ('YCH', u'永川市'),
        ('ULG', u'郁陵郡')
    ),

    'KOR:44': (
        ('CNG', u'昌宁郡'),
        ('CHW', u'昌原市'),
        ('GSO', u'固城郡'),
        ('HDG', u'河东郡'),
        ('KMH', u'金海市'),
        ('HIN', u'晋州市'),
        ('GCH', u'居昌郡'),
        ('KJE', u'巨济市'),
        ('YSN', u'梁山市'),
        ('MAS', u'马山市'),
        ('MIR', u'密阳市'),
        ('NHE', u'南海郡'),
        ('SCH', u'山淸郡'),
        ('SAH', u'泗川市'),
        ('TYG', u'统营市'),
        ('HCE', u'陜川郡'),
        ('HAN', u'咸安郡'),
        ('HYG', u'咸阳郡'),
        ('URG', u'宜宁郡'),
        ('CHF', u'鎭海市')
    ),

    'KOR:47': (
        ('SCG', u'淳昌郡'),
        ('PUS', u'扶安郡'),
        ('GCG', u'高敞郡'),
        ('GJE', u'金堤市'),
        ('JEO', u'井邑市'),
        ('MJU', u'茂朱郡'),
        ('NWN', u'南原市'),
        ('JNJ', u'全州市'),
        ('KUV', u'群山市'),
        ('ISL', u'任实郡'),
        ('WAJ', u'完州郡'),
        ('IKS', u'益山市'),
        ('JSU', u'长水郡'),
        ('JAN', u'鎭安郡')
    ),

    'KOR:48': (
        ('BSG', u'宝城郡'),
        ('GHG', u'高兴郡'),
        ('GSE', u'谷城郡'),
        ('WND', u'莞岛郡'),
        ('KAN', u'光阳市'),
        ('HAE', u'海南郡'),
        ('HSN', u'和顺郡'),
        ('GJN', u'康津郡'),
        ('YOS', u'丽水市'),
        ('YGG', u'灵光郡'),
        ('YAM', u'灵岩郡'),
        ('NJU', u'罗州市'),
        ('MOK', u'木浦市'),
        ('GRE', u'求礼郡'),
        ('SYS', u'顺天市'),
        ('DYA', u'潭阳郡'),
        ('MAN', u'务安郡'),
        ('HPG', u'咸平郡'),
        ('SAN', u'新安郡'),
        ('JSN', u'长城郡'),
        ('JHG', u'长兴郡'),
        ('JDO', u'珍岛郡')
    ),

    'KOR:45': (
        ('BEN', u'报恩郡'),
        ('JYG', u'曾坪郡'),
        ('DYG', u'丹阳郡'),
        ('JCH', u'堤川市'),
        ('GSN', u'槐山郡'),
        ('CWO', u'淸原郡'),
        ('CJJ', u'淸州市'),
        ('OCN', u'沃川郡'),
        ('ESG', u'阴城郡'),
        ('YDG', u'永同郡'),
        ('JCN', u'鎭川郡'),
        ('CHU', u'忠州市')
    ),

    'KOR:46': (
        ('BOR', u'保宁市'),
        ('BYO', u'扶余郡'),
        ('GOJ', u'公州市'),
        ('HSE', u'洪城郡'),
        ('GYE', u'鸡龙市'),
        ('GSA', u'锦山郡'),
        ('YOS', u'礼山郡'),
        ('NSN', u'论山市'),
        ('CYG', u'青阳郡'),
        ('SSA', u'瑞山市'),
        ('SCE', u'舒川郡'),
        ('TAN', u'泰安郡'),
        ('TJI', u'唐津郡'),
        ('CHO', u'天安市'),
        ('ASA', u'牙山市'),
        ('YGI', u'燕岐郡')
    ),

    'NLD': (
        ('AER', u'阿尔梅勒'),
        ('AME', u'阿默斯福特'),
        ('AMS', u'阿姆斯特丹'),
        ('ARN', u'阿纳姆'),
        ('APE', u'阿珀尔多伦'),
        ('ASS', u'阿森'),
        ('EDE', u'埃德'),
        ('EMM', u'埃门'),
        ('EIN', u'埃因霍芬'),
        ('BRD', u'布雷达'),
        ('TLB', u'蒂尔堡'),
        ('DOR', u'多德雷赫特'),
        ('ENS', u'恩斯赫德'),
        ('GRQ', u'格罗宁根'),
        ('HRA', u'哈勒姆'),
        ('HAG', u'海牙'),
        ('HFD', u'霍夫多尔普'),
        ('LID', u'莱顿'),
        ('LEY', u'莱利斯塔德'),
        ('RTM', u'鹿特丹'),
        ('LWR', u'吕伐登'),
        ('MST', u'马斯特里赫特'),
        ('MDL', u'米德尔堡'),
        ('NIJ', u'奈梅亨'),
        ('HTB', u'斯海尔托亨博思'),
        ('UTC', u'乌得勒支'),
        ('ZWO', u'兹沃勒'),
        ('ZTM', u'佐特尔梅')
    ),

    'HND': (
        ('AT', u'阿特兰蒂达'),
        ('PA', u'埃尔帕拉伊索'),
        ('OC', u'奥科特佩克'),
        ('OL', u'奥兰乔'),
        ('FM', u'弗朗西斯科-莫拉桑'),
        ('GD', u'格拉西亚斯-阿迪奥斯'),
        ('IB', u'海湾群岛'),
        ('CR', u'科尔特斯'),
        ('CL', u'科隆'),
        ('CM', u'科马亚瓜'),
        ('CP', u'科潘'),
        ('PZ', u'拉巴斯'),
        ('LE', u'伦皮拉'),
        ('CH', u'乔卢特卡'),
        ('CHO', u'乔罗马'),
        ('VA', u'山谷'),
        ('SB', u'圣巴巴拉'),
        ('IN', u'因蒂布卡'),
        ('YO', u'约罗')
    ),

    'KIR': (
        ('PHO', u'菲尼克斯群岛'),
        ('GIL', u'吉尔伯特群岛'),
        ('LIN', u'莱恩群岛')
    ),

    'DJI': (
        ('S', u'阿里萨比赫区'),
        ('O', u'奥博克区'),
        ('K', u'迪基勒区'),
        ('T', u'塔朱拉区')
    ),

    'KGZ': (
        ('O', u'奥什'),
        ('B', u'巴特肯'),
        ('GB', u'比什凯克市'),
        ('C', u'楚河'),
        ('J', u'贾拉拉巴德'),
        ('KBA', u'卡拉巴尔塔'),
        ('KKO', u'卡拉库尔'),
        ('KAN', u'坎特'),
        ('KJ', u'科克扬加克'),
        ('MS', u'迈利赛'),
        ('N', u'纳伦'),
        ('SU', u'苏卢克图'),
        ('T', u'塔拉斯'),
        ('TK', u'塔什库梅尔'),
        ('UG', u'乌兹根'),
        ('Y', u'伊塞克湖')
    ),

    'GIN': (
        ('BOK', u'博凯'),
        ('NZR', u'恩泽雷科雷'),
        ('FRN', u'法拉纳'),
        ('KND', u'金迪亚'),
        ('KNK', u'康康'),
        ('CNK', u'科纳克里'),
        ('LAB', u'拉贝'),
        ('MAM', u'玛木')
    ),

    'CAN': (
        ('ABB', u'阿伯茨福'),
        ('EDM', u'埃德蒙顿'),
        ('OSH', u'奥沙瓦'),
        ('BAR', u'巴里'),
        ('CBR', u'布列塔尼角'),
        ('TOR', u'多伦多'),
        ('FRE', u'弗雷德里顿'),
        ('GLP', u'圭尔夫'),
        ('HAL', u'哈利法克斯'),
        ('HAM', u'哈密尔顿'),
        ('YXY', u'怀特霍斯'),
        ('KWL', u'基劳纳'),
        ('BRP', u'基奇纳'),
        ('KGN', u'金斯敦'),
        ('CAL', u'卡里加里'),
        ('QUE', u'魁北克'),
        ('REG', u'里贾纳'),
        ('LOD', u'伦敦'),
        ('MTR', u'蒙特利尔'),
        ('SUD', u'萨德伯里'),
        ('SAK', u'萨斯卡通'),
        ('TRR', u'三河城'),
        ('THU', u'桑德贝'),
        ('SBE', u'舍布鲁克'),
        ('SCA', u'圣卡塔琳娜'),
        ('SJB', u'圣约翰斯'),
        ('VIC', u'维多利亚'),
        ('VAN', u'温哥华'),
        ('WNP', u'温尼伯'),
        ('WDR', u'温莎'),
        ('OTT', u'渥太华'),
        ('CHA', u'夏洛特敦'),
        ('YZF', u'耶洛奈夫'),
        ('IQL', u'伊魁特')
    ),

    'GHA': (
        ('AS', u'阿散蒂'),
        ('OBU', u'奥布阿西'),
        ('NO', u'北部'),
        ('BA', u'布朗阿哈福'),
        ('GA', u'大阿克拉'),
        ('EA', u'东部'),
        ('UE', u'上东部'),
        ('UW', u'上西部'),
        ('VO', u'沃尔特'),
        ('WE', u'西部'),
        ('CE', u'中部')
    ),

    'GAB': (
        ('OL', u'奥果韦-洛洛'),
        ('OI', u'奥果韦-伊温多'),
        ('OM', u'滨海奥果韦'),
        ('NG', u'恩古涅'),
        ('ES', u'河口'),
        ('NY', u'尼扬加'),
        ('HO', u'上奥果韦'),
        ('WN', u'沃勒-恩特姆'),
        ('MO', u'中奥果韦')
    ),

    'KHM': (
        ('OC', u'奥多棉吉'),
        ('KB', u'白马市'),
        ('PR', u'柏威夏'),
        ('PL', u'拜林市'),
        ('BM', u'班迭棉吉'),
        ('KZC', u'磅清扬'),
        ('KO', u'磅士卑'),
        ('KZK', u'磅同'),
        ('KM', u'磅湛'),
        ('PG', u'波罗勉'),
        ('TK', u'茶胶'),
        ('SVR', u'柴桢'),
        ('KL', u'干丹'),
        ('KKZ', u'戈公'),
        ('KMT', u'贡布'),
        ('PNH', u'金边市'),
        ('KH', u'桔井'),
        ('RBE', u'腊塔纳基里'),
        ('BA', u'马德望'),
        ('MWV', u'蒙多基里'),
        ('PO', u'菩萨'),
        ('TNX', u'上丁'),
        ('KA', u'西哈努克市'),
        ('REP', u'暹粒')
    ),

    'CZE': (
        ('OL', u'奥洛穆茨'),
        ('PL', u'比尔森'),
        ('PR', u'布拉格直辖市'),
        ('KR', u'赫拉德茨-克拉洛韦'),
        ('KA', u'卡罗维发利'),
        ('LI', u'利贝雷克'),
        ('MO', u'摩拉维亚-西里西亚'),
        ('JC', u'南摩拉维亚'),
        ('PA', u'帕尔杜比采'),
        ('VY', u'维索基纳'),
        ('US', u'乌斯季'),
        ('ST', u'中捷克'),
        ('ZL', u'兹林')
    ),

    'ZWE': (
        ('MN', u'北马塔贝莱兰'),
        ('BU', u'布拉瓦约'),
        ('ME', u'东马绍纳兰'),
        ('HA', u'哈拉雷'),
        ('ML', u'马尼卡兰'),
        ('MV', u'马斯温戈'),
        ('MS', u'南马塔贝莱兰'),
        ('MW', u'西马绍纳兰'),
        ('MD', u'中部'),
        ('MC', u'中马绍纳兰')
    ),

    'CMR': (
        ('ADA', u'阿达马瓦'),
        ('NOR', u'北部'),
        ('EXN', u'北端'),
        ('LIT', u'滨海'),
        ('EST', u'东部'),
        ('SUD', u'南部'),
        ('NOT', u'西北'),
        ('OUE', u'西部'),
        ('SOU', u'西南'),
        ('CEN', u'中央')
    ),

    'QAT': (
        ('MS', u'北部'),
        ('DW', u'多哈'),
        ('GW', u'古韦里耶'),
        ('KR', u'豪尔'),
        ('JB', u'杰里扬拜特奈'),
        ('RN', u'赖扬'),
        ('WK', u'沃克拉'),
        ('UL', u'乌姆锡拉勒'),
        ('JM', u'朱迈利耶')
    ),

    'CIV': (
        ('AG', u'阿涅比'),
        ('BF', u'巴芬'),
        ('VB', u'邦达马河谷'),
        ('DE', u'登盖莱'),
        ('NC', u'恩济－科莫埃'),
        ('FR', u'弗罗马格尔'),
        ('LC', u'湖泊'),
        ('MR', u'马拉韦'),
        ('SB', u'南邦达马'),
        ('SC', u'南科莫埃'),
        ('HT', u'萨桑德拉'),
        ('SV', u'萨瓦纳'),
        ('DH', u'山地'),
        ('WR', u'沃罗杜古'),
        ('BS', u'下萨桑德拉'),
        ('LG', u'泻湖'),
        ('ZA', u'赞赞'),
        ('MV', u'中卡瓦利'),
        ('MC', u'中科莫埃')
    ),

    'HRV': (
        ('14', u'奥西耶克-巴拉尼亚'),
        ('7', u'别洛瓦尔-比洛戈拉'),
        ('8', u'滨海和山区'),
        ('11', u'波热加-斯拉沃尼亚'),
        ('12', u'布罗德-波萨维纳'),
        ('19', u'杜布罗夫斯克-内雷特瓦'),
        ('4', u'卡尔洛瓦茨'),
        ('6', u'科普里夫尼察-克里热夫齐'),
        ('2', u'克拉皮纳-扎戈列'),
        ('9', u'利卡-塞尼'),
        ('20', u'梅吉穆列'),
        ('1', u'萨格勒布'),
        ('21', u'萨格勒布市'),
        ('17', u'斯普利特-达尔马提亚'),
        ('5', u'瓦拉日丁'),
        ('10', u'维罗维蒂察-波德拉维纳'),
        ('16', u'武科瓦尔-斯里耶姆'),
        ('15', u'希贝尼克-克宁'),
        ('3', u'锡萨克-莫斯拉维纳'),
        ('18', u'伊斯特拉'),
        ('13', u'扎达尔')
    ),

    'KEN': (
        ('EMA', u'埃尔格约-马拉奎特'),
        ('BAR', u'巴林戈'),
        ('BUN', u'邦戈马'),
        ('BOM', u'博美特'),
        ('BUS', u'布希亚'),
        ('EMB', u'恩布'),
        ('HOB', u'霍马湾'),
        ('KIA', u'基安布'),
        ('KIL', u'基里菲'),
        ('KIR', u'基里尼亚加'),
        ('KIS', u'基苏木'),
        ('KIT', u'基图伊'),
        ('KII', u'基西'),
        ('GAS', u'加里萨'),
        ('KAK', u'卡卡梅加'),
        ('KAJ', u'卡耶亚多'),
        ('KEY', u'凯里乔'),
        ('KWA', u'夸勒'),
        ('LAU', u'拉木'),
        ('LAI', u'莱基皮亚'),
        ('MAC', u'马查科斯'),
        ('MAK', u'马瓜尼'),
        ('RBT', u'马萨布布'),
        ('MAN', u'曼德拉'),
        ('MER', u'梅鲁'),
        ('MOM', u'蒙巴萨'),
        ('MIG', u'米戈利'),
        ('MUR', u'穆兰卡'),
        ('NUU', u'纳库鲁'),
        ('NAR', u'纳罗克'),
        ('NAN', u'南迪'),
        ('NA', u'内罗毕'),
        ('NIT', u'尼蒂'),
        ('NYM', u'尼亚米拉'),
        ('NYN', u'年达鲁阿'),
        ('NYE', u'涅里'),
        ('UAS', u'桑布卢'),
        ('TRI', u'塔纳河'),
        ('TTA', u'泰塔塔维塔'),
        ('TNZ', u'特兰斯-恩佐亚'),
        ('TUR', u'图尔卡纳'),
        ('WJR', u'瓦吉尔'),
        ('UGI', u'瓦辛基苏'),
        ('VIH', u'韦希加'),
        ('WPO', u'西波克特'),
        ('SIA', u'夏亚'),
        ('ISI', u'伊希约洛'),
        ('CE', u'中央')
    ),

    'LVA': (
        ('ALU', u'阿卢克斯内'),
        ('AIZ', u'爱兹克劳克雷'),
        ('OGR', u'奥格雷'),
        ('BAL', u'巴尔维'),
        ('BAU', u'包斯卡'),
        ('CES', u'采西斯'),
        ('DOB', u'多贝莱'),
        ('GUL', u'古尔贝内'),
        ('JEK', u'杰卡布皮尔斯'),
        ('KRA', u'克拉斯拉瓦'),
        ('KUL', u'库尔迪加'),
        ('RZR', u'雷泽克内'),
        ('RGA', u'里加'),
        ('LPK', u'利耶帕亚'),
        ('LIM', u'林巴济'),
        ('LUD', u'卢扎'),
        ('MAD', u'马多纳'),
        ('PRE', u'普雷利'),
        ('SAL', u'萨尔杜斯'),
        ('TAL', u'塔尔西'),
        ('DGR', u'陶格夫皮尔斯'),
        ('TUK', u'图库马'),
        ('VLK', u'瓦尔加'),
        ('VLM', u'瓦尔米耶拉'),
        ('VSL', u'文茨皮尔斯'),
        ('JGR', u'叶尔加瓦')
    ),

    'LSO': (
        ('D', u'伯里亚'),
        ('B', u'布塔布泰'),
        ('G', u'古廷'),
        ('H', u'加查斯内克'),
        ('C', u'莱里贝'),
        ('E', u'马费滕'),
        ('A', u'马塞卢'),
        ('F', u'莫哈莱斯胡克'),
        ('J', u'莫霍特隆'),
        ('K', u'塔巴采卡')
    ),

    'LAO': (
        ('AT', u'阿速坡'),
        ('BL', u'波里坎赛'),
        ('BK', u'博乔'),
        ('XI', u'川圹'),
        ('PH', u'丰沙里'),
        ('KH', u'甘蒙'),
        ('HO', u'华潘'),
        ('LP', u'琅勃拉邦'),
        ('LM', u'琅南塔'),
        ('XN', u'赛宋本行政特区'),
        ('XE', u'色贡'),
        ('SL', u'沙拉湾'),
        ('SV', u'沙湾拿吉'),
        ('XA', u'沙耶武里'),
        ('VI', u'万象'),
        ('OU', u'乌多姆赛'),
        ('CH', u'占巴塞')
    ),

    'LBN': (
        ('AS', u'北部'),
        ('BI', u'贝卡'),
        ('BA', u'贝鲁特'),
        ('JL', u'黎巴嫩山'),
        ('NA', u'奈拜提耶市'),
        ('JA', u'南部')
    ),

    'LBR': (
        ('GBA', u'巴波卢'),
        ('BG', u'邦'),
        ('BOP', u'博波卢'),
        ('BM', u'博米'),
        ('GB', u'大巴萨'),
        ('GG', u'大吉德'),
        ('CM', u'大角山'),
        ('GK', u'大克鲁'),
        ('FT', u'菲什敦'),
        ('RG', u'吉河'),
        ('RI', u'里弗塞斯'),
        ('LO', u'洛法'),
        ('MG', u'马吉比'),
        ('MY', u'马里兰'),
        ('MO', u'蒙特塞拉多'),
        ('NI', u'宁巴'),
        ('SI', u'锡诺')
    ),

    'LTU': (
        ('AL', u'阿利图斯'),
        ('KA', u'考纳斯'),
        ('KL', u'克莱佩达'),
        ('MA', u'马里扬泊列'),
        ('PA', u'帕涅韦日斯'),
        ('TA', u'陶拉格'),
        ('TE', u'特尔希艾'),
        ('VI', u'维尔纽斯'),
        ('UT', u'乌田纳'),
        ('SI', u'希奥利艾'),
        ('AKM', u'亚克曼')
    ),

    'LUX': (
        ('DD', u'迪基希'),
        ('GG', u'格雷文马赫'),
        ('LL', u'卢森堡')
    ),

    'RWA': (
        ('BY', u'比温巴'),
        ('BU', u'布塔雷'),
        ('NY', u'恩延扎'),
        ('KG', u'基本古'),
        ('KY', u'基布耶'),
        ('KR', u'基加利-恩加利'),
        ('KV', u'基加利市'),
        ('GK', u'吉孔戈罗'),
        ('GS', u'吉塞尼'),
        ('GT', u'吉塔拉马'),
        ('KA', u'卡布加'),
        ('RW', u'卢瓦马加纳'),
        ('RH', u'鲁汉戈'),
        ('RU', u'鲁亨盖里'),
        ('CY', u'尚古古'),
        ('UM', u'乌姆塔拉')
    ),

    'ROU': (
        ('AL', u'阿尔巴尤利亚'),
        ('AR', u'阿拉德'),
        ('OR', u'奥拉迪亚'),
        ('BA', u'巴克乌'),
        ('BM', u'巴亚马雷'),
        ('BN', u'比斯特里察'),
        ('BO', u'博托沙尼'),
        ('BC', u'布加勒斯特'),
        ('BS', u'布拉索夫'),
        ('BL', u'布勒伊拉'),
        ('BZ', u'布泽乌'),
        ('DT', u'德罗贝塔-塞维林堡'),
        ('DE', u'德瓦'),
        ('TI', u'蒂米什瓦拉'),
        ('FO', u'福克沙尼'),
        ('GL', u'加拉茨'),
        ('GG', u'久尔久'),
        ('CT', u'康斯坦察'),
        ('DO', u'克拉约瓦'),
        ('CR', u'克勒拉希'),
        ('CN', u'克卢日纳波卡'),
        ('VI', u'勒姆尼库沃尔恰'),
        ('RE', u'雷希察'),
        ('MC', u'梅尔库里亚丘克'),
        ('PI', u'皮特什蒂'),
        ('PN', u'皮亚特拉尼亚姆茨'),
        ('PL', u'普洛耶什蒂'),
        ('SM', u'萨图·马雷'),
        ('SG', u'圣格奥尔基'),
        ('ST', u'斯拉蒂纳'),
        ('SB', u'斯洛博齐亚'),
        ('SU', u'苏恰瓦'),
        ('TA', u'特尔戈维什泰'),
        ('TM', u'特尔古穆列什'),
        ('TJ', u'特尔古日乌'),
        ('TU', u'图尔恰'),
        ('VA', u'瓦斯卢伊'),
        ('SO', u'锡比乌'),
        ('IS', u'雅西'),
        ('AD', u'亚厉山德里亚'),
        ('ZA', u'扎勒乌')
    ),

    'MDG': (
        ('AS', u'安齐拉纳纳'),
        ('FN', u'菲亚纳兰楚阿'),
        ('MJ', u'马哈赞加'),
        ('AN', u'塔那那利佛'),
        ('TM', u'图阿马西拉'),
        ('TL', u'图利亚拉')
    ),

    'MDV': (
        ('ADD', u'阿杜'),
        ('AAD', u'北阿里'),
        ('THD', u'北蒂拉杜马蒂'),
        ('MAD', u'北马洛斯马杜卢'),
        ('MLD', u'北米拉杜马杜卢'),
        ('NAD', u'北尼兰杜'),
        ('HAD', u'北苏瓦迪瓦'),
        ('FAA', u'法迪福卢'),
        ('FEA', u'费利杜'),
        ('FMU', u'福阿穆拉库'),
        ('HDH', u'哈杜马蒂'),
        ('KLH', u'科卢马杜卢'),
        ('MAL', u'马累'),
        ('MAA', u'马累岛'),
        ('MUA', u'穆拉库'),
        ('AAU', u'南阿里'),
        ('THU', u'南蒂拉杜马蒂'),
        ('MAU', u'南马洛斯马杜卢'),
        ('MLU', u'南米拉杜马杜卢'),
        ('NAU', u'南尼兰杜'),
        ('HAU', u'南苏瓦迪瓦')
    ),

    'MWI': (
        ('N', u'北部区'),
        ('S', u'南部区'),
        ('C', u'中央区')
    ),

    'MYS:PH': (
        ('BWH', u'北海'),
        ('PEN', u'槟城'),
        ('BMJ', u'大山脚'),
        ('NTE', u'高渊')
    ),

    'MYS:PS': (
        ('KGR', u'加央')
    ),

    'MYS:TR': (
        ('KEM', u'甘马挽'),
        ('TGG', u'瓜拉丁加奴'),
        ('DGN', u'龙运'),
        ('MAR', u'马江'),
        ('SET', u'实兆'),
        ('HUL', u'乌鲁'),
        ('BES', u'勿述')
    ),

    'MYS:KD': (
        ('PGT', u'巴东得腊'),
        ('PEN', u'笨筒'),
        ('LGK', u'浮罗交怡'),
        ('KOR', u'哥打士打'),
        ('KPA', u'古邦巴素'),
        ('KMU', u'瓜拉姆达'),
        ('BLZ', u'华玲'),
        ('KLM', u'居林'),
        ('BMA', u'万拉峇鲁')
    ),

    'MYS:KN': (
        ('PPU', u'巴西富地'),
        ('PMA', u'巴西马'),
        ('TMR', u'丹那美拉'),
        ('TUM', u'道北'),
        ('BAC', u'登卓'),
        ('KBR', u'哥打巴鲁'),
        ('KUG', u'瓜拉吉赖'),
        ('GMU', u'话望生'),
        ('MAC', u'马樟'),
        ('JEL', u'日里')
    ),

    'MYS:KL': (
        ('KUL', u'吉隆坡')
    ),

    'MYS:ML': (
        ('MEL', u'马六甲市'),
        ('AOG', u'亚罗牙也'),
        ('JAS', u'野新')
    ),

    'MYS:LB': (
        ('LBU', u'纳闽'),
        ('VIC', u'维多利亚')
    ),

    'MYS:PG': (
        ('BER', u'百乐'),
        ('PEK', u'北根'),
        ('TEM', u'淡马鲁'),
        ('JER', u'而连突'),
        ('KUA', u'关丹'),
        ('CAH', u'金马仑高原'),
        ('RAU', u'劳勿'),
        ('KUL', u'立卑'),
        ('MAR', u'马兰'),
        ('BEN', u'文冬'),
        ('TOM', u'云冰')
    ),

    'MYS:PK': (
        ('TAS', u'安顺'),
        ('TAM', u'丹绒马'),
        ('SSP', u'和丰'),
        ('LUM', u'紅土坎'),
        ('BGA', u'华都牙也'),
        ('KAR', u'江沙'),
        ('TPG', u'太平'),
        ('IPH', u'怡保')
    ),

    'MYS:JH': (
        ('POW', u'笨珍'),
        ('MEP', u'丰盛港'),
        ('KTI', u'哥打丁宜'),
        ('KLA', u'居銮'),
        ('BAT', u'峇株巴辖'),
        ('MUA', u'麻坡'),
        ('SGM', u'昔加末'),
        ('JHB', u'新山')
    ),

    'MYS:NS': (
        ('PDI', u'波德申'),
        ('TAI', u'淡边'),
        ('SRB', u'芙蓉'),
        ('KPI', u'瓜拉庇劳'),
        ('REM', u'林茂'),
        ('JEP', u'仁保'),
        ('JEL', u'日叻务')
    ),

    'MYS:SB': (
        ('PAP', u'吧巴'),
        ('BEF', u'保佛'),
        ('BEL', u'比鲁兰'),
        ('PIT', u'必达士'),
        ('PMP', u'兵南邦'),
        ('TAB', u'担布南'),
        ('TEN', u'丹南'),
        ('TAW', u'斗湖'),
        ('TUR', u'斗亚兰'),
        ('BKI', u'哥打基纳巴鲁'),
        ('KMU', u'哥打马鲁都'),
        ('KEG', u'根地咬'),
        ('KUD', u'古达'),
        ('KBD', u'古打毛律'),
        ('KUN', u'古纳'),
        ('KPU', u'瓜拉班尤'),
        ('KBT', u'京那巴登岸'),
        ('RNU', u'兰脑'),
        ('LDU', u'拿笃'),
        ('NAB', u'纳巴湾'),
        ('SDK', u'山打根'),
        ('SPT', u'西比陶'),
        ('SMM', u'仙本那')
    ),

    'MYS:SR': (
        ('KCH', u'古晋'),
        ('KPI', u'加帛'),
        ('LMN', u'林梦'),
        ('MYY', u'美里'),
        ('BTU', u'民都鲁'),
        ('MKM', u'木胶'),
        ('BTG', u'木中'),
        ('SMH', u'三马拉汉'),
        ('SAM', u'斯里阿曼'),
        ('SAR', u'泗里街'),
        ('SBW', u'泗务')
    ),

    'MYS:SL': (
        ('PJA', u'八打灵'),
        ('GOM', u'鹅麦'),
        ('KLG', u'瓜拉冷岳'),
        ('KSL', u'瓜拉雪兰莪'),
        ('SBM', u'沙白安南'),
        ('HUL', u'乌鲁冷岳'),
        ('HUS', u'乌鲁雪兰莪'),
        ('SEP', u'雪邦')
    ),

    'MLI': (
        ('CD', u'巴马科首都区'),
        ('KD', u'基达尔'),
        ('GA', u'加奥'),
        ('KY', u'卡伊'),
        ('KL', u'库利科罗'),
        ('MP', u'莫普提'),
        ('SG', u'塞古'),
        ('TB', u'通布图'),
        ('SK', u'锡卡索')
    ),

    'MRT': (
        ('AD', u'阿德拉尔'),
        ('AS', u'阿萨巴'),
        ('BR', u'卜拉克纳'),
        ('HG', u'东胡德'),
        ('GO', u'戈尔戈勒'),
        ('GM', u'吉迪马卡'),
        ('DN', u'努瓦迪布湾'),
        ('NO', u'努瓦克肖特特区'),
        ('TA', u'塔甘特'),
        ('TR', u'特拉扎'),
        ('TZ', u'提里斯-宰穆尔'),
        ('HC', u'西胡德'),
        ('IN', u'因希里')
    ),

    'USA:AR': (
        ('FYV', u'费耶特维尔'),
        ('FSM', u'史密斯堡'),
        ('LIT', u'小石城')
    ),

    'USA:AL': (
        ('BHM', u'伯明罕'),
        ('MGM', u'蒙哥马利'),
        ('MOB', u'莫比尔')
    ),

    'USA:AK': (
        ('ANC', u'安克雷奇'),
        ('FAI', u'费尔班克斯'),
        ('JNU', u'朱诺')
    ),

    'USA:ID': (
        ('IDA', u'爱达荷福尔斯'),
        ('PIH', u'波卡特洛'),
        ('BOI', u'博伊西'),
        ('BLK', u'布莱克富特'),
        ('COE', u'科达伦'),
        ('LWS', u'刘易斯顿'),
        ('MJL', u'莫斯科'),
        ('ZMU', u'墨菲'),
        ('NPA', u'楠帕'),
        ('QKM', u'岂彻姆'),
        ('SVY', u'森瓦利'),
        ('YAF', u'亚美利加瀑布城')
    ),

    'USA:IA': (
        ('DVN', u'达文波特'),
        ('DSM', u'得梅因'),
        ('CID', u'锡达拉皮兹')
    ),

    'USA:ND': (
        ('BIS', u'俾斯麦'),
        ('GFK', u'大福克斯'),
        ('FAR', u'法戈'),
        ('MOT', u'迈诺特')
    ),

    'USA:NC': (
        ('AEV', u'艾许维尔'),
        ('DHH', u'杜罕'),
        ('GBO', u'格林斯伯勒'),
        ('CHE', u'教堂山'),
        ('RAG', u'罗利'),
        ('RDU', u'洛利杜罕都会区'),
        ('CRQ', u'夏洛特')
    ),

    'USA:PA': (
        ('AEW', u'阿伦敦'),
        ('PHL', u'费城'),
        ('PIT', u'匹兹堡')
    ),

    'USA:TX': (
        ('ELP', u'埃尔帕索'),
        ('AUS', u'奥斯汀'),
        ('DAL', u'达拉斯'),
        ('CRP', u'哥帕斯基斯蒂'),
        ('GLS', u'交维斯顿'),
        ('LRD', u'拉雷多'),
        ('TXC', u'麦亚伦'),
        ('SAT', u'圣安东尼奥'),
        ('HOU', u'休斯敦')
    ),

    'USA:OH': (
        ('DYT', u'代顿'),
        ('CZX', u'哥伦布'),
        ('CLE', u'克利夫兰'),
        ('TOL', u'托莱多'),
        ('CVG', u'辛辛那提')
    ),

    'USA:OK': (
        ('OKC', u'俄克拉荷马城'),
        ('OUN', u'诺曼'),
        ('TUL', u'塔尔萨')
    ),

    'USA:OR': (
        ('BZO', u'本德'),
        ('PDX', u'波特兰'),
        ('DLS', u'达尔斯'),
        ('DAC', u'达拉斯'),
        ('TLM', u'蒂拉穆克'),
        ('XFX', u'格兰茨帕斯'),
        ('HDX', u'胡德里弗'),
        ('CTR', u'火山口湖'),
        ('YCV', u'科瓦利斯'),
        ('COB', u'库斯贝'),
        ('MFR', u'梅德福'),
        ('SLE', u'塞勒姆'),
        ('STH', u'圣海伦斯'),
        ('SPY', u'斯普林菲尔德'),
        ('EUG', u'尤金')
    ),

    'USA:FL': (
        ('ORL', u'奥兰多'),
        ('EYW', u'基韦斯特'),
        ('JAX', u'杰克逊维尔'),
        ('CPV', u'卡纳维尔角'),
        ('FLL', u'罗德岱堡'),
        ('MIA', u'迈阿密'),
        ('PIE', u'圣彼德斯堡市'),
        ('TLH', u'塔拉哈西'),
        ('TPA', u'坦帕')
    ),

    'USA:VT': (
        ('BTV', u'伯灵顿'),
        ('RUT', u'拉特兰'),
        ('ZBR', u'南伯灵顿')
    ),

    'USA:DC': (
        ('WAS', u'华盛顿哥伦比亚特区')
    ),

    'USA:WA': (
        ('GEG', u'斯波坎'),
        ('TTW', u'塔科马'),
        ('SEA', u'西雅图')
    ),

    'USA:WY': (
        ('EVD', u'埃文斯顿'),
        ('CPR', u'卡斯珀'),
        ('LAR', u'拉勒米'),
        ('RKS', u'罗克斯普林斯'),
        ('CYS', u'夏延'),
        ('SHR', u'谢里登')
    ),

    'USA:CA': (
        ('SFO', u'旧金山'),
        ('LAX', u'洛杉矶'),
        ('SAN', u'圣迭戈'),
        ('SJC', u'圣何塞')
    ),

    'USA:KS': (
        ('ABZ', u'阿比林'),
        ('OVL', u'奥弗兰公园'),
        ('HCH', u'哈钦森'),
        ('KCK', u'堪萨斯城'),
        ('XIA', u'莱文沃思'),
        ('LWC', u'劳伦斯'),
        ('MHK', u'曼哈顿'),
        ('TOP', u'托皮卡'),
        ('ICT', u'威奇托')
    ),

    'USA:CT': (
        ('BDR', u'布里奇波特'),
        ('DAQ', u'达里恩'),
        ('GRH', u'格林尼治'),
        ('HFD', u'哈特福德'),
        ('XIN', u'米德尔顿'),
        ('HVN', u'纽黑文'),
        ('WPT', u'韦斯特波特'),
        ('WAT', u'沃特伯里'),
        ('NWT', u'新不列颠')
    ),

    'USA:CO': (
        ('ASE', u'阿斯彭'),
        ('AUX', u'奥罗拉'),
        ('WBU', u'博尔德'),
        ('GJT', u'大章克申'),
        ('DEN', u'丹佛'),
        ('FNL', u'柯林斯堡'),
        ('COS', u'科罗拉多斯普林斯'),
        ('VAC', u'韦尔')
    ),

    'USA:KY': (
        ('LEX', u'列克星敦'),
        ('LUI', u'路易斯维尔'),
        ('OWB', u'欧文斯伯勒')
    ),

    'USA:LA': (
        ('BTR', u'巴吞鲁日'),
        ('SHV', u'什里夫波特'),
        ('MSY', u'新奥尔良')
    ),

    'USA:RI': (
        ('PAW', u'波塔基特'),
        ('CQH', u'克兰斯顿'),
        ('NPO', u'纽波特'),
        ('PVD', u'普罗维登斯'),
        ('WST', u'韦斯特利'),
        ('SFN', u'文索基特'),
        ('UZO', u'沃威克')
    ),

    'USA:MD': (
        ('BAL', u'巴尔的摩'),
        ('GAI', u'盖瑟斯堡'),
        ('RKV', u'罗克维尔')
    ),

    'USA:MA': (
        ('BZD', u'波士顿'),
        ('SFY', u'斯普林菲尔德'),
        ('ORH', u'伍斯特')
    ),

    'USA:MT': (
        ('BGS', u'比灵斯'),
        ('GTF', u'大瀑布村'),
        ('MSO', u'米苏拉')
    ),

    'USA:MO': (
        ('COV', u'哥伦比亚'),
        ('JEF', u'杰佛逊市'),
        ('MKC', u'堪萨斯城'),
        ('STL', u'圣路易斯'),
        ('SGF', u'斯普林菲尔德')
    ),

    'USA:MS': (
        ('BIX', u'比洛克西'),
        ('GPT', u'格尔夫波特'),
        ('GLH', u'格林维尔'),
        ('HBG', u'哈蒂斯堡'),
        ('JAN', u'杰克逊'),
        ('MEI', u'默里迪恩'),
        ('VKS', u'维克斯堡')
    ),

    'USA:MI': (
        ('ARB', u'安娜堡'),
        ('BTL', u'巴特尔克里克'),
        ('BCY', u'贝城'),
        ('GRR', u'大急流城'),
        ('DEO', u'迪尔伯恩'),
        ('DET', u'底特律'),
        ('FNT', u'弗林特'),
        ('WYD', u'怀恩多特'),
        ('AZO', u'卡拉马袓'),
        ('LAN', u'兰辛'),
        ('MKG', u'马斯基根'),
        ('PTK', u'庞菷亚克'),
        ('SGM', u'萨吉诺'),
        ('SSM', u'苏圣玛丽'),
        ('WAM', u'沃伦'),
        ('PHN', u'休伦港')
    ),

    'USA:ME': (
        ('BNQ', u'班戈'),
        ('POL', u'波特兰'),
        ('QLW', u'刘易斯顿')
    ),

    'USA:MN': (
        ('RST', u'罗切斯特'),
        ('MES', u'明尼阿波利斯'),
        ('STP', u'圣保罗')
    ),

    'USA:SD': (
        ('ABK', u'阿伯丁'),
        ('RAP', u'拉皮德城'),
        ('FSD', u'苏福尔斯')
    ),

    'USA:SC': (
        ('NTS', u'北查尔斯顿'),
        ('CHS', u'查尔斯顿'),
        ('COV', u'哥伦比亚')
    ),

    'USA:NE': (
        ('OMA', u'奥马哈'),
        ('XDE', u'贝尔维尤'),
        ('LNK', u'林肯')
    ),

    'USA:NV': (
        ('EKO', u'埃尔科'),
        ('NVS', u'北拉斯维加斯'),
        ('VGI', u'弗吉尼亚城'),
        ('HNZ', u'亨德森'),
        ('CSN', u'卡森城'),
        ('LAS', u'拉斯维加斯'),
        ('RNO', u'里诺'),
        ('SPK', u'斯帕克斯')
    ),

    'USA:NY': (
        ('FFO', u'布法罗'),
        ('ROC', u'罗切斯特'),
        ('QEE', u'纽约市')
    ),

    'USA:DE': (
        ('DOR', u'多佛'),
        ('NWK', u'纽瓦克'),
        ('ILG', u'威明顿')
    ),

    'USA:TN': (
        ('BSJ', u'布利斯托'),
        ('CHA', u'查塔努加'),
        ('TRI', u'金斯波特'),
        ('MEM', u'孟菲斯'),
        ('BNA', u'纳什维尔'),
        ('TYS', u'诺克斯维尔'),
        ('YTC', u'三城区'),
        ('MQY', u'士麦那'),
        ('RGI', u'斯普林希尔'),
        ('JCY', u'约翰逊城')
    ),

    'USA:WI': (
        ('ATW', u'阿普尓顿'),
        ('OSH', u'奥什科什'),
        ('GBK', u'格林贝'),
        ('ENW', u'基诺沙'),
        ('LSE', u'拉克罗斯'),
        ('RAC', u'拉辛'),
        ('MTW', u'马尼托沃克'),
        ('QMD', u'迈迪逊'),
        ('MKE', u'密尔沃基'),
        ('EAU', u'欧克莱尓'),
        ('AUW', u'沃索'),
        ('SBM', u'希博伊根')
    ),

    'USA:VA': (
        ('VAB', u'弗吉尼亚比奇'),
        ('ORF', u'诺福克'),
        ('HTW', u'切萨皮克')
    ),

    'USA:WV': (
        ('CRW', u'查尔斯顿'),
        ('HNU', u'亨廷顿'),
        ('PKB', u'帕克斯堡')
    ),

    'USA:HI': (
        ('KHH', u'凯卢阿'),
        ('HNL', u'檀香山'),
        ('ITO', u'希洛')
    ),

    'USA:NH': (
        ('CON', u'康科德'),
        ('MHT', u'曼彻斯特'),
        ('ASH', u'纳舒厄')
    ),

    'USA:NM': (
        ('ABQ', u'阿尔伯克基'),
        ('LRU', u'拉斯克鲁塞斯'),
        ('ROW', u'罗斯韦尔'),
        ('SAF', u'圣菲')
    ),

    'USA:NJ': (
        ('NRK', u'纽瓦克'),
        ('PAT', u'帕特森'),
        ('JEC', u'泽西城')
    ),

    'USA:AZ': (
        ('PHX', u'凤凰城'),
        ('GDA', u'格兰代尔'),
        ('MQA', u'梅萨'),
        ('STZ', u'史卡兹代尔'),
        ('TPE', u'坦普'),
        ('TUC', u'图森'),
        ('YUM', u'优玛')
    ),

    'USA:IL': (
        ('ALN', u'奥尔顿'),
        ('AUZ', u'奥罗拉'),
        ('BLO', u'布卢明顿'),
        ('DVI', u'丹维尓'),
        ('DEK', u'迪卡尔布'),
        ('DEC', u'迪凯持'),
        ('ESL', u'东圣路易斯'),
        ('CMI', u'厄巴纳-香槟'),
        ('GSU', u'盖尔斯堡'),
        ('MDH', u'卡本代尔'),
        ('RKI', u'罗克艾兰'),
        ('RFD', u'罗克福德'),
        ('NOM', u'诺黙尔'),
        ('PLA', u'皮奥里亚'),
        ('CRA', u'森特勒利亚'),
        ('SPI', u'斯普林菲尔德'),
        ('UGN', u'沃其根'),
        ('CHI', u'芝加哥')
    ),

    'USA:IN': (
        ('EVV', u'埃文斯维尔'),
        ('FWA', u'韦恩堡'),
        ('IND', u'印第安纳波利斯')
    ),

    'USA:UT': (
        ('OGD', u'奥格登'),
        ('LTJ', u'雷登'),
        ('OEU', u'欧仁'),
        ('PAC', u'帕克城'),
        ('PVU', u'普罗沃'),
        ('SGU', u'圣乔治'),
        ('WVC', u'西瓦利城'),
        ('SLC', u'盐湖城')
    ),

    'USA:GA': (
        ('AUT', u'奥古斯塔'),
        ('CZX', u'哥伦布'),
        ('MCN', u'梅肯'),
        ('SAV', u'沙瓦纳'),
        ('TAT', u'亚特兰大')
    ),

    'ASM': (
        ('AAN', u'阿纳'),
        ('ATU', u'阿图阿'),
        ('AIT', u'艾加伊勒泰'),
        ('FAA', u'法塞莱莱阿加'),
        ('GFG', u'加盖福毛加'),
        ('GMG', u'加加埃毛加'),
        ('PAL', u'帕劳利'),
        ('SAT', u'萨图帕伊泰阿'),
        ('SAV', u'萨瓦伊岛'),
        ('TUA', u'图阿马萨加'),
        ('VAF', u'瓦奥福诺蒂'),
        ('VAI', u'韦西加诺'),
        ('UPO', u'乌波卢岛')
    ),

    'MNG': (
        ('69', u'巴彦洪格尔'),
        ('71', u'巴彦乌勒盖'),
        ('67', u'布尔干'),
        ('37', u'达尔汗乌勒'),
        ('61', u'东方'),
        ('63', u'东戈壁'),
        ('35', u'鄂尔浑'),
        ('65', u'戈壁阿尔泰'),
        ('64', u'戈壁苏木贝尔'),
        ('73', u'后杭爱'),
        ('43', u'科布多'),
        ('39', u'肯特'),
        ('41', u'库苏古尔'),
        ('UMN', u'南戈壁'),
        ('UVO', u'前杭爱'),
        ('49', u'色楞格'),
        ('51', u'苏赫巴托尔'),
        ('46', u'乌布苏'),
        ('1', u'乌兰巴托市'),
        ('57', u'扎布汗'),
        ('59', u'中戈壁'),
        ('47', u'中央')
    ),

    'BGD': (
        ('DAC', u'达卡'),
        ('CGP', u'吉大港'),
        ('KHL', u'库尔纳')
    ),

    'PER': (
        ('AR', u'阿雷基帕'),
        ('AP', u'阿普里马克'),
        ('AY', u'阿亚库乔'),
        ('AN', u'安卡什'),
        ('JUL', u'胡利亚卡'),
        ('JU', u'胡宁'),
        ('CJ', u'卡哈马卡'),
        ('CL', u'卡亚俄'),
        ('CU', u'库斯科'),
        ('LD', u'拉利伯塔德'),
        ('LY', u'兰巴耶克'),
        ('LI', u'利马'),
        ('LO', u'洛雷托'),
        ('MD', u'马德雷德迪奥斯'),
        ('MO', u'莫克瓜'),
        ('PA', u'帕斯科'),
        ('PI', u'皮乌拉'),
        ('PU', u'普诺'),
        ('CHM', u'钦博特'),
        ('CHI', u'钦查阿尔塔'),
        ('SM', u'圣马丁'),
        ('SUL', u'苏拉纳'),
        ('TA', u'塔克纳'),
        ('TU', u'通贝斯'),
        ('HO', u'瓦努科'),
        ('HV', u'万卡维利卡'),
        ('UC', u'乌卡亚利'),
        ('AM', u'亚马孙'),
        ('IC', u'伊卡')
    ),

    'MMR': (
        ('BG', u'勃固省'),
        ('SH', u'掸邦'),
        ('TN', u'德林达依省'),
        ('KN', u'克伦邦'),
        ('KC', u'克钦邦'),
        ('KH', u'克耶邦'),
        ('MG', u'马圭省'),
        ('MD', u'曼德勒省'),
        ('MN', u'孟邦'),
        ('CH', u'钦邦'),
        ('RK', u'若开邦'),
        ('SG', u'实皆省'),
        ('YG', u'仰光省'),
        ('AY', u'伊洛瓦底省')
    ),

    'MAR': (
        ('TGR', u'丹吉尔'),
        ('TET', u'得土安'),
        ('FES', u'非斯'),
        ('CBL', u'卡萨布兰卡'),
        ('RSA', u'拉巴特'),
        ('MRK', u'马拉喀什'),
        ('MKN', u'梅克内斯'),
        ('OUJ', u'乌季达'),
        ('WSH', u'西撒哈拉')
    ),

    'MEX': (
        ('AGU', u'阿瓜斯卡连斯特'),
        ('ACA', u'阿卡普尔科'),
        ('HMO', u'埃莫西约'),
        ('CAM', u'埃佩切'),
        ('OBR', u'奥夫雷贡城'),
        ('ORI', u'奥里萨巴'),
        ('VHM', u'巴利城'),
        ('PVR', u'巴亚尔塔港'),
        ('VSA', u'比利亚埃尔莫萨'),
        ('PRH', u'波萨里卡'),
        ('TIJ', u'蒂华纳'),
        ('DUR', u'杜兰戈'),
        ('ESE', u'恩塞纳达'),
        ('GDL', u'瓜达拉哈拉'),
        ('GUA', u'瓜纳华托'),
        ('JAL', u'哈拉帕'),
        ('JUZ', u'华雷斯'),
        ('BJU', u'华雷斯港'),
        ('CAR', u'卡门'),
        ('COL', u'科利马'),
        ('QUE', u'克雷塔罗'),
        ('CVC', u'库埃纳瓦卡'),
        ('CUL', u'库利阿坎'),
        ('COA', u'夸察夸拉克斯'),
        ('LAP', u'拉巴斯'),
        ('LEN', u'莱昂'),
        ('REX', u'雷诺萨'),
        ('LMM', u'洛斯莫奇斯'),
        ('MZT', u'马萨特兰'),
        ('MAM', u'马塔莫罗斯'),
        ('MID', u'梅里达'),
        ('LOV', u'蒙克洛瓦'),
        ('MTY', u'蒙特雷'),
        ('MLM', u'莫雷利亚'),
        ('MEX', u'墨西哥城'),
        ('MXL', u'墨西卡利'),
        ('NOG', u'诺加莱斯'),
        ('PAC', u'帕丘卡'),
        ('PUE', u'普埃布拉'),
        ('CHI', u'奇尔潘辛戈'),
        ('CHH', u'奇瓦瓦'),
        ('CTM', u'切图马尔'),
        ('SLW', u'萨尔蒂约'),
        ('ZAC', u'萨卡特卡斯'),
        ('CLY', u'塞拉亚'),
        ('SLP', u'圣路易斯波托亚'),
        ('TAP', u'塔帕丘拉'),
        ('TAM', u'坦皮科'),
        ('TLA', u'特拉斯卡拉'),
        ('TPQ', u'特皮克'),
        ('TCN', u'特瓦坎'),
        ('TGZ', u'图斯特拉-古铁雷斯'),
        ('TRC', u'托雷翁'),
        ('TLC', u'托卢卡'),
        ('OAX', u'瓦哈卡'),
        ('VIC', u'维多利亚城'),
        ('VER', u'韦拉克鲁斯'),
        ('UPN', u'乌鲁阿潘'),
        ('NLE', u'新拉雷多'),
        ('IRP', u'伊拉普阿托')
    ),

    'NAM': (
        ('ER', u'埃龙戈'),
        ('OW', u'奥汉圭纳'),
        ('KV', u'奥卡万戈'),
        ('OK', u'奥马赫科'),
        ('OT', u'奥姆沙蒂'),
        ('OJ', u'奥乔宗蒂约巴'),
        ('ON', u'奥沙纳'),
        ('OO', u'奥希科托'),
        ('HA', u'哈达普'),
        ('KH', u'霍马斯'),
        ('KR', u'卡拉斯'),
        ('CA', u'卡普里维'),
        ('KU', u'库内内')
    ),

    'ZAF': (
        ('UTN', u'阿平顿'),
        ('MAY', u'艾利弗山'),
        ('PZB', u'彼德马里茨堡'),
        ('PTG', u'彼德斯堡'),
        ('PRY', u'比勒陀利亚'),
        ('BIY', u'比索'),
        ('BDD', u'布雷达斯多普'),
        ('BFN', u'布隆方丹'),
        ('BHT', u'布隆克斯特斯普利特'),
        ('DAA', u'德阿尔'),
        ('DUR', u'德班'),
        ('DUN', u'邓迪'),
        ('BAE', u'东巴克利'),
        ('ELS', u'东伦敦'),
        ('VRU', u'弗雷堡'),
        ('VGG', u'弗里尼欣'),
        ('GBD', u'格罗布莱斯达尔'),
        ('GIY', u'基雅尼'),
        ('KIM', u'金伯利'),
        ('CPT', u'开普敦'),
        ('KXE', u'克莱克斯多普'),
        ('KMH', u'库鲁曼'),
        ('UTW', u'昆士敦'),
        ('LAY', u'莱迪史密斯'),
        ('RFT', u'兰德方丹'),
        ('RCB', u'理查兹湾'),
        ('RSB', u'利斯滕堡'),
        ('MDB', u'米德尔堡'),
        ('MZQ', u'姆库泽'),
        ('MOO', u'穆里斯堡'),
        ('NLP', u'内尔斯普雷特'),
        ('NYL', u'尼尔斯特隆'),
        ('NCS', u'纽卡斯尔'),
        ('GRJ', u'乔治'),
        ('SAS', u'萨索尔堡'),
        ('ZEC', u'瑟孔达'),
        ('IXO', u'特克索波'),
        ('TPB', u'特隆普斯堡'),
        ('SBU', u'跳羚'),
        ('TLH', u'图拉马哈谢'),
        ('THY', u'托霍延杜'),
        ('WSH', u'韦茨肖克'),
        ('WEL', u'韦尔科姆'),
        ('ULD', u'乌伦迪'),
        ('UTT', u'乌姆塔塔'),
        ('WOR', u'伍斯特'),
        ('BEW', u'西博福特'),
        ('PSS', u'谢普斯通港'),
        ('PLZ', u'伊丽莎白港'),
        ('JNB', u'约翰内斯堡')
    ),

    'NPL': (
        ('BA', u'巴格马蒂'),
        ('DH', u'道拉吉里'),
        ('GA', u'甘达基'),
        ('KO', u'戈西'),
        ('KA', u'格尔纳利'),
        ('JA', u'贾纳克布尔'),
        ('RA', u'拉布蒂'),
        ('LU', u'蓝毗尼'),
        ('MA', u'马哈卡利'),
        ('ME', u'梅吉'),
        ('NA', u'纳拉亚尼'),
        ('BH', u'佩里'),
        ('SA', u'萨加玛塔'),
        ('SE', u'塞蒂')
    ),

    'NIC': (
        ('ES', u'埃斯特利'),
        ('AN', u'北大西洋'),
        ('BO', u'博阿科'),
        ('GR', u'格拉纳达'),
        ('CA', u'卡拉索'),
        ('LE', u'莱昂'),
        ('RV', u'里瓦斯'),
        ('MD', u'马德里斯'),
        ('MN', u'马那瓜'),
        ('MS', u'马萨亚'),
        ('MT', u'马塔加尔帕'),
        ('AS', u'南大西洋'),
        ('CD', u'奇南德加'),
        ('CT', u'琼塔莱斯'),
        ('SJ', u'圣胡安河'),
        ('JI', u'希诺特加'),
        ('NS', u'新塞哥维亚')
    ),

    'NER': (
        ('AJY', u'阿加德兹'),
        ('DIF', u'迪法'),
        ('TIL', u'蒂拉贝里'),
        ('DSS', u'多索'),
        ('ZND', u'津德尔'),
        ('MFQ', u'马拉迪'),
        ('NIM', u'尼亚美市'),
        ('THZ', u'塔瓦')
    ),

    'NGA': (
        ('ABV', u'阿比亚'),
        ('OGB', u'奥博莫绍'),
        ('KAN', u'卡诺'),
        ('LOS', u'拉各斯'),
        ('IBA', u'伊巴丹')
    ),

    'NOR': (
        ('2', u'阿克什胡斯'),
        ('5', u'奥普兰'),
        ('3', u'奥斯陆市'),
        ('17', u'北特伦德拉格'),
        ('6', u'布斯克吕'),
        ('9', u'东阿格德尔'),
        ('1', u'东福尔'),
        ('20', u'芬马克'),
        ('4', u'海德马克'),
        ('12', u'霍达兰'),
        ('11', u'罗加兰'),
        ('15', u'默勒－鲁姆斯达尔'),
        ('16', u'南特伦德拉格'),
        ('18', u'诺尔兰'),
        ('14', u'松恩－菲尤拉讷'),
        ('8', u'泰勒马克'),
        ('19', u'特罗姆斯'),
        ('10', u'西阿格德尔'),
        ('7', u'西福尔')
    ),

    'PRT': (
        ('ALL', u'滨海阿连特茹'),
        ('PLT', u'滨海皮尼亚尔'),
        ('VDP', u'波尔图'),
        ('MDR', u'杜罗'),
        ('EDV', u'恩特拉杜罗伏日'),
        ('FAO', u'法鲁'),
        ('FUN', u'丰沙尔'),
        ('CAV', u'卡瓦多'),
        ('CLB', u'科瓦贝拉'),
        ('LIS', u'里斯本'),
        ('LTE', u'利巴特茹'),
        ('MTE', u'梅地奥特茹'),
        ('MLI', u'米尼奥-利马'),
        ('BIN', u'内贝拉北'),
        ('BIS', u'内贝拉南'),
        ('PIN', u'内皮尼亚尔北'),
        ('PIS', u'内皮尼亚尔南'),
        ('PDL', u'蓬塔德尔加达'),
        ('PSE', u'塞图巴尔半岛'),
        ('SES', u'山后'),
        ('AAT', u'上阿连特茹'),
        ('ATM', u'上特拉斯山'),
        ('TAM', u'塔梅加'),
        ('AES', u'万福'),
        ('OES', u'西部'),
        ('BAL', u'下阿连特茹'),
        ('BVO', u'下伏日'),
        ('BMO', u'下蒙德古'),
        ('ALC', u'中阿连特茹')
    ),

    'JPN': (
        ('38', u'爱媛'),
        ('23', u'爱知'),
        ('1', u'北海道'),
        ('28', u'兵库'),
        ('47', u'冲绳'),
        ('8', u'茨城'),
        ('27', u'大阪'),
        ('44', u'大分'),
        ('32', u'岛根'),
        ('36', u'徳岛'),
        ('13', u'东京'),
        ('7', u'福岛'),
        ('40', u'福冈'),
        ('18', u'福井'),
        ('16', u'富山'),
        ('33', u'冈山'),
        ('39', u'高知'),
        ('4', u'宮城'),
        ('45', u'宫崎'),
        ('34', u'广岛'),
        ('30', u'和歌山'),
        ('26', u'京都'),
        ('22', u'静冈'),
        ('9', u'枥木'),
        ('46', u'鹿儿岛'),
        ('29', u'奈良'),
        ('31', u'鸟取'),
        ('21', u'岐阜'),
        ('11', u'埼玉'),
        ('12', u'千叶'),
        ('2', u'青森'),
        ('5', u'秋田'),
        ('10', u'群马'),
        ('24', u'三重'),
        ('35', u'山口'),
        ('19', u'山梨'),
        ('6', u'山形'),
        ('14', u'神奈川'),
        ('17', u'石川'),
        ('37', u'香川'),
        ('15', u'新潟'),
        ('43', u'熊本'),
        ('3', u'岩手'),
        ('42', u'长崎'),
        ('20', u'长野'),
        ('25', u'滋贺'),
        ('41', u'佐贺')
    ),

    'SWE': (
        ('BD', u'北博滕'),
        ('K', u'布莱金厄'),
        ('DLN', u'达拉纳'),
        ('UGL', u'东约特兰'),
        ('T', u'厄勒布鲁'),
        ('I', u'哥得兰'),
        ('N', u'哈兰'),
        ('H', u'卡尔马'),
        ('G', u'克鲁努贝里'),
        ('D', u'南曼兰'),
        ('AB', u'斯德哥尔摩'),
        ('M', u'斯科耐'),
        ('S', u'韦姆兰'),
        ('C', u'乌普萨拉'),
        ('AC', u'西博滕'),
        ('U', u'西曼兰'),
        ('Y', u'西诺尔兰'),
        ('O', u'西约特兰'),
        ('F', u'延雪平'),
        ('X', u'耶夫勒堡'),
        ('Z', u'耶姆特兰')
    ),

    'CHE': (
        ('AG', u'阿尔高'),
        ('BS', u'巴塞尔城市'),
        ('BL', u'巴塞尔乡村'),
        ('BE', u'伯尔尼'),
        ('ZG', u'楚格'),
        ('FR', u'弗里堡'),
        ('GL', u'格拉鲁斯'),
        ('GR', u'格劳宾登'),
        ('LU', u'卢塞恩'),
        ('LA', u'洛桑'),
        ('NE', u'纳沙泰尔'),
        ('AI', u'内阿彭策尔'),
        ('GE', u'日内瓦'),
        ('JU', u'汝拉'),
        ('SH', u'沙夫豪森'),
        ('OW', u'上瓦尔登'),
        ('SG', u'圣加仑'),
        ('SZ', u'施维茨'),
        ('ZH', u'苏黎世'),
        ('SO', u'索洛图恩'),
        ('TI', u'提契诺'),
        ('TG', u'图尔高'),
        ('VS', u'瓦莱'),
        ('AR', u'外阿彭策尔'),
        ('VD', u'沃'),
        ('UR', u'乌里'),
        ('NW', u'下瓦尔登')
    ),

    'SLV': (
        ('APO', u'阿波帕'),
        ('AH', u'阿瓦查潘'),
        ('LI', u'滨海'),
        ('CH', u'查拉特南戈'),
        ('DE', u'德尔加多'),
        ('KN', u'基埃-恩特姆'),
        ('CA', u'卡瓦尼亚斯'),
        ('CU', u'库斯卡特兰'),
        ('PZ', u'拉巴斯'),
        ('LB', u'拉利伯塔德'),
        ('UN', u'拉乌尼翁'),
        ('MEJ', u'梅基卡诺斯'),
        ('MO', u'莫拉桑'),
        ('SA', u'圣安娜'),
        ('SM', u'圣米格尔'),
        ('SS', u'圣萨尔瓦多'),
        ('SV', u'圣维森特'),
        ('SO', u'松索纳特'),
        ('SOY', u'索亚潘戈'),
        ('WN', u'韦莱-恩萨斯'),
        ('US', u'乌苏卢坦'),
        ('IL', u'伊洛潘戈'),
        ('CS', u'中南')
    ),

    'SCG': (
        ('BEG', u'贝尔格莱德'),
        ('POD', u'波德戈里察'),
        ('KGV', u'克拉古涅瓦茨'),
        ('INI', u'尼什'),
        ('NVS', u'诺维萨德'),
        ('PRN', u'普里什蒂纳'),
        ('SUB', u'苏博蒂察'),
        ('ZEM', u'泽蒙')
    ),

    'SLE': (
        ('N', u'北部'),
        ('E', u'东部'),
        ('S', u'南部'),
        ('W', u'西部区')
    ),

    'SEN': (
        ('DA', u'达喀尔'),
        ('FA', u'法蒂克'),
        ('ZI', u'济金绍尔'),
        ('TH', u'捷斯'),
        ('DI', u'久尔贝勒'),
        ('KA', u'考拉克'),
        ('KO', u'科尔达'),
        ('LO', u'卢加'),
        ('MA', u'马塔姆'),
        ('SL', u'圣路易'),
        ('TA', u'坦巴昆达')
    ),

    'CYP': (
        ('4', u'法马古斯塔'),
        ('6', u'凯里尼亚'),
        ('3', u'拉纳卡'),
        ('2', u'利马索尔'),
        ('1', u'尼科西亚'),
        ('5', u'帕福斯')
    ),

    'SAU': (
        ('ARA', u'阿尔阿尔'),
        ('AHB', u'艾卜哈'),
        ('BH', u'巴哈'),
        ('BUR', u'布赖代'),
        ('DAM', u'达曼'),
        ('HBT', u'哈费尔巴廷'),
        ('HL', u'哈伊勒'),
        ('KMX', u'海米斯穆谢特'),
        ('AKH', u'海耶'),
        ('HFF', u'胡富夫'),
        ('JED', u'吉达'),
        ('JZ', u'吉赞'),
        ('RD', u'利雅得'),
        ('MED', u'麦地那'),
        ('ML', u'麦加'),
        ('MBR', u'姆巴拉兹'),
        ('NR', u'纳季兰'),
        ('SAK', u'塞卡卡'),
        ('TB', u'塔布克'),
        ('TAR', u'塔伊夫'),
        ('YNB', u'延布'),
        ('JBI', u'朱拜勒')
    ),

    'LKA': (
        ('ADP', u'阿努拉德普勒'),
        ('AMP', u'安帕赖'),
        ('BAD', u'巴杜勒'),
        ('BTC', u'拜蒂克洛'),
        ('POL', u'波隆纳鲁沃'),
        ('HBA', u'汉班托特'),
        ('KIL', u'基里诺奇'),
        ('GAL', u'加勒'),
        ('GAM', u'加姆珀哈'),
        ('JAF', u'贾夫纳'),
        ('KLT', u'卡卢特勒'),
        ('KEG', u'凯格勒'),
        ('KAN', u'康提'),
        ('CMB', u'科伦坡'),
        ('KUR', u'库鲁内格勒'),
        ('RAT', u'拉特纳普勒'),
        ('MAN', u'马纳尔'),
        ('MAT', u'马特莱'),
        ('MAA', u'马特勒'),
        ('MON', u'莫讷勒格勒'),
        ('MUL', u'穆莱蒂武'),
        ('NUE', u'努沃勒埃利耶'),
        ('PUT', u'普塔勒姆'),
        ('TRR', u'亭可马里'),
        ('VAV', u'瓦武尼亚')
    ),

    'SVK': (
        ('BBY', u'班斯卡-比斯特里察'),
        ('BTS', u'布拉迪斯拉发'),
        ('KOR', u'科希策'),
        ('NRA', u'尼特拉'),
        ('POV', u'普雷绍夫'),
        ('RIL', u'日利纳'),
        ('TNA', u'特尔纳瓦'),
        ('TRE', u'特伦钦')
    ),

    'SVN': (
        ('OKR', u'奥巴尔诺-克拉'),
        ('OSR', u'奥斯雷德涅斯洛文'),
        ('POD', u'波德拉夫'),
        ('POM', u'波穆尔'),
        ('DLJ', u'多雷尼'),
        ('GSZ', u'戈雷尼'),
        ('GSK', u'戈里'),
        ('KOR', u'科洛'),
        ('NKR', u'诺特拉尼'),
        ('SAV', u'萨维尼'),
        ('SPO', u'斯波德涅波萨夫'),
        ('ZAS', u'扎萨夫')
    ),

    'SDN': (
        ('ASH', u'北部'),
        ('SIS', u'赤道'),
        ('SDA', u'达尔富尔'),
        ('SHA', u'东部'),
        ('SBG', u'加扎勒河'),
        ('KRT', u'喀土穆'),
        ('GKU', u'科尔多凡'),
        ('ANB', u'上尼罗'),
        ('WDH', u'中部')
    ),

    'SUR': (
        ('BR', u'布罗科蓬多'),
        ('CR', u'科罗尼'),
        ('CM', u'科默韦讷'),
        ('MA', u'马罗韦讷'),
        ('NI', u'尼克里'),
        ('PA', u'帕拉'),
        ('PM', u'帕拉马里博'),
        ('SA', u'萨拉马卡'),
        ('WA', u'瓦尼卡'),
        ('SI', u'西帕里韦尼')
    ),

    'SLB': (
        ('GC', u'瓜达尔卡纳尔'),
        ('HO', u'霍尼亚拉'),
        ('RB', u'拉纳尔和贝罗纳'),
        ('MK', u'马基拉'),
        ('ML', u'马莱塔'),
        ('CH', u'乔伊索'),
        ('TM', u'泰莫图'),
        ('WE', u'西部'),
        ('IS', u'伊萨贝尔'),
        ('CE', u'中部群岛')
    ),

    'TJK': (
        ('DYU', u'杜尚别'),
        ('KHO', u'霍罗格'),
        ('KAN', u'卡尼巴达姆'),
        ('KOF', u'科法尔尼洪'),
        ('KHU', u'苦盏'),
        ('KTJ', u'库尔干-秋别'),
        ('KLB', u'库洛布'),
        ('RGU', u'洛贡'),
        ('NUR', u'努雷克'),
        ('PJK', u'彭吉肯特'),
        ('SBA', u'萨班特'),
        ('TBS', u'塔博沙尔'),
        ('TSZ', u'图尔孙扎德'),
        ('UTJ', u'乌拉秋别'),
        ('ISF', u'伊斯法拉')
    ),

    'THA': (
        ('37', u'安纳乍能'),
        ('77', u'巴蜀'),
        ('13', u'巴吞他尼'),
        ('25', u'巴真'),
        ('71', u'北碧'),
        ('19', u'北标'),
        ('94', u'北大年'),
        ('11', u'北揽'),
        ('60', u'北榄坡'),
        ('24', u'北柳'),
        ('76', u'碧差汶'),
        ('93', u'博达伦'),
        ('18', u'猜那'),
        ('36', u'猜也奔'),
        ('53', u'程逸'),
        ('86', u'春蓬'),
        ('20', u'春武里'),
        ('63', u'达'),
        ('23', u'达叻'),
        ('14', u'大城'),
        ('92', u'董里'),
        ('78', u'佛丕'),
        ('73', u'佛统'),
        ('62', u'甘烹碧'),
        ('15', u'红统'),
        ('16', u'华富里'),
        ('46', u'加拉信'),
        ('81', u'甲米'),
        ('22', u'尖竹汶'),
        ('40', u'孔敬'),
        ('21', u'拉农'),
        ('43', u'廊开'),
        ('39', u'廊莫那浦'),
        ('70', u'叻丕'),
        ('42', u'黎'),
        ('45', u'黎逸'),
        ('74', u'龙仔厝'),
        ('85', u'罗勇'),
        ('80', u'洛坤'),
        ('44', u'玛哈沙拉堪'),
        ('10', u'曼谷'),
        ('49', u'莫达汉'),
        ('26', u'那空那育'),
        ('48', u'那空帕农'),
        ('55', u'难'),
        ('51', u'南奔'),
        ('12', u'暖武里'),
        ('54', u'帕'),
        ('56', u'帕尧'),
        ('82', u'攀牙'),
        ('65', u'彭世洛'),
        ('66', u'披集'),
        ('83', u'普吉'),
        ('57', u'清莱'),
        ('50', u'清迈'),
        ('47', u'色军'),
        ('91', u'沙敦'),
        ('27', u'沙缴'),
        ('33', u'四色菊'),
        ('90', u'宋卡'),
        ('64', u'素可泰'),
        ('84', u'素叻'),
        ('32', u'素林'),
        ('72', u'素攀武里'),
        ('96', u'陶公'),
        ('41', u'乌隆'),
        ('61', u'乌泰他尼'),
        ('34', u'乌汶'),
        ('31', u'武里南'),
        ('17', u'信武里'),
        ('35', u'耶梭通'),
        ('95', u'也拉'),
        ('58', u'夜丰颂'),
        ('75', u'夜功')
    ),

    'TZA': (
        ('AR', u'阿鲁沙'),
        ('PN', u'奔巴北'),
        ('PS', u'奔巴南'),
        ('PW', u'滨海'),
        ('DS', u'达累斯萨拉姆'),
        ('DO', u'多多马'),
        ('KI', u'基戈马'),
        ('KA', u'卡盖拉'),
        ('LN', u'林迪'),
        ('RK', u'鲁夸'),
        ('RV', u'鲁伍马'),
        ('MR', u'马腊'),
        ('MY', u'曼亚拉'),
        ('MO', u'莫洛戈罗'),
        ('MB', u'姆贝亚'),
        ('MT', u'姆特瓦拉'),
        ('MW', u'姆万扎'),
        ('KJ', u'乞力马扎罗'),
        ('ZN', u'桑给巴尔'),
        ('UN', u'桑给巴尔北'),
        ('US', u'桑给巴尔南'),
        ('MM', u'桑给巴尔市和西'),
        ('TB', u'塔波拉'),
        ('TN', u'坦噶'),
        ('SI', u'辛吉达'),
        ('SH', u'欣延加'),
        ('IR', u'伊林加')
    ),

    'TON': (
        ('E', u'埃瓦'),
        ('H', u'哈派'),
        ('N', u'纽阿斯'),
        ('T', u'汤加塔布'),
        ('V', u'瓦瓦乌')
    ),

    'TUN': (
        ('AR', u'艾尔亚奈'),
        ('BJ', u'巴杰'),
        ('BA', u'本阿鲁斯'),
        ('BI', u'比塞大'),
        ('KB', u'吉比利'),
        ('GB', u'加贝斯'),
        ('GF', u'加夫萨'),
        ('JE', u'坚杜拜'),
        ('LK', u'卡夫'),
        ('KS', u'卡塞林'),
        ('KR', u'凯鲁万'),
        ('MH', u'马赫迪耶'),
        ('MN', u'马努巴'),
        ('ME', u'梅德宁'),
        ('MO', u'莫纳斯提尔'),
        ('NA', u'纳布勒'),
        ('SF', u'斯法克斯'),
        ('SO', u'苏塞'),
        ('TA', u'泰塔温'),
        ('TU', u'突尼斯'),
        ('TO', u'托泽尔'),
        ('SD', u'西迪布济德'),
        ('SL', u'锡勒亚奈'),
        ('ZA', u'宰格万')
    ),

    'TUR': (
        ('ADA', u'阿达纳'),
        ('ADI', u'阿德亚曼'),
        ('ARD', u'阿尔达罕'),
        ('ART', u'阿尔特温'),
        ('AFY', u'阿菲永'),
        ('AKS', u'阿克萨赖'),
        ('AGR', u'阿勒'),
        ('AMA', u'阿马西亚'),
        ('EDI', u'埃迪尔内'),
        ('EZC', u'埃尔津詹'),
        ('EZR', u'埃尔祖鲁姆'),
        ('ELA', u'埃拉泽'),
        ('ESK', u'埃斯基谢希尔'),
        ('AYI', u'艾登'),
        ('ANK', u'安卡拉'),
        ('ANT', u'安塔利亚'),
        ('ORD', u'奥尔杜'),
        ('BAR', u'巴尔腾'),
        ('BAL', u'巴勒克埃西尔'),
        ('BAT', u'巴特曼'),
        ('BAY', u'巴伊布尔特'),
        ('BIL', u'比莱吉克'),
        ('BIT', u'比特利斯'),
        ('BIN', u'宾格尔'),
        ('BOL', u'博卢'),
        ('BRD', u'布尔杜尔'),
        ('BRS', u'布尔萨'),
        ('CKR', u'昌克勒'),
        ('DEN', u'代尼兹利'),
        ('DIY', u'迪亚巴克尔'),
        ('VAN', u'凡'),
        ('HKR', u'哈卡里'),
        ('HTY', u'哈塔伊'),
        ('KLS', u'基利斯'),
        ('GIR', u'吉雷松'),
        ('GAZ', u'加济安泰普'),
        ('GMS', u'居米什哈内'),
        ('KRS', u'卡尔斯'),
        ('KAH', u'卡赫拉曼马拉什'),
        ('KRB', u'卡拉比克'),
        ('KRM', u'卡拉曼'),
        ('KAS', u'卡斯塔莫努'),
        ('KAY', u'开塞利'),
        ('KOC', u'科贾埃利'),
        ('KLR', u'柯克拉雷利'),
        ('KON', u'科尼亚'),
        ('KRH', u'克尔谢希尔'),
        ('KRK', u'克勒克卡莱'),
        ('URF', u'拉飞'),
        ('RIZ', u'里泽'),
        ('MAR', u'马尔丁'),
        ('MAL', u'马拉蒂亚'),
        ('MAN', u'马尼萨'),
        ('MUG', u'穆拉'),
        ('MUS', u'穆什'),
        ('NEV', u'内夫谢希尔'),
        ('NIG', u'尼代'),
        ('CKL', u'恰纳卡莱'),
        ('COR', u'乔鲁姆'),
        ('KUT', u'屈塔希亚'),
        ('SAK', u'萨卡里亚'),
        ('SAM', u'萨姆松'),
        ('TEL', u'泰基尔达'),
        ('TRA', u'特拉布宗'),
        ('TUN', u'通杰利'),
        ('TOK', u'托卡特'),
        ('USK', u'乌萨克'),
        ('SIR', u'锡尔纳克'),
        ('SII', u'锡尔特'),
        ('SIN', u'锡诺普'),
        ('SIV', u'锡瓦斯'),
        ('IGD', u'伊迪尔'),
        ('ICE', u'伊切尔'),
        ('ISP', u'伊斯帕尔塔'),
        ('IST', u'伊斯坦布尔'),
        ('IZM', u'伊兹密尔'),
        ('YOZ', u'约兹加特'),
        ('ZON', u'宗古尔达克')
    ),

    'TKM': (
        ('A', u'阿哈尔'),
        ('ASB', u'阿什哈巴德市'),
        ('B', u'巴尔坎'),
        ('D', u'达沙古兹'),
        ('L', u'列巴普'),
        ('M', u'马雷'),
        ('NEB', u'涅比特达格')
    ),

    'VUT': (
        ('MA', u'马朗帕'),
        ('PE', u'彭纳马'),
        ('SA', u'桑马'),
        ('TA', u'塔菲阿'),
        ('TO', u'托尔巴'),
        ('SH', u'谢法')
    ),

    'GTM': (
        ('PR', u'埃尔普罗格雷索'),
        ('ES', u'埃斯昆特拉'),
        ('JA', u'哈拉帕'),
        ('JU', u'胡蒂亚帕'),
        ('QC', u'基切'),
        ('QZ', u'克萨尔特南戈'),
        ('RE', u'雷塔卢莱乌'),
        ('MIX', u'米克斯科'),
        ('PE', u'佩滕'),
        ('CQ', u'奇基穆拉'),
        ('CM', u'奇马尔特南戈'),
        ('ZA', u'萨卡帕'),
        ('ST', u'萨卡特佩克斯'),
        ('AV', u'上韦拉帕斯'),
        ('SR', u'圣罗莎'),
        ('SM', u'圣马科斯'),
        ('SU', u'苏奇特佩克斯'),
        ('SO', u'索洛拉'),
        ('TO', u'托托尼卡潘'),
        ('GU', u'危地马拉'),
        ('HU', u'韦韦特南戈'),
        ('BV', u'下韦拉帕斯'),
        ('VIN', u'新城'),
        ('IZ', u'伊萨瓦尔')
    ),

    'VEN': (
        ('D', u'阿拉瓜'),
        ('Y', u'阿马库罗三角洲'),
        ('C', u'阿普雷'),
        ('B', u'安索阿特吉'),
        ('E', u'巴里纳斯'),
        ('F', u'玻利瓦尔'),
        ('P', u'波图格萨'),
        ('I', u'法尔孔'),
        ('J', u'瓜里科'),
        ('A', u'加拉加斯'),
        ('G', u'卡拉沃沃'),
        ('H', u'科赫德斯'),
        ('K', u'拉腊'),
        ('W', u'联邦属地'),
        ('L', u'梅里达'),
        ('M', u'米兰达'),
        ('N', u'莫纳加斯'),
        ('R', u'苏克雷'),
        ('V', u'苏利亚'),
        ('S', u'塔奇拉'),
        ('T', u'特鲁希略'),
        ('O', u'新埃斯帕塔'),
        ('U', u'亚拉奎'),
        ('Z', u'亚马孙')
    ),

    'UGA': (
        ('ARU', u'阿鲁阿'),
        ('APC', u'阿帕克'),
        ('ADJ', u'阿朱马尼'),
        ('BUN', u'本迪布焦'),
        ('BUG', u'布吉里'),
        ('BUS', u'布西亚'),
        ('BSH', u'布谢尼'),
        ('NTU', u'恩通加莫'),
        ('GUL', u'古卢'),
        ('HOI', u'霍伊马'),
        ('KBA', u'基巴莱'),
        ('KIB', u'基博加'),
        ('KYE', u'基恩乔乔'),
        ('KIS', u'基索罗'),
        ('KIT', u'基特古姆'),
        ('JIN', u'金贾'),
        ('KBL', u'卡巴莱'),
        ('KAR', u'卡巴罗莱'),
        ('KAB', u'卡贝拉马伊多'),
        ('KAL', u'卡兰加拉'),
        ('KAM', u'卡姆文盖'),
        ('KML', u'卡穆利'),
        ('KAN', u'卡农古'),
        ('KPC', u'卡普乔鲁瓦'),
        ('KAS', u'卡塞塞'),
        ('KTK', u'卡塔奎'),
        ('KAY', u'卡永加'),
        ('KMP', u'坎帕拉'),
        ('KOT', u'科蒂多'),
        ('KUM', u'库米'),
        ('RAK', u'拉卡伊'),
        ('LIR', u'利拉'),
        ('LUW', u'卢韦罗'),
        ('RUK', u'鲁昆吉里'),
        ('MAS', u'马萨卡'),
        ('MSN', u'马辛迪'),
        ('MAY', u'马尤盖'),
        ('MRT', u'莫罗托'),
        ('MOY', u'莫约'),
        ('MBR', u'姆巴拉拉'),
        ('MBA', u'姆巴莱'),
        ('MPI', u'姆皮吉'),
        ('MUB', u'穆本德'),
        ('MUK', u'穆科诺'),
        ('NAK', u'纳卡皮里皮里特'),
        ('NKS', u'纳卡松戈拉'),
        ('NEB', u'内比'),
        ('PAD', u'帕德尔'),
        ('PAL', u'帕利萨'),
        ('SEM', u'森巴布莱'),
        ('SOR', u'索罗提'),
        ('TOR', u'托罗罗'),
        ('WAK', u'瓦基索'),
        ('SIR', u'锡龙科'),
        ('IGA', u'伊甘加'),
        ('YUM', u'永贝')
    ),

    'UKR': (
        ('51', u'敖德萨'),
        ('53', u'波尔塔瓦'),
        ('12', u'第聂伯罗波得罗夫斯克'),
        ('14', u'顿涅茨克'),
        ('63', u'哈尔科夫'),
        ('65', u'赫尔松州'),
        ('68', u'赫梅利尼茨基'),
        ('30', u'基辅'),
        ('35', u'基洛夫格勒'),
        ('61', u'捷尔诺波尔'),
        ('43', u'克里米亚自治共和国'),
        ('46', u'利沃夫'),
        ('9', u'卢甘斯克'),
        ('56', u'罗夫诺'),
        ('48', u'尼古拉耶夫'),
        ('71', u'切尔卡瑟'),
        ('74', u'切尔尼戈夫'),
        ('77', u'切尔诺夫策'),
        ('18', u'日托米尔'),
        ('59', u'苏梅'),
        ('21', u'外喀尔巴阡'),
        ('5', u'文尼察'),
        ('7', u'沃伦'),
        ('26', u'伊万－弗兰科夫州'),
        ('23', u'扎波罗热')
    ),

    'URY': (
        ('AR', u'阿蒂加斯'),
        ('DU', u'杜拉斯诺'),
        ('FA', u'佛罗里达'),
        ('FS', u'弗洛雷斯'),
        ('CA', u'卡内洛内斯'),
        ('CO', u'科洛尼亚'),
        ('LA', u'拉瓦耶哈'),
        ('RV', u'里韦拉'),
        ('RO', u'罗恰'),
        ('MA', u'马尔多纳多'),
        ('MO', u'蒙得维的亚'),
        ('RN', u'内格罗河'),
        ('PA', u'派桑杜'),
        ('SL', u'萨尔托'),
        ('CL', u'塞罗拉尔戈'),
        ('TT', u'三十三人'),
        ('SJ', u'圣何塞'),
        ('SO', u'索里亚诺'),
        ('TAW', u'塔夸伦博')
    ),

    'UZB': (
        ('AN', u'安集延'),
        ('BU', u'布哈拉'),
        ('FA', u'费尔干纳'),
        ('XO', u'花拉子模'),
        ('JI', u'吉扎克'),
        ('QR', u'卡拉卡尔帕克斯坦共和国'),
        ('QA', u'卡什卡达里亚'),
        ('NG', u'纳曼干'),
        ('NW', u'纳沃伊'),
        ('SA', u'撒马尔罕'),
        ('SU', u'苏尔汉河'),
        ('TK', u'塔什干'),
        ('TO', u'塔什干市'),
        ('SI', u'锡尔河')
    ),

    'ESP': (
        ('LEI', u'阿尔梅里亚'),
        ('ALB', u'阿尔瓦塞特'),
        ('ALA', u'阿拉瓦'),
        ('ALC', u'阿利坎特'),
        ('AST', u'阿斯图利亚斯'),
        ('AVI', u'阿维拉'),
        ('ORE', u'奥伦塞'),
        ('BJZ', u'巴达霍斯'),
        ('BLR', u'巴利阿里'),
        ('VLL', u'巴利亚多利德'),
        ('VLC', u'巴伦西亚'),
        ('BCN', u'巴塞罗那'),
        ('VSE', u'比斯开'),
        ('BUR', u'布尔戈斯'),
        ('GRX', u'格拉纳达'),
        ('GUA', u'瓜达拉哈拉'),
        ('JAE', u'哈恩'),
        ('GRO', u'赫罗纳'),
        ('GUI', u'吉普斯夸'),
        ('CAD', u'加的斯'),
        ('CCS', u'卡塞雷斯'),
        ('CIR', u'卡斯蒂利亚'),
        ('CAS', u'卡斯特利翁'),
        ('ODB', u'科尔多瓦'),
        ('CUE', u'昆卡'),
        ('LCG', u'拉科鲁尼亚'),
        ('ARL', u'拉里奥哈'),
        ('LPA', u'拉斯帕尔马斯'),
        ('LEN', u'莱昂'),
        ('LLE', u'莱里达'),
        ('LGO', u'卢戈'),
        ('MAD', u'马德里'),
        ('AGP', u'马拉加'),
        ('MJV', u'穆尔西亚'),
        ('NVV', u'纳瓦拉'),
        ('PAC', u'帕伦西亚'),
        ('PEV', u'蓬特韦德拉'),
        ('ZAZ', u'萨拉戈萨'),
        ('SLM', u'萨拉曼卡'),
        ('ZMR', u'萨莫拉'),
        ('SEG', u'塞哥维亚'),
        ('SVQ', u'塞维利亚'),
        ('SDR', u'桑坦德'),
        ('SCT', u'圣克鲁斯-德特内里费'),
        ('SOR', u'索里亚'),
        ('TAR', u'塔拉戈纳'),
        ('TER', u'特鲁埃尔'),
        ('TOL', u'托莱多'),
        ('HUV', u'韦尔瓦'),
        ('HUC', u'韦斯卡')
    ),

    'GRC': (
        ('PRI', u'比雷埃夫斯'),
        ('DO', u'多德卡尼斯'),
        ('CHQ', u'干尼亚'),
        ('CY', u'基克拉迪'),
        ('LST', u'拉西锡'),
        ('LES', u'莱斯博斯'),
        ('RET', u'雷西姆农'),
        ('SMI', u'萨摩斯'),
        ('ATH', u'雅典'),
        ('HER', u'伊拉克里翁')
    ),

    'NZL': (
        ('AUK', u'奥克兰'),
        ('NSH', u'北岸'),
        ('PMR', u'北帕默斯顿'),
        ('FNR', u'北远'),
        ('BHE', u'布莱尼姆'),
        ('DUD', u'达尼丁'),
        ('GMN', u'格雷茅斯'),
        ('HLZ', u'哈密尔顿'),
        ('HAS', u'黑斯廷斯'),
        ('WAE', u'怀塔科拉'),
        ('GIS', u'吉斯伯恩'),
        ('KAI', u'凯帕拉'),
        ('CHC', u'克赖斯特彻奇'),
        ('RMD', u'里士满'),
        ('MNK', u'马努考'),
        ('NSN', u'纳尔逊'),
        ('NPE', u'内皮尔'),
        ('STR', u'斯特拉特福德'),
        ('TAU', u'陶马鲁努伊'),
        ('WHK', u'瓦卡塔尼'),
        ('WRE', u'旺阿雷'),
        ('WAG', u'旺格努伊'),
        ('NPL', u'新普利茅斯'),
        ('IVC', u'因弗卡吉尔')
    ),

    'HUN': (
        ('BA', u'巴兰尼亚'),
        ('BK', u'巴奇-基什孔'),
        ('BZ', u'包尔绍德-奥包乌伊-曾普伦'),
        ('BE', u'贝凯什'),
        ('BU', u'布达佩斯'),
        ('FE', u'费耶尔'),
        ('HB', u'豪伊杜-比豪尔'),
        ('HE', u'赫维什'),
        ('JN', u'加兹-纳杰孔-索尔诺克'),
        ('GS', u'杰尔-莫松-肖普朗'),
        ('KE', u'科马罗姆'),
        ('NO', u'诺格拉德'),
        ('PE', u'佩斯'),
        ('CS', u'琼格拉德'),
        ('SO', u'绍莫吉'),
        ('SZ', u'索博尔奇-索特马尔-贝拉格'),
        ('TO', u'托尔瑙'),
        ('VE', u'维斯普雷姆'),
        ('VA', u'沃什'),
        ('ZA', u'佐洛')
    ),

    'SYR': (
        ('HL', u'阿勒颇'),
        ('RD', u'大马士革'),
        ('DI', u'大马士革市'),
        ('DZ', u'代尔祖尔'),
        ('DA', u'德拉'),
        ('HM', u'哈马'),
        ('HA', u'哈塞克'),
        ('HI', u'霍姆斯'),
        ('GH', u'加布'),
        ('QA', u'卡米什利'),
        ('QU', u'库奈特拉'),
        ('RQ', u'拉卡'),
        ('LA', u'拉塔基亚'),
        ('SU', u'苏韦达'),
        ('TA', u'塔尔图斯'),
        ('ID', u'伊德利卜')
    ),

    'JAM': (
        ('POR', u'波特兰'),
        ('HAN', u'汉诺威'),
        ('KIN', u'金斯敦'),
        ('CLA', u'克拉伦登'),
        ('MAN', u'曼彻斯特'),
        ('AND', u'圣安德鲁斯'),
        ('ANN', u'圣安娜'),
        ('CAT', u'圣凯瑟琳'),
        ('MAR', u'圣玛丽'),
        ('THO', u'圣托马斯'),
        ('ELI', u'圣伊丽莎白'),
        ('JAM', u'圣詹姆斯'),
        ('TRL', u'特里洛尼'),
        ('WML', u'西摩兰')
    ),

    'ARM': (
        ('ARM', u'阿尔马维尔'),
        ('AGT', u'阿拉加措特恩'),
        ('ARA', u'阿拉拉特'),
        ('EVN', u'埃里温市'),
        ('GEG', u'格加尔库尼克'),
        ('KOT', u'科泰克'),
        ('LOR', u'洛里'),
        ('TAV', u'塔武什'),
        ('VAY', u'瓦约茨·佐尔'),
        ('SHI', u'希拉克'),
        ('SYU', u'休尼克')
    ),

    'YEM': (
        ('AB', u'阿比扬'),
        ('AM', u'阿姆兰'),
        ('BA', u'贝达'),
        ('DA', u'达利'),
        ('HD', u'哈德拉毛'),
        ('HJ', u'哈杰'),
        ('HU', u'荷台达'),
        ('JA', u'焦夫'),
        ('LA', u'拉赫季'),
        ('MA', u'马里卜'),
        ('MR', u'迈赫拉'),
        ('MW', u'迈赫维特'),
        ('SD', u'萨达'),
        ('SN', u'萨那'),
        ('GXF', u'赛文'),
        ('SH', u'舍卜沃'),
        ('TA', u'塔伊兹'),
        ('ASR', u'希赫尔'),
        ('AD', u'亚丁'),
        ('IB', u'伊卜'),
        ('DH', u'扎玛尔')
    ),

    'ISR': (
        ('ASH', u'阿什杜德'),
        ('BEV', u'贝尔谢巴'),
        ('BAT', u'贝特雁'),
        ('HFA', u'海法'),
        ('HOL', u'霍隆'),
        ('NAT', u'内坦亚'),
        ('TLV', u'特拉维夫'),
        ('J', u'耶路撒冷')
    ),

    'ITA': (
        ('AST', u'阿斯蒂'),
        ('ASP', u'阿斯科利皮切诺'),
        ('AOI', u'安科纳'),
        ('OLB', u'奥尔比亚'),
        ('QOS', u'奥里斯塔诺'),
        ('AOT', u'奥斯塔'),
        ('PMO', u'巴勒莫'),
        ('BRI', u'巴里'),
        ('BGO', u'贝加莫'),
        ('BEN', u'贝内文托'),
        ('PSA', u'比萨'),
        ('PRD', u'波代诺内'),
        ('QPO', u'波坦察'),
        ('BLQ', u'博洛尼亚'),
        ('BIE', u'布拉'),
        ('BRC', u'布雷西亚'),
        ('BDS', u'布林迪西'),
        ('TRS', u'的里雅斯特'),
        ('TRN', u'都灵'),
        ('FRR', u'费拉拉'),
        ('FLR', u'佛罗伦萨'),
        ('FOG', u'福贾'),
        ('CAG', u'卡利亚里'),
        ('CST', u'卡塞塔'),
        ('CTA', u'卡塔尼亚'),
        ('QCZ', u'卡坦扎罗'),
        ('COB', u'坎波巴索'),
        ('CIY', u'科摩'),
        ('QCS', u'科森扎'),
        ('CRV', u'克罗托内'),
        ('CUN', u'库内奥'),
        ('LAQ', u'拉奎拉'),
        ('SPE', u'拉斯佩齐亚'),
        ('LCO', u'莱科'),
        ('LCC', u'莱切'),
        ('RNE', u'雷焦艾米利亚'),
        ('REG', u'雷焦卡拉布里亚'),
        ('LIV', u'里窝那'),
        ('ROM', u'罗马'),
        ('MCR', u'马萨'),
        ('MTR', u'马泰拉'),
        ('MZA', u'蒙扎'),
        ('MIL', u'米兰'),
        ('MOD', u'摩德纳'),
        ('MSN', u'墨西拿'),
        ('NAP', u'那不勒斯'),
        ('QNU', u'努奥罗'),
        ('NVR', u'诺瓦拉'),
        ('PMF', u'帕尔马'),
        ('PAV', u'帕维亚'),
        ('PEG', u'佩鲁贾'),
        ('CAX', u'热那亚'),
        ('SAL', u'萨莱诺'),
        ('QSS', u'萨萨里'),
        ('SVN', u'萨沃纳'),
        ('TAR', u'塔兰托'),
        ('TPS', u'特拉帕尼'),
        ('TRT', u'特伦托'),
        ('VCE', u'威尼斯'),
        ('VRL', u'韦尔切利'),
        ('VIT', u'维泰博'),
        ('UDN', u'乌迪内'),
        ('SYR', u'锡拉库扎'),
        ('SNA', u'锡耶纳'),
        ('ALE', u'亚历山德里亚'),
        ('ISE', u'伊塞尔尼亚')
    ),

    'IND': (
        ('AJL', u'艾藻尔'),
        ('BLR', u'班加罗尔'),
        ('PNY', u'本地治里'),
        ('BHO', u'博帕尔'),
        ('BBI', u'布巴内斯瓦尔'),
        ('IXC', u'昌迪加尔'),
        ('DAM', u'达曼'),
        ('DIU', u'第乌'),
        ('GTO', u'甘托克'),
        ('CJB', u'哥印拜陀'),
        ('CCU', u'加尔各答'),
        ('KRK', u'加里加尔'),
        ('JLR', u'贾巴尔普尔'),
        ('JUC', u'贾朗达尔'),
        ('JDH', u'焦特布尔'),
        ('MAA', u'金奈'),
        ('KVA', u'卡瓦拉蒂'),
        ('KOM', u'科希马'),
        ('MAH', u'马埃'),
        ('IXM', u'马杜赖'),
        ('SLR', u'森伯尔布尔'),
        ('TRV', u'特里凡得琅'),
        ('UDR', u'乌代布尔'),
        ('SHL', u'西隆'),
        ('SIL', u'锡尔萨瓦'),
        ('ICD', u'新德里'),
        ('SRV', u'亚南'),
        ('IMF', u'因帕尔'),
        ('IDR', u'印多尔'),
        ('JAI', u'斋普尔')
    ),

    'IDN': (
        ('BA', u'巴厘'),
        ('BB', u'邦加－勿里洞群岛'),
        ('SA', u'北苏拉威西'),
        ('SU', u'北苏门答腊'),
        ('KB', u'大雅加达首都特区'),
        ('KI', u'东加里曼丹'),
        ('SG', u'东南苏拉威西'),
        ('NT', u'东努沙登加拉'),
        ('JI', u'东爪哇'),
        ('RI', u'廖内'),
        ('MA', u'马鲁古'),
        ('BE', u'明古鲁'),
        ('LA', u'楠榜'),
        ('KS', u'南加里曼丹'),
        ('SN', u'南苏拉威西'),
        ('SS', u'南苏门答腊'),
        ('YO', u'日惹特区'),
        ('BT', u'万丹'),
        ('NB', u'西努沙登加拉'),
        ('SR', u'西苏门答腊'),
        ('JB', u'西爪哇'),
        ('JK', u'雅加达'),
        ('AC', u'亚齐'),
        ('IJ', u'伊里安查亚'),
        ('JA', u'占碑'),
        ('KT', u'中加里曼丹'),
        ('ST', u'中苏拉威西'),
        ('JT', u'中爪哇')
    ),

    'GBR:NIR': (
        ('BFS', u'贝尔法斯特'),
        ('DRY', u'德里'),
        ('LSB', u'利斯本'),
        ('NYM', u'纽里')
    ),

    'GBR:SCT': (
        ('ABD', u'阿伯丁'),
        ('EDH', u'爱丁堡'),
        ('DND', u'丹迪'),
        ('GLG', u'格拉斯哥'),
        ('STG', u'斯特灵'),
        ('INV', u'因弗内斯')
    ),

    'GBR:WLS': (
        ('BAN', u'班戈'),
        ('CDF', u'卡迪夫'),
        ('NWP', u'纽波特'),
        ('SWA', u'斯旺西')
    ),

    'GBR:ENG': (
        ('EXE', u'埃克塞特'),
        ('BAS', u'巴斯'),
        ('PTE', u'彼得伯勒'),
        ('BIR', u'伯明翰'),
        ('BRD', u'布拉德福德'),
        ('BNH', u'布莱顿与赫福'),
        ('BST', u'布里斯托尔'),
        ('DER', u'德比'),
        ('DUR', u'德罕'),
        ('GLO', u'格洛斯特'),
        ('KUH', u'赫尔河畔京斯敦'),
        ('HAF', u'赫里福德'),
        ('CAM', u'剑桥'),
        ('CAX', u'卡莱尔'),
        ('CNG', u'坎特伯雷'),
        ('COV', u'考文垂'),
        ('LAN', u'兰开斯特'),
        ('RIP', u'里彭'),
        ('LHF', u'利奇菲尔德'),
        ('LIV', u'利物浦'),
        ('LDS', u'利茲'),
        ('LCE', u'列斯特'),
        ('LCN', u'林肯'),
        ('LND', u'伦敦'),
        ('MAN', u'曼彻斯特'),
        ('STH', u'南安普敦'),
        ('OXF', u'牛津'),
        ('NCL', u'纽卡斯尔'),
        ('NGM', u'诺丁汉'),
        ('NRW', u'诺里奇'),
        ('POR', u'朴茨茅斯'),
        ('PRE', u'普雷斯顿'),
        ('PLY', u'普利茅斯'),
        ('CST', u'奇切斯特'),
        ('CEG', u'切斯特'),
        ('SUN', u'桑德兰'),
        ('TBL', u'圣阿本斯'),
        ('SLS', u'索尔斯堡'),
        ('SLF', u'索福特'),
        ('TRU', u'特鲁罗'),
        ('SOT', u'特伦特河畔斯多克'),
        ('WLS', u'威尔斯'),
        ('WKF', u'韦克菲尔德'),
        ('WNE', u'温彻斯特'),
        ('WOV', u'伍尔弗汉普顿'),
        ('WOR', u'伍斯特'),
        ('SHE', u'谢菲尔德'),
        ('ELY', u'伊利'),
        ('YOR', u'约克')
    ),

    'JOR': (
        ('AJ', u'阿吉隆'),
        ('AM', u'安曼'),
        ('BA', u'拜勒加'),
        ('JA', u'杰拉什'),
        ('KA', u'卡拉克'),
        ('RU', u'鲁赛法'),
        ('MN', u'马安'),
        ('MD', u'马德巴'),
        ('MF', u'马夫拉克'),
        ('TA', u'塔菲拉'),
        ('AQ', u'亚喀巴'),
        ('IR', u'伊尔比德'),
        ('ZA', u'扎尔卡')
    ),

    'VNM': (
        ('HP', u'海防'),
        ('HI', u'河内'),
        ('HC', u'胡志明市')
    ),

    'ZMB': (
        ('NO', u'北方'),
        ('EA', u'东方'),
        ('LP', u'卢阿普拉'),
        ('LK', u'卢萨卡'),
        ('SO', u'南方'),
        ('CB', u'铜带'),
        ('NW', u'西北'),
        ('WE', u'西方'),
        ('CE', u'中央')
    ),

    'CHL': (
        ('AR', u'阿劳卡尼亚大区'),
        ('AT', u'阿塔卡马大区'),
        ('AN', u'安托法加斯塔大区'),
        ('BI', u'比奥比奥大区'),
        ('LI', u'复活节岛'),
        ('LL', u'湖大区'),
        ('CO', u'科金博大区'),
        ('ML', u'马乌莱大区'),
        ('MA', u'麦哲伦-智利南极大区'),
        ('RM', u'圣地亚哥'),
        ('TA', u'塔拉帕卡大区'),
        ('VS', u'瓦尔帕莱索大区'),
        ('AI', u'伊瓦涅斯将军的艾森大区')
    ),

    'CAF': (
        ('BB', u'巴明吉-班戈兰'),
        ('BGF', u'班吉直辖市'),
        ('BI', u'宾博'),
        ('KG', u'凯莫'),
        ('LB', u'洛巴伊'),
        ('HS', u'曼贝雷-卡代'),
        ('MB', u'姆博穆'),
        ('KB', u'纳纳-格里比齐'),
        ('NM', u'纳纳-曼贝雷'),
        ('SE', u'桑加-姆巴埃雷'),
        ('HK', u'上科托'),
        ('HM', u'上姆博穆'),
        ('UK', u'瓦卡'),
        ('VK', u'瓦卡加'),
        ('AC', u'瓦姆'),
        ('OP', u'瓦姆-彭代'),
        ('MP', u'翁贝拉-姆波科'),
        ('BK', u'下科托')
    )
}

REGION_CHOICES_MAP = {
    '1:13:1': (
        ('2', u'长安区'),
        ('3', u'桥东区'),
        ('4', u'桥西区'),
        ('5', u'新华区'),
        ('7', u'井陉矿区'),
        ('8', u'裕华区'),
        ('21', u'井陉县'),
        ('23', u'正定县'),
        ('24', u'栾城县'),
        ('25', u'行唐县'),
        ('26', u'灵寿县'),
        ('27', u'高邑县'),
        ('28', u'深泽县'),
        ('29', u'赞皇县'),
        ('30', u'无极县'),
        ('31', u'平山县'),
        ('32', u'元氏县'),
        ('33', u'赵县'),
        ('81', u'辛集市'),
        ('82', u'藁城市'),
        ('83', u'晋州市'),
        ('84', u'新乐市'),
        ('85', u'鹿泉市')
    ),

    '1:13:2': (
        ('2', u'路南区'),
        ('3', u'路北区'),
        ('4', u'古冶区'),
        ('5', u'开平区'),
        ('7', u'丰南区'),
        ('8', u'丰润区'),
        ('23', u'滦　县'),
        ('24', u'滦南县'),
        ('25', u'乐亭县'),
        ('27', u'迁西县'),
        ('29', u'玉田县'),
        ('30', u'唐海县'),
        ('81', u'遵化市'),
        ('83', u'迁安市')
    ),

    '1:13:3': (
        ('2', u'海港区'),
        ('3', u'山海关区'),
        ('4', u'北戴河区'),
        ('21', u'青龙满族自治县'),
        ('22', u'昌黎县'),
        ('23', u'抚宁县'),
        ('24', u'卢龙县')
    ),

    '1:13:4': (
        ('2', u'邯山区'),
        ('3', u'丛台区'),
        ('4', u'复兴区'),
        ('6', u'峰峰矿区'),
        ('21', u'邯郸县'),
        ('23', u'临漳县'),
        ('24', u'成安县'),
        ('25', u'大名县'),
        ('26', u'涉　县'),
        ('27', u'磁　县'),
        ('28', u'肥乡县'),
        ('29', u'永年县'),
        ('30', u'邱　县'),
        ('31', u'鸡泽县'),
        ('32', u'广平县'),
        ('33', u'馆陶县'),
        ('34', u'魏　县'),
        ('35', u'曲周县'),
        ('81', u'武安市')
    ),

    '1:13:5': (
        ('2', u'桥东区'),
        ('3', u'桥西区'),
        ('21', u'邢台县'),
        ('22', u'临城县'),
        ('23', u'内丘县'),
        ('24', u'柏乡县'),
        ('25', u'隆尧县'),
        ('26', u'任　县'),
        ('27', u'南和县'),
        ('28', u'宁晋县'),
        ('29', u'巨鹿县'),
        ('30', u'新河县'),
        ('31', u'广宗县'),
        ('32', u'平乡县'),
        ('33', u'威　县'),
        ('34', u'清河县'),
        ('35', u'临西县'),
        ('81', u'南宫市'),
        ('82', u'沙河市')
    ),

    '1:13:6': (
        ('2', u'新市区'),
        ('3', u'北市区'),
        ('4', u'南市区'),
        ('21', u'满城县'),
        ('22', u'清苑县'),
        ('23', u'涞水县'),
        ('24', u'阜平县'),
        ('25', u'徐水县'),
        ('26', u'定兴县'),
        ('27', u'唐　县'),
        ('28', u'高阳县'),
        ('29', u'容城县'),
        ('30', u'涞源县'),
        ('31', u'望都县'),
        ('32', u'安新县'),
        ('33', u'易　县'),
        ('34', u'曲阳县'),
        ('35', u'蠡　县'),
        ('36', u'顺平县'),
        ('37', u'博野县'),
        ('38', u'雄　县'),
        ('81', u'涿州市'),
        ('82', u'定州市'),
        ('83', u'安国市'),
        ('84', u'高碑店市')
    ),

    '1:13:7': (
        ('2', u'桥东区'),
        ('3', u'桥西区'),
        ('5', u'宣化区'),
        ('6', u'下花园区'),
        ('21', u'宣化县'),
        ('22', u'张北县'),
        ('23', u'康保县'),
        ('24', u'沽源县'),
        ('25', u'尚义县'),
        ('26', u'蔚　县'),
        ('27', u'阳原县'),
        ('28', u'怀安县'),
        ('29', u'万全县'),
        ('30', u'怀来县'),
        ('31', u'涿鹿县'),
        ('32', u'赤城县'),
        ('33', u'崇礼县')
    ),

    '1:13:8': (
        ('2', u'双桥区'),
        ('3', u'双滦区'),
        ('4', u'鹰手营子矿区'),
        ('21', u'承德县'),
        ('22', u'兴隆县'),
        ('23', u'平泉县'),
        ('24', u'滦平县'),
        ('25', u'隆化县'),
        ('26', u'丰宁满族自治县'),
        ('27', u'宽城满族自治县'),
        ('28', u'围场满族蒙古族自治县')
    ),

    '1:13:9': (
        ('2', u'新华区'),
        ('3', u'运河区'),
        ('21', u'沧　县'),
        ('22', u'青　县'),
        ('23', u'东光县'),
        ('24', u'海兴县'),
        ('25', u'盐山县'),
        ('26', u'肃宁县'),
        ('27', u'南皮县'),
        ('28', u'吴桥县'),
        ('29', u'献　县'),
        ('30', u'孟村回族自治县'),
        ('81', u'泊头市'),
        ('82', u'任丘市'),
        ('83', u'黄骅市'),
        ('84', u'河间市')
    ),

    '1:13:10': (
        ('2', u'安次区'),
        ('3', u'广阳区'),
        ('22', u'固安县'),
        ('23', u'永清县'),
        ('24', u'香河县'),
        ('25', u'大城县'),
        ('26', u'文安县'),
        ('28', u'大厂回族自治县'),
        ('81', u'霸州市'),
        ('82', u'三河市')
    ),

    '1:13:11': (
        ('2', u'桃城区'),
        ('21', u'枣强县'),
        ('22', u'武邑县'),
        ('23', u'武强县'),
        ('24', u'饶阳县'),
        ('25', u'安平县'),
        ('26', u'故城县'),
        ('27', u'景　县'),
        ('28', u'阜城县'),
        ('81', u'冀州市'),
        ('82', u'深州市')
    ),

    '1:14:1': (
        ('5', u'小店区'),
        ('6', u'迎泽区'),
        ('7', u'杏花岭区'),
        ('8', u'尖草坪区'),
        ('9', u'万柏林区'),
        ('10', u'晋源区'),
        ('21', u'清徐县'),
        ('22', u'阳曲县'),
        ('23', u'娄烦县'),
        ('81', u'古交市')
    ),

    '1:14:2': (
        ('2', u'城　区'),
        ('3', u'矿　区'),
        ('11', u'南郊区'),
        ('12', u'新荣区'),
        ('21', u'阳高县'),
        ('22', u'天镇县'),
        ('23', u'广灵县'),
        ('24', u'灵丘县'),
        ('25', u'浑源县'),
        ('26', u'左云县'),
        ('27', u'大同县')
    ),

    '1:14:3': (
        ('2', u'城　区'),
        ('3', u'矿　区'),
        ('11', u'郊　区'),
        ('21', u'平定县'),
        ('22', u'盂　县')
    ),

    '1:14:4': (
        ('2', u'城　区'),
        ('11', u'郊　区'),
        ('21', u'长治县'),
        ('23', u'襄垣县'),
        ('24', u'屯留县'),
        ('25', u'平顺县'),
        ('26', u'黎城县'),
        ('27', u'壶关县'),
        ('28', u'长子县'),
        ('29', u'武乡县'),
        ('30', u'沁　县'),
        ('31', u'沁源县'),
        ('81', u'潞城市')
    ),

    '1:14:5': (
        ('2', u'城　区'),
        ('21', u'沁水县'),
        ('22', u'阳城县'),
        ('24', u'陵川县'),
        ('25', u'泽州县'),
        ('81', u'高平市')
    ),

    '1:14:6': (
        ('2', u'朔城区'),
        ('3', u'平鲁区'),
        ('21', u'山阴县'),
        ('22', u'应　县'),
        ('23', u'右玉县'),
        ('24', u'怀仁县')
    ),

    '1:14:7': (
        ('2', u'榆次区'),
        ('21', u'榆社县'),
        ('22', u'左权县'),
        ('23', u'和顺县'),
        ('24', u'昔阳县'),
        ('25', u'寿阳县'),
        ('26', u'太谷县'),
        ('27', u'祁　县'),
        ('28', u'平遥县'),
        ('29', u'灵石县'),
        ('81', u'介休市')
    ),

    '1:14:8': (
        ('2', u'盐湖区'),
        ('21', u'临猗县'),
        ('22', u'万荣县'),
        ('23', u'闻喜县'),
        ('24', u'稷山县'),
        ('25', u'新绛县'),
        ('26', u'绛　县'),
        ('27', u'垣曲县'),
        ('28', u'夏　县'),
        ('29', u'平陆县'),
        ('30', u'芮城县'),
        ('81', u'永济市'),
        ('82', u'河津市')
    ),

    '1:14:9': (
        ('2', u'忻府区'),
        ('21', u'定襄县'),
        ('22', u'五台县'),
        ('23', u'代　县'),
        ('24', u'繁峙县'),
        ('25', u'宁武县'),
        ('26', u'静乐县'),
        ('27', u'神池县'),
        ('28', u'五寨县'),
        ('29', u'岢岚县'),
        ('30', u'河曲县'),
        ('31', u'保德县'),
        ('32', u'偏关县'),
        ('81', u'原平市')
    ),

    '1:14:10': (
        ('2', u'尧都区'),
        ('21', u'曲沃县'),
        ('22', u'翼城县'),
        ('23', u'襄汾县'),
        ('24', u'洪洞县'),
        ('25', u'古　县'),
        ('26', u'安泽县'),
        ('27', u'浮山县'),
        ('28', u'吉　县'),
        ('29', u'乡宁县'),
        ('30', u'大宁县'),
        ('31', u'隰　县'),
        ('32', u'永和县'),
        ('33', u'蒲　县'),
        ('34', u'汾西县'),
        ('81', u'侯马市'),
        ('82', u'霍州市')
    ),

    '1:14:11': (
        ('2', u'离石区'),
        ('21', u'文水县'),
        ('22', u'交城县'),
        ('23', u'兴　县'),
        ('24', u'临　县'),
        ('25', u'柳林县'),
        ('26', u'石楼县'),
        ('27', u'岚　县'),
        ('28', u'方山县'),
        ('29', u'中阳县'),
        ('30', u'交口县'),
        ('81', u'孝义市'),
        ('82', u'汾阳市')
    ),

    '1:15:1': (
        ('2', u'新城区'),
        ('3', u'回民区'),
        ('4', u'玉泉区'),
        ('5', u'赛罕区'),
        ('21', u'土默特左旗'),
        ('22', u'托克托县'),
        ('23', u'和林格尔县'),
        ('24', u'清水河县'),
        ('25', u'武川县')
    ),

    '1:15:2': (
        ('2', u'东河区'),
        ('3', u'昆都仑区'),
        ('4', u'青山区'),
        ('5', u'石拐区'),
        ('6', u'白云鄂博矿区'),
        ('7', u'九原区'),
        ('21', u'土默特右旗'),
        ('22', u'固阳县'),
        ('23', u'达尔罕茂明安联合旗')
    ),

    '1:15:3': (
        ('2', u'海勃湾区'),
        ('3', u'海南区'),
        ('4', u'乌达区')
    ),

    '1:15:4': (
        ('2', u'红山区'),
        ('3', u'元宝山区'),
        ('4', u'松山区'),
        ('21', u'阿鲁科尔沁旗'),
        ('22', u'巴林左旗'),
        ('23', u'巴林右旗'),
        ('24', u'林西县'),
        ('25', u'克什克腾旗'),
        ('26', u'翁牛特旗'),
        ('28', u'喀喇沁旗'),
        ('29', u'宁城县'),
        ('30', u'敖汉旗')
    ),

    '1:15:5': (
        ('2', u'科尔沁区'),
        ('21', u'科尔沁左翼中旗'),
        ('22', u'科尔沁左翼后旗'),
        ('23', u'开鲁县'),
        ('24', u'库伦旗'),
        ('25', u'奈曼旗'),
        ('26', u'扎鲁特旗'),
        ('81', u'霍林郭勒市')
    ),

    '1:15:6': (
        ('2', u'东胜区'),
        ('21', u'达拉特旗'),
        ('22', u'准格尔旗'),
        ('23', u'鄂托克前旗'),
        ('24', u'鄂托克旗'),
        ('25', u'杭锦旗'),
        ('26', u'乌审旗'),
        ('27', u'伊金霍洛旗')
    ),

    '1:15:7': (
        ('2', u'海拉尔区'),
        ('21', u'阿荣旗'),
        ('22', u'莫力达瓦达斡尔族自治旗'),
        ('23', u'鄂伦春自治旗'),
        ('24', u'鄂温克族自治旗'),
        ('25', u'陈巴尔虎旗'),
        ('26', u'新巴尔虎左旗'),
        ('27', u'新巴尔虎右旗'),
        ('81', u'满洲里市'),
        ('82', u'牙克石市'),
        ('83', u'扎兰屯市'),
        ('84', u'额尔古纳市'),
        ('85', u'根河市')
    ),

    '1:15:8': (
        ('2', u'临河区'),
        ('21', u'五原县'),
        ('22', u'磴口县'),
        ('23', u'乌拉特前旗'),
        ('24', u'乌拉特中旗'),
        ('25', u'乌拉特后旗'),
        ('26', u'杭锦后旗')
    ),

    '1:15:9': (
        ('2', u'集宁区'),
        ('21', u'卓资县'),
        ('22', u'化德县'),
        ('23', u'商都县'),
        ('24', u'兴和县'),
        ('25', u'凉城县'),
        ('26', u'察哈尔右翼前旗'),
        ('27', u'察哈尔右翼中旗'),
        ('28', u'察哈尔右翼后旗'),
        ('29', u'四子王旗'),
        ('81', u'丰镇市')
    ),

    '1:15:22': (
        ('1', u'乌兰浩特市'),
        ('2', u'阿尔山市'),
        ('21', u'科尔沁右翼前旗'),
        ('22', u'科尔沁右翼中旗'),
        ('23', u'扎赉特旗'),
        ('24', u'突泉县')
    ),

    '1:15:25': (
        ('1', u'二连浩特市'),
        ('2', u'锡林浩特市'),
        ('22', u'阿巴嘎旗'),
        ('23', u'苏尼特左旗'),
        ('24', u'苏尼特右旗'),
        ('25', u'东乌珠穆沁旗'),
        ('26', u'西乌珠穆沁旗'),
        ('27', u'太仆寺旗'),
        ('28', u'镶黄旗'),
        ('29', u'正镶白旗'),
        ('30', u'正蓝旗'),
        ('31', u'多伦县')
    ),

    '1:15:29': (
        ('21', u'阿拉善左旗'),
        ('22', u'阿拉善右旗'),
        ('23', u'额济纳旗')
    ),

    '1:21:1': (
        ('2', u'和平区'),
        ('3', u'沈河区'),
        ('4', u'大东区'),
        ('5', u'皇姑区'),
        ('6', u'铁西区'),
        ('11', u'苏家屯区'),
        ('12', u'东陵区'),
        ('13', u'沈北新区'),
        ('14', u'于洪区'),
        ('22', u'辽中县'),
        ('23', u'康平县'),
        ('24', u'法库县'),
        ('81', u'新民市')
    ),

    '1:21:2': (
        ('2', u'中山区'),
        ('3', u'西岗区'),
        ('4', u'沙河口区'),
        ('11', u'甘井子区'),
        ('12', u'旅顺口区'),
        ('13', u'金州区'),
        ('24', u'长海县'),
        ('81', u'瓦房店市'),
        ('82', u'普兰店市'),
        ('83', u'庄河市')
    ),

    '1:21:3': (
        ('2', u'铁东区'),
        ('3', u'铁西区'),
        ('4', u'立山区'),
        ('11', u'千山区'),
        ('21', u'台安县'),
        ('23', u'岫岩满族自治县'),
        ('81', u'海城市')
    ),

    '1:21:4': (
        ('2', u'新抚区'),
        ('3', u'东洲区'),
        ('4', u'望花区'),
        ('11', u'顺城区'),
        ('21', u'抚顺县'),
        ('22', u'新宾满族自治县'),
        ('23', u'清原满族自治县')
    ),

    '1:21:5': (
        ('2', u'平山区'),
        ('3', u'溪湖区'),
        ('4', u'明山区'),
        ('5', u'南芬区'),
        ('21', u'本溪满族自治县'),
        ('22', u'桓仁满族自治县')
    ),

    '1:21:6': (
        ('2', u'元宝区'),
        ('3', u'振兴区'),
        ('4', u'振安区'),
        ('24', u'宽甸满族自治县'),
        ('81', u'东港市'),
        ('82', u'凤城市')
    ),

    '1:21:7': (
        ('2', u'古塔区'),
        ('3', u'凌河区'),
        ('11', u'太和区'),
        ('26', u'黑山县'),
        ('27', u'义　县'),
        ('81', u'凌海市'),
        ('82', u'北镇市')
    ),

    '1:21:8': (
        ('2', u'站前区'),
        ('3', u'西市区'),
        ('4', u'鲅鱼圈区'),
        ('11', u'老边区'),
        ('81', u'盖州市'),
        ('82', u'大石桥市')
    ),

    '1:21:9': (
        ('2', u'海州区'),
        ('3', u'新邱区'),
        ('4', u'太平区'),
        ('5', u'清河门区'),
        ('11', u'细河区'),
        ('21', u'阜新蒙古族自治县'),
        ('22', u'彰武县')
    ),

    '1:21:10': (
        ('2', u'白塔区'),
        ('3', u'文圣区'),
        ('4', u'宏伟区'),
        ('5', u'弓长岭区'),
        ('11', u'太子河区'),
        ('21', u'辽阳县'),
        ('81', u'灯塔市')
    ),

    '1:21:11': (
        ('2', u'双台子区'),
        ('3', u'兴隆台区'),
        ('21', u'大洼县'),
        ('22', u'盘山县')
    ),

    '1:21:12': (
        ('2', u'银州区'),
        ('4', u'清河区'),
        ('21', u'铁岭县'),
        ('23', u'西丰县'),
        ('24', u'昌图县'),
        ('81', u'调兵山市'),
        ('82', u'开原市')
    ),

    '1:21:13': (
        ('2', u'双塔区'),
        ('3', u'龙城区'),
        ('21', u'朝阳县'),
        ('22', u'建平县'),
        ('24', u'喀喇沁左翼蒙古族自治县'),
        ('81', u'北票市'),
        ('82', u'凌源市')
    ),

    '1:21:14': (
        ('2', u'连山区'),
        ('3', u'龙港区'),
        ('4', u'南票区'),
        ('21', u'绥中县'),
        ('22', u'建昌县'),
        ('81', u'兴城市')
    ),

    '1:22:1': (
        ('2', u'南关区'),
        ('3', u'宽城区'),
        ('4', u'朝阳区'),
        ('5', u'二道区'),
        ('6', u'绿园区'),
        ('12', u'双阳区'),
        ('22', u'农安县'),
        ('81', u'九台市'),
        ('82', u'榆树市'),
        ('83', u'德惠市')
    ),

    '1:22:2': (
        ('2', u'昌邑区'),
        ('3', u'龙潭区'),
        ('4', u'船营区'),
        ('11', u'丰满区'),
        ('21', u'永吉县'),
        ('81', u'蛟河市'),
        ('82', u'桦甸市'),
        ('83', u'舒兰市'),
        ('84', u'磐石市')
    ),

    '1:22:3': (
        ('2', u'铁西区'),
        ('3', u'铁东区'),
        ('22', u'梨树县'),
        ('23', u'伊通满族自治县'),
        ('81', u'公主岭市'),
        ('82', u'双辽市')
    ),

    '1:22:4': (
        ('2', u'龙山区'),
        ('3', u'西安区'),
        ('21', u'东丰县'),
        ('22', u'东辽县')
    ),

    '1:22:5': (
        ('2', u'东昌区'),
        ('3', u'二道江区'),
        ('21', u'通化县'),
        ('23', u'辉南县'),
        ('24', u'柳河县'),
        ('81', u'梅河口市'),
        ('82', u'集安市')
    ),

    '1:22:6': (
        ('2', u'八道江区'),
        ('5', u'江源区'),
        ('21', u'抚松县'),
        ('22', u'靖宇县'),
        ('23', u'长白朝鲜族自治县'),
        ('81', u'临江市')
    ),

    '1:22:7': (
        ('2', u'宁江区'),
        ('21', u'前郭尔罗斯蒙古族自治县'),
        ('22', u'长岭县'),
        ('23', u'乾安县'),
        ('24', u'扶余县')
    ),

    '1:22:8': (
        ('2', u'洮北区'),
        ('21', u'镇赉县'),
        ('22', u'通榆县'),
        ('81', u'洮南市'),
        ('82', u'大安市')
    ),

    '1:22:24': (
        ('1', u'延吉市'),
        ('2', u'图们市'),
        ('3', u'敦化市'),
        ('4', u'珲春市'),
        ('5', u'龙井市'),
        ('6', u'和龙市'),
        ('24', u'汪清县'),
        ('26', u'安图县')
    ),

    '1:23:1': (
        ('2', u'道里区'),
        ('3', u'南岗区'),
        ('4', u'道外区'),
        ('8', u'平房区'),
        ('9', u'松北区'),
        ('10', u'香坊区'),
        ('11', u'呼兰区'),
        ('12', u'阿城区'),
        ('23', u'依兰县'),
        ('24', u'方正县'),
        ('25', u'宾　县'),
        ('26', u'巴彦县'),
        ('27', u'木兰县'),
        ('28', u'通河县'),
        ('29', u'延寿县'),
        ('82', u'双城市'),
        ('83', u'尚志市'),
        ('84', u'五常市')
    ),

    '1:23:2': (
        ('2', u'龙沙区'),
        ('3', u'建华区'),
        ('4', u'铁锋区'),
        ('5', u'昂昂溪区'),
        ('6', u'富拉尔基区'),
        ('7', u'碾子山区'),
        ('8', u'梅里斯达斡尔族区'),
        ('21', u'龙江县'),
        ('23', u'依安县'),
        ('24', u'泰来县'),
        ('25', u'甘南县'),
        ('27', u'富裕县'),
        ('29', u'克山县'),
        ('30', u'克东县'),
        ('31', u'拜泉县'),
        ('81', u'讷河市')
    ),

    '1:23:3': (
        ('2', u'鸡冠区'),
        ('3', u'恒山区'),
        ('4', u'滴道区'),
        ('5', u'梨树区'),
        ('6', u'城子河区'),
        ('7', u'麻山区'),
        ('21', u'鸡东县'),
        ('81', u'虎林市'),
        ('82', u'密山市')
    ),

    '1:23:4': (
        ('2', u'向阳区'),
        ('3', u'工农区'),
        ('4', u'南山区'),
        ('5', u'兴安区'),
        ('6', u'东山区'),
        ('7', u'兴山区'),
        ('21', u'萝北县'),
        ('22', u'绥滨县')
    ),

    '1:23:5': (
        ('2', u'尖山区'),
        ('3', u'岭东区'),
        ('5', u'四方台区'),
        ('6', u'宝山区'),
        ('21', u'集贤县'),
        ('22', u'友谊县'),
        ('23', u'宝清县'),
        ('24', u'饶河县')
    ),

    '1:23:6': (
        ('2', u'萨尔图区'),
        ('3', u'龙凤区'),
        ('4', u'让胡路区'),
        ('5', u'红岗区'),
        ('6', u'大同区'),
        ('21', u'肇州县'),
        ('22', u'肇源县'),
        ('23', u'林甸县'),
        ('24', u'杜尔伯特蒙古族自治县')
    ),

    '1:23:7': (
        ('2', u'伊春区'),
        ('3', u'南岔区'),
        ('4', u'友好区'),
        ('5', u'西林区'),
        ('6', u'翠峦区'),
        ('7', u'新青区'),
        ('8', u'美溪区'),
        ('9', u'金山屯区'),
        ('10', u'五营区'),
        ('11', u'乌马河区'),
        ('12', u'汤旺河区'),
        ('13', u'带岭区'),
        ('14', u'乌伊岭区'),
        ('15', u'红星区'),
        ('16', u'上甘岭区'),
        ('22', u'嘉荫县'),
        ('81', u'铁力市')
    ),

    '1:23:8': (
        ('3', u'向阳区'),
        ('4', u'前进区'),
        ('5', u'东风区'),
        ('11', u'郊　区'),
        ('22', u'桦南县'),
        ('26', u'桦川县'),
        ('28', u'汤原县'),
        ('33', u'抚远县'),
        ('81', u'同江市'),
        ('82', u'富锦市')
    ),

    '1:23:9': (
        ('2', u'新兴区'),
        ('3', u'桃山区'),
        ('4', u'茄子河区'),
        ('21', u'勃利县')
    ),

    '1:23:10': (
        ('2', u'东安区'),
        ('3', u'阳明区'),
        ('4', u'爱民区'),
        ('5', u'西安区'),
        ('24', u'东宁县'),
        ('25', u'林口县'),
        ('81', u'绥芬河市'),
        ('83', u'海林市'),
        ('84', u'宁安市'),
        ('85', u'穆棱市')
    ),

    '1:23:11': (
        ('2', u'爱辉区'),
        ('21', u'嫩江县'),
        ('23', u'逊克县'),
        ('24', u'孙吴县'),
        ('81', u'北安市'),
        ('82', u'五大连池市')
    ),

    '1:23:12': (
        ('2', u'北林区'),
        ('21', u'望奎县'),
        ('22', u'兰西县'),
        ('23', u'青冈县'),
        ('24', u'庆安县'),
        ('25', u'明水县'),
        ('26', u'绥棱县'),
        ('81', u'安达市'),
        ('82', u'肇东市'),
        ('83', u'海伦市')
    ),

    '1:23:27': (
        ('21', u'呼玛县'),
        ('22', u'塔河县'),
        ('23', u'漠河县')
    ),

    '1:32:1': (
        ('2', u'玄武区'),
        ('3', u'白下区'),
        ('4', u'秦淮区'),
        ('5', u'建邺区'),
        ('6', u'鼓楼区'),
        ('7', u'下关区'),
        ('11', u'浦口区'),
        ('13', u'栖霞区'),
        ('14', u'雨花台区'),
        ('15', u'江宁区'),
        ('16', u'六合区'),
        ('24', u'溧水县'),
        ('25', u'高淳县')
    ),

    '1:32:2': (
        ('2', u'崇安区'),
        ('3', u'南长区'),
        ('4', u'北塘区'),
        ('5', u'锡山区'),
        ('6', u'惠山区'),
        ('11', u'滨湖区'),
        ('81', u'江阴市'),
        ('82', u'宜兴市')
    ),

    '1:32:3': (
        ('2', u'鼓楼区'),
        ('3', u'云龙区'),
        ('4', u'九里区'),
        ('5', u'贾汪区'),
        ('11', u'泉山区'),
        ('21', u'丰　县'),
        ('22', u'沛　县'),
        ('23', u'铜山县'),
        ('24', u'睢宁县'),
        ('81', u'新沂市'),
        ('82', u'邳州市')
    ),

    '1:32:4': (
        ('2', u'天宁区'),
        ('4', u'钟楼区'),
        ('5', u'戚墅堰区'),
        ('11', u'新北区'),
        ('12', u'武进区'),
        ('81', u'溧阳市'),
        ('82', u'金坛市')
    ),

    '1:32:5': (
        ('2', u'沧浪区'),
        ('3', u'平江区'),
        ('4', u'金阊区'),
        ('5', u'虎丘区'),
        ('6', u'吴中区'),
        ('7', u'相城区'),
        ('81', u'常熟市'),
        ('82', u'张家港市'),
        ('83', u'昆山市'),
        ('84', u'吴江市'),
        ('85', u'太仓市')
    ),

    '1:32:6': (
        ('2', u'崇川区'),
        ('11', u'港闸区'),
        ('21', u'海安县'),
        ('23', u'如东县'),
        ('81', u'启东市'),
        ('82', u'如皋市'),
        ('83', u'通州市'),
        ('84', u'海门市')
    ),

    '1:32:7': (
        ('3', u'连云区'),
        ('5', u'新浦区'),
        ('6', u'海州区'),
        ('21', u'赣榆县'),
        ('22', u'东海县'),
        ('23', u'灌云县'),
        ('24', u'灌南县')
    ),

    '1:32:8': (
        ('2', u'清河区'),
        ('3', u'楚州区'),
        ('4', u'淮阴区'),
        ('11', u'清浦区'),
        ('26', u'涟水县'),
        ('29', u'洪泽县'),
        ('30', u'盱眙县'),
        ('31', u'金湖县')
    ),

    '1:32:9': (
        ('2', u'亭湖区'),
        ('3', u'盐都区'),
        ('21', u'响水县'),
        ('22', u'滨海县'),
        ('23', u'阜宁县'),
        ('24', u'射阳县'),
        ('25', u'建湖县'),
        ('81', u'东台市'),
        ('82', u'大丰市')
    ),

    '1:32:10': (
        ('2', u'广陵区'),
        ('3', u'邗江区'),
        ('11', u'维扬区'),
        ('23', u'宝应县'),
        ('81', u'仪征市'),
        ('84', u'高邮市'),
        ('88', u'江都市')
    ),

    '1:32:11': (
        ('2', u'京口区'),
        ('11', u'润州区'),
        ('12', u'丹徒区'),
        ('81', u'丹阳市'),
        ('82', u'扬中市'),
        ('83', u'句容市')
    ),

    '1:32:12': (
        ('2', u'海陵区'),
        ('3', u'高港区'),
        ('81', u'兴化市'),
        ('82', u'靖江市'),
        ('83', u'泰兴市'),
        ('84', u'姜堰市')
    ),

    '1:32:13': (
        ('2', u'宿城区'),
        ('11', u'宿豫区'),
        ('22', u'沭阳县'),
        ('23', u'泗阳县'),
        ('24', u'泗洪县')
    ),

    '1:33:1': (
        ('2', u'上城区'),
        ('3', u'下城区'),
        ('4', u'江干区'),
        ('5', u'拱墅区'),
        ('6', u'西湖区'),
        ('8', u'滨江区'),
        ('9', u'萧山区'),
        ('10', u'余杭区'),
        ('22', u'桐庐县'),
        ('27', u'淳安县'),
        ('82', u'建德市'),
        ('83', u'富阳市'),
        ('85', u'临安市')
    ),

    '1:33:2': (
        ('3', u'海曙区'),
        ('4', u'江东区'),
        ('5', u'江北区'),
        ('6', u'北仑区'),
        ('11', u'镇海区'),
        ('12', u'鄞州区'),
        ('25', u'象山县'),
        ('26', u'宁海县'),
        ('81', u'余姚市'),
        ('82', u'慈溪市'),
        ('83', u'奉化市')
    ),

    '1:33:3': (
        ('2', u'鹿城区'),
        ('3', u'龙湾区'),
        ('4', u'瓯海区'),
        ('22', u'洞头县'),
        ('24', u'永嘉县'),
        ('26', u'平阳县'),
        ('27', u'苍南县'),
        ('28', u'文成县'),
        ('29', u'泰顺县'),
        ('81', u'瑞安市'),
        ('82', u'乐清市')
    ),

    '1:33:4': (
        ('2', u'南湖区'),
        ('11', u'秀洲区'),
        ('21', u'嘉善县'),
        ('24', u'海盐县'),
        ('81', u'海宁市'),
        ('82', u'平湖市'),
        ('83', u'桐乡市')
    ),

    '1:33:5': (
        ('2', u'吴兴区'),
        ('3', u'南浔区'),
        ('21', u'德清县'),
        ('22', u'长兴县'),
        ('23', u'安吉县')
    ),

    '1:33:6': (
        ('2', u'越城区'),
        ('21', u'绍兴县'),
        ('24', u'新昌县'),
        ('81', u'诸暨市'),
        ('82', u'上虞市'),
        ('83', u'嵊州市')
    ),

    '1:33:7': (
        ('2', u'婺城区'),
        ('3', u'金东区'),
        ('23', u'武义县'),
        ('26', u'浦江县'),
        ('27', u'磐安县'),
        ('81', u'兰溪市'),
        ('82', u'义乌市'),
        ('83', u'东阳市'),
        ('84', u'永康市')
    ),

    '1:33:8': (
        ('2', u'柯城区'),
        ('3', u'衢江区'),
        ('22', u'常山县'),
        ('24', u'开化县'),
        ('25', u'龙游县'),
        ('81', u'江山市')
    ),

    '1:33:9': (
        ('2', u'定海区'),
        ('3', u'普陀区'),
        ('21', u'岱山县'),
        ('22', u'嵊泗县')
    ),

    '1:33:10': (
        ('2', u'椒江区'),
        ('3', u'黄岩区'),
        ('4', u'路桥区'),
        ('21', u'玉环县'),
        ('22', u'三门县'),
        ('23', u'天台县'),
        ('24', u'仙居县'),
        ('81', u'温岭市'),
        ('82', u'临海市')
    ),

    '1:33:11': (
        ('2', u'莲都区'),
        ('21', u'青田县'),
        ('22', u'缙云县'),
        ('23', u'遂昌县'),
        ('24', u'松阳县'),
        ('25', u'云和县'),
        ('26', u'庆元县'),
        ('27', u'景宁畲族自治县'),
        ('81', u'龙泉市')
    ),

    '1:34:1': (
        ('2', u'瑶海区'),
        ('3', u'庐阳区'),
        ('4', u'蜀山区'),
        ('11', u'包河区'),
        ('21', u'长丰县'),
        ('22', u'肥东县'),
        ('23', u'肥西县')
    ),

    '1:34:2': (
        ('2', u'镜湖区'),
        ('3', u'弋江区'),
        ('7', u'鸠江区'),
        ('8', u'三山区'),
        ('21', u'芜湖县'),
        ('22', u'繁昌县'),
        ('23', u'南陵县')
    ),

    '1:34:3': (
        ('2', u'龙子湖区'),
        ('3', u'蚌山区'),
        ('4', u'禹会区'),
        ('11', u'淮上区'),
        ('21', u'怀远县'),
        ('22', u'五河县'),
        ('23', u'固镇县')
    ),

    '1:34:4': (
        ('2', u'大通区'),
        ('3', u'田家庵区'),
        ('4', u'谢家集区'),
        ('5', u'八公山区'),
        ('6', u'潘集区'),
        ('21', u'凤台县')
    ),

    '1:34:5': (
        ('2', u'金家庄区'),
        ('3', u'花山区'),
        ('4', u'雨山区'),
        ('21', u'当涂县')
    ),

    '1:34:6': (
        ('2', u'杜集区'),
        ('3', u'相山区'),
        ('4', u'烈山区'),
        ('21', u'濉溪县')
    ),

    '1:34:7': (
        ('2', u'铜官山区'),
        ('3', u'狮子山区'),
        ('11', u'郊　区'),
        ('21', u'铜陵县')
    ),

    '1:34:8': (
        ('2', u'迎江区'),
        ('3', u'大观区'),
        ('11', u'宜秀区'),
        ('22', u'怀宁县'),
        ('23', u'枞阳县'),
        ('24', u'潜山县'),
        ('25', u'太湖县'),
        ('26', u'宿松县'),
        ('27', u'望江县'),
        ('28', u'岳西县'),
        ('81', u'桐城市')
    ),

    '1:34:10': (
        ('2', u'屯溪区'),
        ('3', u'黄山区'),
        ('4', u'徽州区'),
        ('21', u'歙　县'),
        ('22', u'休宁县'),
        ('23', u'黟　县'),
        ('24', u'祁门县')
    ),

    '1:34:11': (
        ('2', u'琅琊区'),
        ('3', u'南谯区'),
        ('22', u'来安县'),
        ('24', u'全椒县'),
        ('25', u'定远县'),
        ('26', u'凤阳县'),
        ('81', u'天长市'),
        ('82', u'明光市')
    ),

    '1:34:12': (
        ('2', u'颍州区'),
        ('3', u'颍东区'),
        ('4', u'颍泉区'),
        ('21', u'临泉县'),
        ('22', u'太和县'),
        ('25', u'阜南县'),
        ('26', u'颍上县'),
        ('82', u'界首市')
    ),

    '1:34:13': (
        ('2', u'埇桥区'),
        ('21', u'砀山县'),
        ('22', u'萧　县'),
        ('23', u'灵璧县'),
        ('24', u'泗　县')
    ),

    '1:34:14': (
        ('2', u'居巢区'),
        ('21', u'庐江县'),
        ('22', u'无为县'),
        ('23', u'含山县'),
        ('24', u'和　县')
    ),

    '1:34:15': (
        ('2', u'金安区'),
        ('3', u'裕安区'),
        ('21', u'寿　县'),
        ('22', u'霍邱县'),
        ('23', u'舒城县'),
        ('24', u'金寨县'),
        ('25', u'霍山县')
    ),

    '1:34:16': (
        ('2', u'谯城区'),
        ('21', u'涡阳县'),
        ('22', u'蒙城县'),
        ('23', u'利辛县')
    ),

    '1:34:17': (
        ('2', u'贵池区'),
        ('21', u'东至县'),
        ('22', u'石台县'),
        ('23', u'青阳县')
    ),

    '1:34:18': (
        ('2', u'宣州区'),
        ('21', u'郎溪县'),
        ('22', u'广德县'),
        ('23', u'泾　县'),
        ('24', u'绩溪县'),
        ('25', u'旌德县'),
        ('81', u'宁国市')
    ),

    '1:35:1': (
        ('2', u'鼓楼区'),
        ('3', u'台江区'),
        ('4', u'仓山区'),
        ('5', u'马尾区'),
        ('11', u'晋安区'),
        ('21', u'闽侯县'),
        ('22', u'连江县'),
        ('23', u'罗源县'),
        ('24', u'闽清县'),
        ('25', u'永泰县'),
        ('28', u'平潭县'),
        ('81', u'福清市'),
        ('82', u'长乐市')
    ),

    '1:35:2': (
        ('3', u'思明区'),
        ('5', u'海沧区'),
        ('6', u'湖里区'),
        ('11', u'集美区'),
        ('12', u'同安区'),
        ('13', u'翔安区')
    ),

    '1:35:3': (
        ('2', u'城厢区'),
        ('3', u'涵江区'),
        ('4', u'荔城区'),
        ('5', u'秀屿区'),
        ('22', u'仙游县')
    ),

    '1:35:4': (
        ('2', u'梅列区'),
        ('3', u'三元区'),
        ('21', u'明溪县'),
        ('23', u'清流县'),
        ('24', u'宁化县'),
        ('25', u'大田县'),
        ('26', u'尤溪县'),
        ('27', u'沙　县'),
        ('28', u'将乐县'),
        ('29', u'泰宁县'),
        ('30', u'建宁县'),
        ('81', u'永安市')
    ),

    '1:35:5': (
        ('2', u'鲤城区'),
        ('3', u'丰泽区'),
        ('4', u'洛江区'),
        ('5', u'泉港区'),
        ('21', u'惠安县'),
        ('24', u'安溪县'),
        ('25', u'永春县'),
        ('26', u'德化县'),
        ('27', u'金门县'),
        ('81', u'石狮市'),
        ('82', u'晋江市'),
        ('83', u'南安市')
    ),

    '1:35:6': (
        ('2', u'芗城区'),
        ('3', u'龙文区'),
        ('22', u'云霄县'),
        ('23', u'漳浦县'),
        ('24', u'诏安县'),
        ('25', u'长泰县'),
        ('26', u'东山县'),
        ('27', u'南靖县'),
        ('28', u'平和县'),
        ('29', u'华安县'),
        ('81', u'龙海市')
    ),

    '1:35:7': (
        ('2', u'延平区'),
        ('21', u'顺昌县'),
        ('22', u'浦城县'),
        ('23', u'光泽县'),
        ('24', u'松溪县'),
        ('25', u'政和县'),
        ('81', u'邵武市'),
        ('82', u'武夷山市'),
        ('83', u'建瓯市'),
        ('84', u'建阳市')
    ),

    '1:35:8': (
        ('2', u'新罗区'),
        ('21', u'长汀县'),
        ('22', u'永定县'),
        ('23', u'上杭县'),
        ('24', u'武平县'),
        ('25', u'连城县'),
        ('81', u'漳平市')
    ),

    '1:35:9': (
        ('2', u'蕉城区'),
        ('21', u'霞浦县'),
        ('22', u'古田县'),
        ('23', u'屏南县'),
        ('24', u'寿宁县'),
        ('25', u'周宁县'),
        ('26', u'柘荣县'),
        ('81', u'福安市'),
        ('82', u'福鼎市')
    ),

    '1:36:1': (
        ('2', u'东湖区'),
        ('3', u'西湖区'),
        ('4', u'青云谱区'),
        ('5', u'湾里区'),
        ('11', u'青山湖区'),
        ('21', u'南昌县'),
        ('22', u'新建县'),
        ('23', u'安义县'),
        ('24', u'进贤县')
    ),

    '1:36:2': (
        ('2', u'昌江区'),
        ('3', u'珠山区'),
        ('22', u'浮梁县'),
        ('81', u'乐平市')
    ),

    '1:36:3': (
        ('2', u'安源区'),
        ('13', u'湘东区'),
        ('21', u'莲花县'),
        ('22', u'上栗县'),
        ('23', u'芦溪县')
    ),

    '1:36:4': (
        ('2', u'庐山区'),
        ('3', u'浔阳区'),
        ('21', u'九江县'),
        ('23', u'武宁县'),
        ('24', u'修水县'),
        ('25', u'永修县'),
        ('26', u'德安县'),
        ('27', u'星子县'),
        ('28', u'都昌县'),
        ('29', u'湖口县'),
        ('30', u'彭泽县'),
        ('81', u'瑞昌市')
    ),

    '1:36:5': (
        ('2', u'渝水区'),
        ('21', u'分宜县')
    ),

    '1:36:6': (
        ('2', u'月湖区'),
        ('22', u'余江县'),
        ('81', u'贵溪市')
    ),

    '1:36:7': (
        ('2', u'章贡区'),
        ('21', u'赣　县'),
        ('22', u'信丰县'),
        ('23', u'大余县'),
        ('24', u'上犹县'),
        ('25', u'崇义县'),
        ('26', u'安远县'),
        ('27', u'龙南县'),
        ('28', u'定南县'),
        ('29', u'全南县'),
        ('30', u'宁都县'),
        ('31', u'于都县'),
        ('32', u'兴国县'),
        ('33', u'会昌县'),
        ('34', u'寻乌县'),
        ('35', u'石城县'),
        ('81', u'瑞金市'),
        ('82', u'南康市')
    ),

    '1:36:8': (
        ('2', u'吉州区'),
        ('3', u'青原区'),
        ('21', u'吉安县'),
        ('22', u'吉水县'),
        ('23', u'峡江县'),
        ('24', u'新干县'),
        ('25', u'永丰县'),
        ('26', u'泰和县'),
        ('27', u'遂川县'),
        ('28', u'万安县'),
        ('29', u'安福县'),
        ('30', u'永新县'),
        ('81', u'井冈山市')
    ),

    '1:36:9': (
        ('2', u'袁州区'),
        ('21', u'奉新县'),
        ('22', u'万载县'),
        ('23', u'上高县'),
        ('24', u'宜丰县'),
        ('25', u'靖安县'),
        ('26', u'铜鼓县'),
        ('81', u'丰城市'),
        ('82', u'樟树市'),
        ('83', u'高安市')
    ),

    '1:36:10': (
        ('2', u'临川区'),
        ('21', u'南城县'),
        ('22', u'黎川县'),
        ('23', u'南丰县'),
        ('24', u'崇仁县'),
        ('25', u'乐安县'),
        ('26', u'宜黄县'),
        ('27', u'金溪县'),
        ('28', u'资溪县'),
        ('29', u'东乡县'),
        ('30', u'广昌县')
    ),

    '1:36:11': (
        ('2', u'信州区'),
        ('21', u'上饶县'),
        ('22', u'广丰县'),
        ('23', u'玉山县'),
        ('24', u'铅山县'),
        ('25', u'横峰县'),
        ('26', u'弋阳县'),
        ('27', u'余干县'),
        ('28', u'鄱阳县'),
        ('29', u'万年县'),
        ('30', u'婺源县'),
        ('81', u'德兴市')
    ),

    '1:37:1': (
        ('2', u'历下区'),
        ('3', u'市中区'),
        ('4', u'槐荫区'),
        ('5', u'天桥区'),
        ('12', u'历城区'),
        ('13', u'长清区'),
        ('24', u'平阴县'),
        ('25', u'济阳县'),
        ('26', u'商河县'),
        ('81', u'章丘市')
    ),

    '1:37:2': (
        ('2', u'市南区'),
        ('3', u'市北区'),
        ('5', u'四方区'),
        ('11', u'黄岛区'),
        ('12', u'崂山区'),
        ('13', u'李沧区'),
        ('14', u'城阳区'),
        ('81', u'胶州市'),
        ('82', u'即墨市'),
        ('83', u'平度市'),
        ('84', u'胶南市'),
        ('85', u'莱西市')
    ),

    '1:37:3': (
        ('2', u'淄川区'),
        ('3', u'张店区'),
        ('4', u'博山区'),
        ('5', u'临淄区'),
        ('6', u'周村区'),
        ('21', u'桓台县'),
        ('22', u'高青县'),
        ('23', u'沂源县')
    ),

    '1:37:4': (
        ('2', u'市中区'),
        ('3', u'薛城区'),
        ('4', u'峄城区'),
        ('5', u'台儿庄区'),
        ('6', u'山亭区'),
        ('81', u'滕州市')
    ),

    '1:37:5': (
        ('2', u'东营区'),
        ('3', u'河口区'),
        ('21', u'垦利县'),
        ('22', u'利津县'),
        ('23', u'广饶县')
    ),

    '1:37:6': (
        ('2', u'芝罘区'),
        ('11', u'福山区'),
        ('12', u'牟平区'),
        ('13', u'莱山区'),
        ('34', u'长岛县'),
        ('81', u'龙口市'),
        ('82', u'莱阳市'),
        ('83', u'莱州市'),
        ('84', u'蓬莱市'),
        ('85', u'招远市'),
        ('86', u'栖霞市'),
        ('87', u'海阳市')
    ),

    '1:37:7': (
        ('2', u'潍城区'),
        ('3', u'寒亭区'),
        ('4', u'坊子区'),
        ('5', u'奎文区'),
        ('24', u'临朐县'),
        ('25', u'昌乐县'),
        ('81', u'青州市'),
        ('82', u'诸城市'),
        ('83', u'寿光市'),
        ('84', u'安丘市'),
        ('85', u'高密市'),
        ('86', u'昌邑市')
    ),

    '1:37:8': (
        ('2', u'市中区'),
        ('11', u'任城区'),
        ('26', u'微山县'),
        ('27', u'鱼台县'),
        ('28', u'金乡县'),
        ('29', u'嘉祥县'),
        ('30', u'汶上县'),
        ('31', u'泗水县'),
        ('32', u'梁山县'),
        ('81', u'曲阜市'),
        ('82', u'兖州市'),
        ('83', u'邹城市')
    ),

    '1:37:9': (
        ('2', u'泰山区'),
        ('11', u'岱岳区'),
        ('21', u'宁阳县'),
        ('23', u'东平县'),
        ('82', u'新泰市'),
        ('83', u'肥城市')
    ),

    '1:37:10': (
        ('2', u'环翠区'),
        ('81', u'文登市'),
        ('82', u'荣成市'),
        ('83', u'乳山市')
    ),

    '1:37:11': (
        ('2', u'东港区'),
        ('3', u'岚山区'),
        ('21', u'五莲县'),
        ('22', u'莒　县')
    ),

    '1:37:12': (
        ('2', u'莱城区'),
        ('3', u'钢城区')
    ),

    '1:37:13': (
        ('2', u'兰山区'),
        ('11', u'罗庄区'),
        ('12', u'河东区'),
        ('21', u'沂南县'),
        ('22', u'郯城县'),
        ('23', u'沂水县'),
        ('24', u'苍山县'),
        ('25', u'费　县'),
        ('26', u'平邑县'),
        ('27', u'莒南县'),
        ('28', u'蒙阴县'),
        ('29', u'临沭县')
    ),

    '1:37:14': (
        ('2', u'德城区'),
        ('21', u'陵　县'),
        ('22', u'宁津县'),
        ('23', u'庆云县'),
        ('24', u'临邑县'),
        ('25', u'齐河县'),
        ('26', u'平原县'),
        ('27', u'夏津县'),
        ('28', u'武城县'),
        ('81', u'乐陵市'),
        ('82', u'禹城市')
    ),

    '1:37:15': (
        ('2', u'东昌府区'),
        ('21', u'阳谷县'),
        ('22', u'莘　县'),
        ('23', u'茌平县'),
        ('24', u'东阿县'),
        ('25', u'冠　县'),
        ('26', u'高唐县'),
        ('81', u'临清市')
    ),

    '1:37:16': (
        ('2', u'滨城区'),
        ('21', u'惠民县'),
        ('22', u'阳信县'),
        ('23', u'无棣县'),
        ('24', u'沾化县'),
        ('25', u'博兴县'),
        ('26', u'邹平县')
    ),

    '1:37:17': (
        ('2', u'牡丹区'),
        ('21', u'曹　县'),
        ('22', u'单　县'),
        ('23', u'成武县'),
        ('24', u'巨野县'),
        ('25', u'郓城县'),
        ('26', u'鄄城县'),
        ('27', u'定陶县'),
        ('28', u'东明县')
    ),

    '1:41:1': (
        ('2', u'中原区'),
        ('3', u'二七区'),
        ('4', u'管城回族区'),
        ('5', u'金水区'),
        ('6', u'上街区'),
        ('8', u'惠济区'),
        ('22', u'中牟县'),
        ('81', u'巩义市'),
        ('82', u'荥阳市'),
        ('83', u'新密市'),
        ('84', u'新郑市'),
        ('85', u'登封市')
    ),

    '1:41:2': (
        ('2', u'龙亭区'),
        ('3', u'顺河回族区'),
        ('4', u'鼓楼区'),
        ('5', u'禹王台区'),
        ('11', u'金明区'),
        ('21', u'杞　县'),
        ('22', u'通许县'),
        ('23', u'尉氏县'),
        ('24', u'开封县'),
        ('25', u'兰考县')
    ),

    '1:41:3': (
        ('2', u'老城区'),
        ('3', u'西工区'),
        ('4', u'瀍河回族区'),
        ('5', u'涧西区'),
        ('6', u'吉利区'),
        ('11', u'洛龙区'),
        ('22', u'孟津县'),
        ('23', u'新安县'),
        ('24', u'栾川县'),
        ('25', u'嵩　县'),
        ('26', u'汝阳县'),
        ('27', u'宜阳县'),
        ('28', u'洛宁县'),
        ('29', u'伊川县'),
        ('81', u'偃师市')
    ),

    '1:41:4': (
        ('2', u'新华区'),
        ('3', u'卫东区'),
        ('4', u'石龙区'),
        ('11', u'湛河区'),
        ('21', u'宝丰县'),
        ('22', u'叶　县'),
        ('23', u'鲁山县'),
        ('25', u'郏　县'),
        ('81', u'舞钢市'),
        ('82', u'汝州市')
    ),

    '1:41:5': (
        ('2', u'文峰区'),
        ('3', u'北关区'),
        ('5', u'殷都区'),
        ('6', u'龙安区'),
        ('22', u'安阳县'),
        ('23', u'汤阴县'),
        ('26', u'滑　县'),
        ('27', u'内黄县'),
        ('81', u'林州市')
    ),

    '1:41:6': (
        ('2', u'鹤山区'),
        ('3', u'山城区'),
        ('11', u'淇滨区'),
        ('21', u'浚　县'),
        ('22', u'淇　县')
    ),

    '1:41:7': (
        ('2', u'红旗区'),
        ('3', u'卫滨区'),
        ('4', u'凤泉区'),
        ('11', u'牧野区'),
        ('21', u'新乡县'),
        ('24', u'获嘉县'),
        ('25', u'原阳县'),
        ('26', u'延津县'),
        ('27', u'封丘县'),
        ('28', u'长垣县'),
        ('81', u'卫辉市'),
        ('82', u'辉县市')
    ),

    '1:41:8': (
        ('2', u'解放区'),
        ('3', u'中站区'),
        ('4', u'马村区'),
        ('11', u'山阳区'),
        ('21', u'修武县'),
        ('22', u'博爱县'),
        ('23', u'武陟县'),
        ('25', u'温　县'),
        ('82', u'沁阳市'),
        ('83', u'孟州市')
    ),

    '1:41:9': (
        ('2', u'华龙区'),
        ('22', u'清丰县'),
        ('23', u'南乐县'),
        ('26', u'范　县'),
        ('27', u'台前县'),
        ('28', u'濮阳县')
    ),

    '1:41:10': (
        ('2', u'魏都区'),
        ('23', u'许昌县'),
        ('24', u'鄢陵县'),
        ('25', u'襄城县'),
        ('81', u'禹州市'),
        ('82', u'长葛市')
    ),

    '1:41:11': (
        ('2', u'源汇区'),
        ('3', u'郾城区'),
        ('4', u'召陵区'),
        ('21', u'舞阳县'),
        ('22', u'临颍县')
    ),

    '1:41:12': (
        ('2', u'湖滨区'),
        ('21', u'渑池县'),
        ('22', u'陕　县'),
        ('24', u'卢氏县'),
        ('81', u'义马市'),
        ('82', u'灵宝市')
    ),

    '1:41:13': (
        ('2', u'宛城区'),
        ('3', u'卧龙区'),
        ('21', u'南召县'),
        ('22', u'方城县'),
        ('23', u'西峡县'),
        ('24', u'镇平县'),
        ('25', u'内乡县'),
        ('26', u'淅川县'),
        ('27', u'社旗县'),
        ('28', u'唐河县'),
        ('29', u'新野县'),
        ('30', u'桐柏县'),
        ('81', u'邓州市')
    ),

    '1:41:14': (
        ('2', u'梁园区'),
        ('3', u'睢阳区'),
        ('21', u'民权县'),
        ('22', u'睢　县'),
        ('23', u'宁陵县'),
        ('24', u'柘城县'),
        ('25', u'虞城县'),
        ('26', u'夏邑县'),
        ('81', u'永城市')
    ),

    '1:41:15': (
        ('2', u'浉河区'),
        ('3', u'平桥区'),
        ('21', u'罗山县'),
        ('22', u'光山县'),
        ('23', u'新　县'),
        ('24', u'商城县'),
        ('25', u'固始县'),
        ('26', u'潢川县'),
        ('27', u'淮滨县'),
        ('28', u'息　县')
    ),

    '1:41:16': (
        ('2', u'川汇区'),
        ('21', u'扶沟县'),
        ('22', u'西华县'),
        ('23', u'商水县'),
        ('24', u'沈丘县'),
        ('25', u'郸城县'),
        ('26', u'淮阳县'),
        ('27', u'太康县'),
        ('28', u'鹿邑县'),
        ('81', u'项城市')
    ),

    '1:41:17': (
        ('2', u'驿城区'),
        ('21', u'西平县'),
        ('22', u'上蔡县'),
        ('23', u'平舆县'),
        ('24', u'正阳县'),
        ('25', u'确山县'),
        ('26', u'泌阳县'),
        ('27', u'汝南县'),
        ('28', u'遂平县'),
        ('29', u'新蔡县')
    ),

    '1:42:1': (
        ('2', u'江岸区'),
        ('3', u'江汉区'),
        ('4', u'硚口区'),
        ('5', u'汉阳区'),
        ('6', u'武昌区'),
        ('7', u'青山区'),
        ('11', u'洪山区'),
        ('12', u'东西湖区'),
        ('13', u'汉南区'),
        ('14', u'蔡甸区'),
        ('15', u'江夏区'),
        ('16', u'黄陂区'),
        ('17', u'新洲区')
    ),

    '1:42:2': (
        ('2', u'黄石港区'),
        ('3', u'西塞山区'),
        ('4', u'下陆区'),
        ('5', u'铁山区'),
        ('22', u'阳新县'),
        ('81', u'大冶市')
    ),

    '1:42:3': (
        ('2', u'茅箭区'),
        ('3', u'张湾区'),
        ('21', u'郧　县'),
        ('22', u'郧西县'),
        ('23', u'竹山县'),
        ('24', u'竹溪县'),
        ('25', u'房　县'),
        ('81', u'丹江口市')
    ),

    '1:42:5': (
        ('2', u'西陵区'),
        ('3', u'伍家岗区'),
        ('4', u'点军区'),
        ('5', u'猇亭区'),
        ('6', u'夷陵区'),
        ('25', u'远安县'),
        ('26', u'兴山县'),
        ('27', u'秭归县'),
        ('28', u'长阳土家族自治县'),
        ('29', u'五峰土家族自治县'),
        ('81', u'宜都市'),
        ('82', u'当阳市'),
        ('83', u'枝江市')
    ),

    '1:42:6': (
        ('2', u'襄城区'),
        ('6', u'樊城区'),
        ('7', u'襄州区'),
        ('24', u'南漳县'),
        ('25', u'谷城县'),
        ('26', u'保康县'),
        ('82', u'老河口市'),
        ('83', u'枣阳市'),
        ('84', u'宜城市')
    ),

    '1:42:7': (
        ('2', u'梁子湖区'),
        ('3', u'华容区'),
        ('4', u'鄂城区')
    ),

    '1:42:8': (
        ('2', u'东宝区'),
        ('4', u'掇刀区'),
        ('21', u'京山县'),
        ('22', u'沙洋县'),
        ('81', u'钟祥市')
    ),

    '1:42:9': (
        ('2', u'孝南区'),
        ('21', u'孝昌县'),
        ('22', u'大悟县'),
        ('23', u'云梦县'),
        ('81', u'应城市'),
        ('82', u'安陆市'),
        ('84', u'汉川市')
    ),

    '1:42:10': (
        ('2', u'沙市区'),
        ('3', u'荆州区'),
        ('22', u'公安县'),
        ('23', u'监利县'),
        ('24', u'江陵县'),
        ('81', u'石首市'),
        ('83', u'洪湖市'),
        ('87', u'松滋市')
    ),

    '1:42:11': (
        ('2', u'黄州区'),
        ('21', u'团风县'),
        ('22', u'红安县'),
        ('23', u'罗田县'),
        ('24', u'英山县'),
        ('25', u'浠水县'),
        ('26', u'蕲春县'),
        ('27', u'黄梅县'),
        ('81', u'麻城市'),
        ('82', u'武穴市')
    ),

    '1:42:12': (
        ('2', u'咸安区'),
        ('21', u'嘉鱼县'),
        ('22', u'通城县'),
        ('23', u'崇阳县'),
        ('24', u'通山县'),
        ('81', u'赤壁市')
    ),

    '1:42:13': (
        ('2', u'曾都区'),
        ('21', u'随县'),
        ('81', u'广水市')
    ),

    '1:42:28': (
        ('1', u'恩施市'),
        ('2', u'利川市'),
        ('22', u'建始县'),
        ('23', u'巴东县'),
        ('25', u'宣恩县'),
        ('26', u'咸丰县'),
        ('27', u'来凤县'),
        ('28', u'鹤峰县')
    ),

    '1:43:1': (
        ('2', u'芙蓉区'),
        ('3', u'天心区'),
        ('4', u'岳麓区'),
        ('5', u'开福区'),
        ('11', u'雨花区'),
        ('21', u'长沙县'),
        ('22', u'望城县'),
        ('24', u'宁乡县'),
        ('81', u'浏阳市')
    ),

    '1:43:2': (
        ('2', u'荷塘区'),
        ('3', u'芦淞区'),
        ('4', u'石峰区'),
        ('11', u'天元区'),
        ('21', u'株洲县'),
        ('23', u'攸　县'),
        ('24', u'茶陵县'),
        ('25', u'炎陵县'),
        ('81', u'醴陵市')
    ),

    '1:43:3': (
        ('2', u'雨湖区'),
        ('4', u'岳塘区'),
        ('21', u'湘潭县'),
        ('81', u'湘乡市'),
        ('82', u'韶山市')
    ),

    '1:43:4': (
        ('5', u'珠晖区'),
        ('6', u'雁峰区'),
        ('7', u'石鼓区'),
        ('8', u'蒸湘区'),
        ('12', u'南岳区'),
        ('21', u'衡阳县'),
        ('22', u'衡南县'),
        ('23', u'衡山县'),
        ('24', u'衡东县'),
        ('26', u'祁东县'),
        ('81', u'耒阳市'),
        ('82', u'常宁市')
    ),

    '1:43:5': (
        ('2', u'双清区'),
        ('3', u'大祥区'),
        ('11', u'北塔区'),
        ('21', u'邵东县'),
        ('22', u'新邵县'),
        ('23', u'邵阳县'),
        ('24', u'隆回县'),
        ('25', u'洞口县'),
        ('27', u'绥宁县'),
        ('28', u'新宁县'),
        ('29', u'城步苗族自治县'),
        ('81', u'武冈市')
    ),

    '1:43:6': (
        ('2', u'岳阳楼区'),
        ('3', u'云溪区'),
        ('11', u'君山区'),
        ('21', u'岳阳县'),
        ('23', u'华容县'),
        ('24', u'湘阴县'),
        ('26', u'平江县'),
        ('81', u'汨罗市'),
        ('82', u'临湘市')
    ),

    '1:43:7': (
        ('2', u'武陵区'),
        ('3', u'鼎城区'),
        ('21', u'安乡县'),
        ('22', u'汉寿县'),
        ('23', u'澧　县'),
        ('24', u'临澧县'),
        ('25', u'桃源县'),
        ('26', u'石门县'),
        ('81', u'津市市')
    ),

    '1:43:8': (
        ('2', u'永定区'),
        ('11', u'武陵源区'),
        ('21', u'慈利县'),
        ('22', u'桑植县')
    ),

    '1:43:9': (
        ('2', u'资阳区'),
        ('3', u'赫山区'),
        ('21', u'南　县'),
        ('22', u'桃江县'),
        ('23', u'安化县'),
        ('81', u'沅江市')
    ),

    '1:43:10': (
        ('2', u'北湖区'),
        ('3', u'苏仙区'),
        ('21', u'桂阳县'),
        ('22', u'宜章县'),
        ('23', u'永兴县'),
        ('24', u'嘉禾县'),
        ('25', u'临武县'),
        ('26', u'汝城县'),
        ('27', u'桂东县'),
        ('28', u'安仁县'),
        ('81', u'资兴市')
    ),

    '1:43:11': (
        ('2', u'零陵区'),
        ('3', u'冷水滩区'),
        ('21', u'祁阳县'),
        ('22', u'东安县'),
        ('23', u'双牌县'),
        ('24', u'道　县'),
        ('25', u'江永县'),
        ('26', u'宁远县'),
        ('27', u'蓝山县'),
        ('28', u'新田县'),
        ('29', u'江华瑶族自治县')
    ),

    '1:43:12': (
        ('2', u'鹤城区'),
        ('21', u'中方县'),
        ('22', u'沅陵县'),
        ('23', u'辰溪县'),
        ('24', u'溆浦县'),
        ('25', u'会同县'),
        ('26', u'麻阳苗族自治县'),
        ('27', u'新晃侗族自治县'),
        ('28', u'芷江侗族自治县'),
        ('29', u'靖州苗族侗族自治县'),
        ('30', u'通道侗族自治县'),
        ('81', u'洪江市')
    ),

    '1:43:13': (
        ('2', u'娄星区'),
        ('21', u'双峰县'),
        ('22', u'新化县'),
        ('81', u'冷水江市'),
        ('82', u'涟源市')
    ),

    '1:43:31': (
        ('1', u'吉首市'),
        ('22', u'泸溪县'),
        ('23', u'凤凰县'),
        ('24', u'花垣县'),
        ('25', u'保靖县'),
        ('26', u'古丈县'),
        ('27', u'永顺县'),
        ('30', u'龙山县')
    ),

    '1:44:1': (
        ('3', u'荔湾区'),
        ('4', u'越秀区'),
        ('5', u'海珠区'),
        ('6', u'天河区'),
        ('11', u'白云区'),
        ('12', u'黄埔区'),
        ('13', u'番禺区'),
        ('14', u'花都区'),
        ('15', u'南沙区'),
        ('16', u'萝岗区'),
        ('83', u'增城市'),
        ('84', u'从化市')
    ),

    '1:44:2': (
        ('3', u'武江区'),
        ('4', u'浈江区'),
        ('5', u'曲江区'),
        ('22', u'始兴县'),
        ('24', u'仁化县'),
        ('29', u'翁源县'),
        ('32', u'乳源瑶族自治县'),
        ('33', u'新丰县'),
        ('81', u'乐昌市'),
        ('82', u'南雄市')
    ),

    '1:44:3': (
        ('3', u'罗湖区'),
        ('4', u'福田区'),
        ('5', u'南山区'),
        ('6', u'宝安区'),
        ('7', u'龙岗区'),
        ('8', u'盐田区')
    ),

    '1:44:4': (
        ('2', u'香洲区'),
        ('3', u'斗门区'),
        ('4', u'金湾区')
    ),

    '1:44:5': (
        ('7', u'龙湖区'),
        ('11', u'金平区'),
        ('12', u'濠江区'),
        ('13', u'潮阳区'),
        ('14', u'潮南区'),
        ('15', u'澄海区'),
        ('23', u'南澳县')
    ),

    '1:44:6': (
        ('4', u'禅城区'),
        ('5', u'南海区'),
        ('6', u'顺德区'),
        ('7', u'三水区'),
        ('8', u'高明区')
    ),

    '1:44:7': (
        ('3', u'蓬江区'),
        ('4', u'江海区'),
        ('5', u'新会区'),
        ('81', u'台山市'),
        ('83', u'开平市'),
        ('84', u'鹤山市'),
        ('85', u'恩平市')
    ),

    '1:44:8': (
        ('2', u'赤坎区'),
        ('3', u'霞山区'),
        ('4', u'坡头区'),
        ('11', u'麻章区'),
        ('23', u'遂溪县'),
        ('25', u'徐闻县'),
        ('81', u'廉江市'),
        ('82', u'雷州市'),
        ('83', u'吴川市')
    ),

    '1:44:9': (
        ('2', u'茂南区'),
        ('3', u'茂港区'),
        ('23', u'电白县'),
        ('81', u'高州市'),
        ('82', u'化州市'),
        ('83', u'信宜市')
    ),

    '1:44:12': (
        ('2', u'端州区'),
        ('3', u'鼎湖区'),
        ('23', u'广宁县'),
        ('24', u'怀集县'),
        ('25', u'封开县'),
        ('26', u'德庆县'),
        ('83', u'高要市'),
        ('84', u'四会市')
    ),

    '1:44:13': (
        ('2', u'惠城区'),
        ('3', u'惠阳区'),
        ('22', u'博罗县'),
        ('23', u'惠东县'),
        ('24', u'龙门县')
    ),

    '1:44:14': (
        ('2', u'梅江区'),
        ('21', u'梅　县'),
        ('22', u'大埔县'),
        ('23', u'丰顺县'),
        ('24', u'五华县'),
        ('26', u'平远县'),
        ('27', u'蕉岭县'),
        ('81', u'兴宁市')
    ),

    '1:44:15': (
        ('2', u'城　区'),
        ('21', u'海丰县'),
        ('23', u'陆河县'),
        ('81', u'陆丰市')
    ),

    '1:44:16': (
        ('2', u'源城区'),
        ('21', u'紫金县'),
        ('22', u'龙川县'),
        ('23', u'连平县'),
        ('24', u'和平县'),
        ('25', u'东源县')
    ),

    '1:44:17': (
        ('2', u'江城区'),
        ('21', u'阳西县'),
        ('23', u'阳东县'),
        ('81', u'阳春市')
    ),

    '1:44:18': (
        ('2', u'清城区'),
        ('21', u'佛冈县'),
        ('23', u'阳山县'),
        ('25', u'连山壮族瑶族自治县'),
        ('26', u'连南瑶族自治县'),
        ('27', u'清新县'),
        ('81', u'英德市'),
        ('82', u'连州市')
    ),

    '1:44:19': (
        ('0', u'东莞市'),
    ),

    '1:44:20': (
        ('0', u'中山市'),
    ),

    '1:44:51': (
        ('2', u'湘桥区'),
        ('21', u'潮安县'),
        ('22', u'饶平县')
    ),

    '1:44:52': (
        ('2', u'榕城区'),
        ('21', u'揭东县'),
        ('22', u'揭西县'),
        ('24', u'惠来县'),
        ('81', u'普宁市')
    ),

    '1:44:53': (
        ('2', u'云城区'),
        ('21', u'新兴县'),
        ('22', u'郁南县'),
        ('23', u'云安县'),
        ('81', u'罗定市')
    ),

    '1:45:1': (
        ('2', u'兴宁区'),
        ('3', u'青秀区'),
        ('5', u'江南区'),
        ('7', u'西乡塘区'),
        ('8', u'良庆区'),
        ('9', u'邕宁区'),
        ('22', u'武鸣县'),
        ('23', u'隆安县'),
        ('24', u'马山县'),
        ('25', u'上林县'),
        ('26', u'宾阳县'),
        ('27', u'横　县')
    ),

    '1:45:2': (
        ('2', u'城中区'),
        ('3', u'鱼峰区'),
        ('4', u'柳南区'),
        ('5', u'柳北区'),
        ('21', u'柳江县'),
        ('22', u'柳城县'),
        ('23', u'鹿寨县'),
        ('24', u'融安县'),
        ('25', u'融水苗族自治县'),
        ('26', u'三江侗族自治县')
    ),

    '1:45:3': (
        ('2', u'秀峰区'),
        ('3', u'叠彩区'),
        ('4', u'象山区'),
        ('5', u'七星区'),
        ('11', u'雁山区'),
        ('21', u'阳朔县'),
        ('22', u'临桂县'),
        ('23', u'灵川县'),
        ('24', u'全州县'),
        ('25', u'兴安县'),
        ('26', u'永福县'),
        ('27', u'灌阳县'),
        ('28', u'龙胜各族自治县'),
        ('29', u'资源县'),
        ('30', u'平乐县'),
        ('31', u'荔蒲县'),
        ('32', u'恭城瑶族自治县')
    ),

    '1:45:4': (
        ('3', u'万秀区'),
        ('4', u'蝶山区'),
        ('5', u'长洲区'),
        ('21', u'苍梧县'),
        ('22', u'藤　县'),
        ('23', u'蒙山县'),
        ('81', u'岑溪市')
    ),

    '1:45:5': (
        ('2', u'海城区'),
        ('3', u'银海区'),
        ('12', u'铁山港区'),
        ('21', u'合浦县')
    ),

    '1:45:6': (
        ('2', u'港口区'),
        ('3', u'防城区'),
        ('21', u'上思县'),
        ('81', u'东兴市')
    ),

    '1:45:7': (
        ('2', u'钦南区'),
        ('3', u'钦北区'),
        ('21', u'灵山县'),
        ('22', u'浦北县')
    ),

    '1:45:8': (
        ('2', u'港北区'),
        ('3', u'港南区'),
        ('4', u'覃塘区'),
        ('21', u'平南县'),
        ('81', u'桂平市')
    ),

    '1:45:9': (
        ('2', u'玉州区'),
        ('21', u'容　县'),
        ('22', u'陆川县'),
        ('23', u'博白县'),
        ('24', u'兴业县'),
        ('81', u'北流市')
    ),

    '1:45:10': (
        ('2', u'右江区'),
        ('21', u'田阳县'),
        ('22', u'田东县'),
        ('23', u'平果县'),
        ('24', u'德保县'),
        ('25', u'靖西县'),
        ('26', u'那坡县'),
        ('27', u'凌云县'),
        ('28', u'乐业县'),
        ('29', u'田林县'),
        ('30', u'西林县'),
        ('31', u'隆林各族自治县')
    ),

    '1:45:11': (
        ('2', u'八步区'),
        ('21', u'昭平县'),
        ('22', u'钟山县'),
        ('23', u'富川瑶族自治县')
    ),

    '1:45:12': (
        ('2', u'金城江区'),
        ('21', u'南丹县'),
        ('22', u'天峨县'),
        ('23', u'凤山县'),
        ('24', u'东兰县'),
        ('25', u'罗城仫佬族自治县'),
        ('26', u'环江毛南族自治县'),
        ('27', u'巴马瑶族自治县'),
        ('28', u'都安瑶族自治县'),
        ('29', u'大化瑶族自治县'),
        ('81', u'宜州市')
    ),

    '1:45:13': (
        ('2', u'兴宾区'),
        ('21', u'忻城县'),
        ('22', u'象州县'),
        ('23', u'武宣县'),
        ('24', u'金秀瑶族自治县'),
        ('81', u'合山市')
    ),

    '1:45:14': (
        ('2', u'江洲区'),
        ('21', u'扶绥县'),
        ('22', u'宁明县'),
        ('23', u'龙州县'),
        ('24', u'大新县'),
        ('25', u'天等县'),
        ('81', u'凭祥市')
    ),

    '1:46:1': (
        ('5', u'秀英区'),
        ('6', u'龙华区'),
        ('7', u'琼山区'),
        ('8', u'美兰区')
    ),

    '1:51:1': (
        ('4', u'锦江区'),
        ('5', u'青羊区'),
        ('6', u'金牛区'),
        ('7', u'武侯区'),
        ('8', u'成华区'),
        ('12', u'龙泉驿区'),
        ('13', u'青白江区'),
        ('14', u'新都区'),
        ('15', u'温江区'),
        ('21', u'金堂县'),
        ('22', u'双流县'),
        ('24', u'郫　县'),
        ('29', u'大邑县'),
        ('31', u'蒲江县'),
        ('32', u'新津县'),
        ('81', u'都江堰市'),
        ('82', u'彭州市'),
        ('83', u'邛崃市'),
        ('84', u'崇州市')
    ),

    '1:51:3': (
        ('2', u'自流井区'),
        ('3', u'贡井区'),
        ('4', u'大安区'),
        ('11', u'沿滩区'),
        ('21', u'荣　县'),
        ('22', u'富顺县')
    ),

    '1:51:4': (
        ('2', u'东　区'),
        ('3', u'西　区'),
        ('11', u'仁和区'),
        ('21', u'米易县'),
        ('22', u'盐边县')
    ),

    '1:51:5': (
        ('2', u'江阳区'),
        ('3', u'纳溪区'),
        ('4', u'龙马潭区'),
        ('21', u'泸　县'),
        ('22', u'合江县'),
        ('24', u'叙永县'),
        ('25', u'古蔺县')
    ),

    '1:51:6': (
        ('3', u'旌阳区'),
        ('23', u'中江县'),
        ('26', u'罗江县'),
        ('81', u'广汉市'),
        ('82', u'什邡市'),
        ('83', u'绵竹市')
    ),

    '1:51:7': (
        ('3', u'涪城区'),
        ('4', u'游仙区'),
        ('22', u'三台县'),
        ('23', u'盐亭县'),
        ('24', u'安　县'),
        ('25', u'梓潼县'),
        ('26', u'北川羌族自治县'),
        ('27', u'平武县'),
        ('81', u'江油市')
    ),

    '1:51:8': (
        ('2', u'市中区'),
        ('11', u'元坝区'),
        ('12', u'朝天区'),
        ('21', u'旺苍县'),
        ('22', u'青川县'),
        ('23', u'剑阁县'),
        ('24', u'苍溪县')
    ),

    '1:51:9': (
        ('3', u'船山区'),
        ('4', u'安居区'),
        ('21', u'蓬溪县'),
        ('22', u'射洪县'),
        ('23', u'大英县')
    ),

    '1:51:10': (
        ('2', u'市中区'),
        ('11', u'东兴区'),
        ('24', u'威远县'),
        ('25', u'资中县'),
        ('28', u'隆昌县')
    ),

    '1:51:11': (
        ('2', u'市中区'),
        ('11', u'沙湾区'),
        ('12', u'五通桥区'),
        ('13', u'金口河区'),
        ('23', u'犍为县'),
        ('24', u'井研县'),
        ('26', u'夹江县'),
        ('29', u'沐川县'),
        ('32', u'峨边彝族自治县'),
        ('33', u'马边彝族自治县'),
        ('81', u'峨眉山市')
    ),

    '1:51:13': (
        ('2', u'顺庆区'),
        ('3', u'高坪区'),
        ('4', u'嘉陵区'),
        ('21', u'南部县'),
        ('22', u'营山县'),
        ('23', u'蓬安县'),
        ('24', u'仪陇县'),
        ('25', u'西充县'),
        ('81', u'阆中市')
    ),

    '1:51:14': (
        ('2', u'东坡区'),
        ('21', u'仁寿县'),
        ('22', u'彭山县'),
        ('23', u'洪雅县'),
        ('24', u'丹棱县'),
        ('25', u'青神县')
    ),

    '1:51:15': (
        ('2', u'翠屏区'),
        ('21', u'宜宾县'),
        ('22', u'南溪县'),
        ('23', u'江安县'),
        ('24', u'长宁县'),
        ('25', u'高　县'),
        ('26', u'珙　县'),
        ('27', u'筠连县'),
        ('28', u'兴文县'),
        ('29', u'屏山县')
    ),

    '1:51:16': (
        ('2', u'广安区'),
        ('21', u'岳池县'),
        ('22', u'武胜县'),
        ('23', u'邻水县'),
        ('81', u'华蓥市')
    ),

    '1:51:17': (
        ('2', u'通川区'),
        ('21', u'达　县'),
        ('22', u'宣汉县'),
        ('23', u'开江县'),
        ('24', u'大竹县'),
        ('25', u'渠　县'),
        ('81', u'万源市')
    ),

    '1:51:18': (
        ('2', u'雨城区'),
        ('21', u'名山县'),
        ('22', u'荥经县'),
        ('23', u'汉源县'),
        ('24', u'石棉县'),
        ('25', u'天全县'),
        ('26', u'芦山县'),
        ('27', u'宝兴县')
    ),

    '1:51:19': (
        ('2', u'巴州区'),
        ('21', u'通江县'),
        ('22', u'南江县'),
        ('23', u'平昌县')
    ),

    '1:51:20': (
        ('2', u'雁江区'),
        ('21', u'安岳县'),
        ('22', u'乐至县'),
        ('81', u'简阳市')
    ),

    '1:51:32': (
        ('21', u'汶川县'),
        ('22', u'理　县'),
        ('23', u'茂　县'),
        ('24', u'松潘县'),
        ('25', u'九寨沟县'),
        ('26', u'金川县'),
        ('27', u'小金县'),
        ('28', u'黑水县'),
        ('29', u'马尔康县'),
        ('30', u'壤塘县'),
        ('31', u'阿坝县'),
        ('32', u'若尔盖县'),
        ('33', u'红原县')
    ),

    '1:51:33': (
        ('21', u'康定县'),
        ('22', u'泸定县'),
        ('23', u'丹巴县'),
        ('24', u'九龙县'),
        ('25', u'雅江县'),
        ('26', u'道孚县'),
        ('27', u'炉霍县'),
        ('28', u'甘孜县'),
        ('29', u'新龙县'),
        ('30', u'德格县'),
        ('31', u'白玉县'),
        ('32', u'石渠县'),
        ('33', u'色达县'),
        ('34', u'理塘县'),
        ('35', u'巴塘县'),
        ('36', u'乡城县'),
        ('37', u'稻城县'),
        ('38', u'得荣县')
    ),

    '1:51:34': (
        ('1', u'西昌市'),
        ('22', u'木里藏族自治县'),
        ('23', u'盐源县'),
        ('24', u'德昌县'),
        ('25', u'会理县'),
        ('26', u'会东县'),
        ('27', u'宁南县'),
        ('28', u'普格县'),
        ('29', u'布拖县'),
        ('30', u'金阳县'),
        ('31', u'昭觉县'),
        ('32', u'喜德县'),
        ('33', u'冕宁县'),
        ('34', u'越西县'),
        ('35', u'甘洛县'),
        ('36', u'美姑县'),
        ('37', u'雷波县')
    ),

    '1:52:1': (
        ('2', u'南明区'),
        ('3', u'云岩区'),
        ('11', u'花溪区'),
        ('12', u'乌当区'),
        ('13', u'白云区'),
        ('14', u'小河区'),
        ('21', u'开阳县'),
        ('22', u'息烽县'),
        ('23', u'修文县'),
        ('81', u'清镇市')
    ),

    '1:52:2': (
        ('1', u'钟山区'),
        ('3', u'六枝特区'),
        ('21', u'水城县'),
        ('22', u'盘　县')
    ),

    '1:52:3': (
        ('2', u'红花岗区'),
        ('3', u'汇川区'),
        ('21', u'遵义县'),
        ('22', u'桐梓县'),
        ('23', u'绥阳县'),
        ('24', u'正安县'),
        ('25', u'道真仡佬族苗族自治县'),
        ('26', u'务川仡佬族苗族自治县'),
        ('27', u'凤冈县'),
        ('28', u'湄潭县'),
        ('29', u'余庆县'),
        ('30', u'习水县'),
        ('81', u'赤水市'),
        ('82', u'仁怀市')
    ),

    '1:52:4': (
        ('2', u'西秀区'),
        ('21', u'平坝县'),
        ('22', u'普定县'),
        ('23', u'镇宁布依族苗族自治县'),
        ('24', u'关岭布依族苗族自治县'),
        ('25', u'紫云苗族布依族自治县')
    ),

    '1:52:22': (
        ('1', u'铜仁市'),
        ('22', u'江口县'),
        ('23', u'玉屏侗族自治县'),
        ('24', u'石阡县'),
        ('25', u'思南县'),
        ('26', u'印江土家族苗族自治县'),
        ('27', u'德江县'),
        ('28', u'沿河土家族自治县'),
        ('29', u'松桃苗族自治县'),
        ('30', u'万山特区')
    ),

    '1:52:23': (
        ('1', u'兴义市'),
        ('22', u'兴仁县'),
        ('23', u'普安县'),
        ('24', u'晴隆县'),
        ('25', u'贞丰县'),
        ('26', u'望谟县'),
        ('27', u'册亨县'),
        ('28', u'安龙县')
    ),

    '1:52:24': (
        ('1', u'毕节市'),
        ('22', u'大方县'),
        ('23', u'黔西县'),
        ('24', u'金沙县'),
        ('25', u'织金县'),
        ('26', u'纳雍县'),
        ('27', u'威宁彝族回族苗族自治县'),
        ('28', u'赫章县')
    ),

    '1:52:26': (
        ('1', u'凯里市'),
        ('22', u'黄平县'),
        ('23', u'施秉县'),
        ('24', u'三穗县'),
        ('25', u'镇远县'),
        ('26', u'岑巩县'),
        ('27', u'天柱县'),
        ('28', u'锦屏县'),
        ('29', u'剑河县'),
        ('30', u'台江县'),
        ('31', u'黎平县'),
        ('32', u'榕江县'),
        ('33', u'从江县'),
        ('34', u'雷山县'),
        ('35', u'麻江县'),
        ('36', u'丹寨县')
    ),

    '1:52:27': (
        ('1', u'都匀市'),
        ('2', u'福泉市'),
        ('22', u'荔波县'),
        ('23', u'贵定县'),
        ('25', u'瓮安县'),
        ('26', u'独山县'),
        ('27', u'平塘县'),
        ('28', u'罗甸县'),
        ('29', u'长顺县'),
        ('30', u'龙里县'),
        ('31', u'惠水县'),
        ('32', u'三都水族自治县')
    ),

    '1:53:1': (
        ('2', u'五华区'),
        ('3', u'盘龙区'),
        ('11', u'官渡区'),
        ('12', u'西山区'),
        ('13', u'东川区'),
        ('21', u'呈贡县'),
        ('22', u'晋宁县'),
        ('24', u'富民县'),
        ('25', u'宜良县'),
        ('26', u'石林彝族自治县'),
        ('27', u'嵩明县'),
        ('28', u'禄劝彝族苗族自治县'),
        ('29', u'寻甸回族彝族自治县'),
        ('81', u'安宁市')
    ),

    '1:53:3': (
        ('2', u'麒麟区'),
        ('21', u'马龙县'),
        ('22', u'陆良县'),
        ('23', u'师宗县'),
        ('24', u'罗平县'),
        ('25', u'富源县'),
        ('26', u'会泽县'),
        ('28', u'沾益县'),
        ('81', u'宣威市')
    ),

    '1:53:4': (
        ('2', u'红塔区'),
        ('21', u'江川县'),
        ('22', u'澄江县'),
        ('23', u'通海县'),
        ('24', u'华宁县'),
        ('25', u'易门县'),
        ('26', u'峨山彝族自治县'),
        ('27', u'新平彝族傣族自治县'),
        ('28', u'元江哈尼族彝族傣族自治县')
    ),

    '1:53:5': (
        ('2', u'隆阳区'),
        ('21', u'施甸县'),
        ('22', u'腾冲县'),
        ('23', u'龙陵县'),
        ('24', u'昌宁县')
    ),

    '1:53:6': (
        ('2', u'昭阳区'),
        ('21', u'鲁甸县'),
        ('22', u'巧家县'),
        ('23', u'盐津县'),
        ('24', u'大关县'),
        ('25', u'永善县'),
        ('26', u'绥江县'),
        ('27', u'镇雄县'),
        ('28', u'彝良县'),
        ('29', u'威信县'),
        ('30', u'水富县')
    ),

    '1:53:7': (
        ('2', u'古城区'),
        ('21', u'玉龙纳西族自治县'),
        ('22', u'永胜县'),
        ('23', u'华坪县'),
        ('24', u'宁蒗彝族自治县')
    ),

    '1:53:8': (
        ('2', u'思茅区'),
        ('21', u'宁洱哈尼族彝族自治县'),
        ('22', u'墨江哈尼族自治县'),
        ('23', u'景东彝族自治县'),
        ('24', u'景谷傣族彝族自治县'),
        ('25', u'镇沅彝族哈尼族拉祜族自治县'),
        ('26', u'江城哈尼族彝族自治县'),
        ('27', u'孟连傣族拉祜族佤族自治县'),
        ('28', u'澜沧拉祜族自治县'),
        ('29', u'西盟佤族自治县')
    ),

    '1:53:9': (
        ('2', u'临翔区'),
        ('21', u'凤庆县'),
        ('22', u'云　县'),
        ('23', u'永德县'),
        ('24', u'镇康县'),
        ('25', u'双江拉祜族佤族布朗族傣族自治县'),
        ('26', u'耿马傣族佤族自治县'),
        ('27', u'沧源佤族自治县')
    ),

    '1:53:23': (
        ('1', u'楚雄市'),
        ('22', u'双柏县'),
        ('23', u'牟定县'),
        ('24', u'南华县'),
        ('25', u'姚安县'),
        ('26', u'大姚县'),
        ('27', u'永仁县'),
        ('28', u'元谋县'),
        ('29', u'武定县'),
        ('31', u'禄丰县')
    ),

    '1:53:25': (
        ('1', u'个旧市'),
        ('2', u'开远市'),
        ('22', u'蒙自县'),
        ('23', u'屏边苗族自治县'),
        ('24', u'建水县'),
        ('25', u'石屏县'),
        ('26', u'弥勒县'),
        ('27', u'泸西县'),
        ('28', u'元阳县'),
        ('29', u'红河县'),
        ('30', u'金平苗族瑶族傣族自治县'),
        ('31', u'绿春县'),
        ('32', u'河口瑶族自治县')
    ),

    '1:53:26': (
        ('21', u'文山县'),
        ('22', u'砚山县'),
        ('23', u'西畴县'),
        ('24', u'麻栗坡县'),
        ('25', u'马关县'),
        ('26', u'丘北县'),
        ('27', u'广南县'),
        ('28', u'富宁县')
    ),

    '1:53:28': (
        ('1', u'景洪市'),
        ('22', u'勐海县'),
        ('23', u'勐腊县')
    ),

    '1:53:29': (
        ('1', u'大理市'),
        ('22', u'漾濞彝族自治县'),
        ('23', u'祥云县'),
        ('24', u'宾川县'),
        ('25', u'弥渡县'),
        ('26', u'南涧彝族自治县'),
        ('27', u'巍山彝族回族自治县'),
        ('28', u'永平县'),
        ('29', u'云龙县'),
        ('30', u'洱源县'),
        ('31', u'剑川县'),
        ('32', u'鹤庆县')
    ),

    '1:53:31': (
        ('2', u'瑞丽市'),
        ('3', u'潞西市'),
        ('22', u'梁河县'),
        ('23', u'盈江县'),
        ('24', u'陇川县')
    ),

    '1:53:33': (
        ('21', u'泸水县'),
        ('23', u'福贡县'),
        ('24', u'贡山独龙族怒族自治县'),
        ('25', u'兰坪白族普米族自治县')
    ),

    '1:53:34': (
        ('21', u'香格里拉县'),
        ('22', u'德钦县'),
        ('23', u'维西傈僳族自治县')
    ),

    '1:54:1': (
        ('2', u'城关区'),
        ('21', u'林周县'),
        ('22', u'当雄县'),
        ('23', u'尼木县'),
        ('24', u'曲水县'),
        ('25', u'堆龙德庆县'),
        ('26', u'达孜县'),
        ('27', u'墨竹工卡县')
    ),

    '1:54:21': (
        ('21', u'昌都县'),
        ('22', u'江达县'),
        ('23', u'贡觉县'),
        ('24', u'类乌齐县'),
        ('25', u'丁青县'),
        ('26', u'察雅县'),
        ('27', u'八宿县'),
        ('28', u'左贡县'),
        ('29', u'芒康县'),
        ('32', u'洛隆县'),
        ('33', u'边坝县')
    ),

    '1:54:22': (
        ('21', u'乃东县'),
        ('22', u'扎囊县'),
        ('23', u'贡嘎县'),
        ('24', u'桑日县'),
        ('25', u'琼结县'),
        ('26', u'曲松县'),
        ('27', u'措美县'),
        ('28', u'洛扎县'),
        ('29', u'加查县'),
        ('31', u'隆子县'),
        ('32', u'错那县'),
        ('33', u'浪卡子县')
    ),

    '1:54:23': (
        ('1', u'日喀则市'),
        ('22', u'南木林县'),
        ('23', u'江孜县'),
        ('24', u'定日县'),
        ('25', u'萨迦县'),
        ('26', u'拉孜县'),
        ('27', u'昂仁县'),
        ('28', u'谢通门县'),
        ('29', u'白朗县'),
        ('30', u'仁布县'),
        ('31', u'康马县'),
        ('32', u'定结县'),
        ('33', u'仲巴县'),
        ('34', u'亚东县'),
        ('35', u'吉隆县'),
        ('36', u'聂拉木县'),
        ('37', u'萨嘎县'),
        ('38', u'岗巴县')
    ),

    '1:54:24': (
        ('21', u'那曲县'),
        ('22', u'嘉黎县'),
        ('23', u'比如县'),
        ('24', u'聂荣县'),
        ('25', u'安多县'),
        ('26', u'申扎县'),
        ('27', u'索　县'),
        ('28', u'班戈县'),
        ('29', u'巴青县'),
        ('30', u'尼玛县')
    ),

    '1:54:25': (
        ('21', u'普兰县'),
        ('22', u'札达县'),
        ('23', u'噶尔县'),
        ('24', u'日土县'),
        ('25', u'革吉县'),
        ('26', u'改则县'),
        ('27', u'措勤县')
    ),

    '1:54:26': (
        ('21', u'林芝县'),
        ('22', u'工布江达县'),
        ('23', u'米林县'),
        ('24', u'墨脱县'),
        ('25', u'波密县'),
        ('26', u'察隅县'),
        ('27', u'朗　县')
    ),

    '1:61:1': (
        ('2', u'新城区'),
        ('3', u'碑林区'),
        ('4', u'莲湖区'),
        ('11', u'灞桥区'),
        ('12', u'未央区'),
        ('13', u'雁塔区'),
        ('14', u'阎良区'),
        ('15', u'临潼区'),
        ('16', u'长安区'),
        ('22', u'蓝田县'),
        ('24', u'周至县'),
        ('25', u'户　县'),
        ('26', u'高陵县')
    ),

    '1:61:2': (
        ('2', u'王益区'),
        ('3', u'印台区'),
        ('4', u'耀州区'),
        ('22', u'宜君县')
    ),

    '1:61:3': (
        ('2', u'渭滨区'),
        ('3', u'金台区'),
        ('4', u'陈仓区'),
        ('22', u'凤翔县'),
        ('23', u'岐山县'),
        ('24', u'扶风县'),
        ('26', u'眉　县'),
        ('27', u'陇　县'),
        ('28', u'千阳县'),
        ('29', u'麟游县'),
        ('30', u'凤　县'),
        ('31', u'太白县')
    ),

    '1:61:4': (
        ('2', u'秦都区'),
        ('3', u'杨凌区'),
        ('4', u'渭城区'),
        ('22', u'三原县'),
        ('23', u'泾阳县'),
        ('24', u'乾　县'),
        ('25', u'礼泉县'),
        ('26', u'永寿县'),
        ('27', u'彬　县'),
        ('28', u'长武县'),
        ('29', u'旬邑县'),
        ('30', u'淳化县'),
        ('31', u'武功县'),
        ('81', u'兴平市')
    ),

    '1:61:5': (
        ('2', u'临渭区'),
        ('21', u'华　县'),
        ('22', u'潼关县'),
        ('23', u'大荔县'),
        ('24', u'合阳县'),
        ('25', u'澄城县'),
        ('26', u'蒲城县'),
        ('27', u'白水县'),
        ('28', u'富平县'),
        ('81', u'韩城市'),
        ('82', u'华阴市')
    ),

    '1:61:6': (
        ('2', u'宝塔区'),
        ('21', u'延长县'),
        ('22', u'延川县'),
        ('23', u'子长县'),
        ('24', u'安塞县'),
        ('25', u'志丹县'),
        ('26', u'吴起县'),
        ('27', u'甘泉县'),
        ('28', u'富　县'),
        ('29', u'洛川县'),
        ('30', u'宜川县'),
        ('31', u'黄龙县'),
        ('32', u'黄陵县')
    ),

    '1:61:7': (
        ('2', u'汉台区'),
        ('21', u'南郑县'),
        ('22', u'城固县'),
        ('23', u'洋　县'),
        ('24', u'西乡县'),
        ('25', u'勉　县'),
        ('26', u'宁强县'),
        ('27', u'略阳县'),
        ('28', u'镇巴县'),
        ('29', u'留坝县'),
        ('30', u'佛坪县')
    ),

    '1:61:8': (
        ('2', u'榆阳区'),
        ('21', u'神木县'),
        ('22', u'府谷县'),
        ('23', u'横山县'),
        ('24', u'靖边县'),
        ('25', u'定边县'),
        ('26', u'绥德县'),
        ('27', u'米脂县'),
        ('28', u'佳　县'),
        ('29', u'吴堡县'),
        ('30', u'清涧县'),
        ('31', u'子洲县')
    ),

    '1:61:9': (
        ('2', u'汉滨区'),
        ('21', u'汉阴县'),
        ('22', u'石泉县'),
        ('23', u'宁陕县'),
        ('24', u'紫阳县'),
        ('25', u'岚皋县'),
        ('26', u'平利县'),
        ('27', u'镇坪县'),
        ('28', u'旬阳县'),
        ('29', u'白河县')
    ),

    '1:61:10': (
        ('2', u'商州区'),
        ('21', u'洛南县'),
        ('22', u'丹凤县'),
        ('23', u'商南县'),
        ('24', u'山阳县'),
        ('25', u'镇安县'),
        ('26', u'柞水县')
    ),

    '1:62:1': (
        ('2', u'城关区'),
        ('3', u'七里河区'),
        ('4', u'西固区'),
        ('5', u'安宁区'),
        ('11', u'红古区'),
        ('21', u'永登县'),
        ('22', u'皋兰县'),
        ('23', u'榆中县')
    ),

    '1:62:2': (
        ('0', u'嘉峪关市'),
    ),

    '1:62:3': (
        ('2', u'金川区'),
        ('21', u'永昌县')
    ),

    '1:62:4': (
        ('2', u'白银区'),
        ('3', u'平川区'),
        ('21', u'靖远县'),
        ('22', u'会宁县'),
        ('23', u'景泰县')
    ),

    '1:62:5': (
        ('2', u'秦州区'),
        ('3', u'麦积区'),
        ('21', u'清水县'),
        ('22', u'秦安县'),
        ('23', u'甘谷县'),
        ('24', u'武山县'),
        ('25', u'张家川回族自治县')
    ),

    '1:62:6': (
        ('2', u'凉州区'),
        ('21', u'民勤县'),
        ('22', u'古浪县'),
        ('23', u'天祝藏族自治县')
    ),

    '1:62:7': (
        ('2', u'甘州区'),
        ('21', u'肃南裕固族自治县'),
        ('22', u'民乐县'),
        ('23', u'临泽县'),
        ('24', u'高台县'),
        ('25', u'山丹县')
    ),

    '1:62:8': (
        ('2', u'崆峒区'),
        ('21', u'泾川县'),
        ('22', u'灵台县'),
        ('23', u'崇信县'),
        ('24', u'华亭县'),
        ('25', u'庄浪县'),
        ('26', u'静宁县')
    ),

    '1:62:9': (
        ('2', u'肃州区'),
        ('21', u'金塔县'),
        ('22', u'瓜州县'),
        ('23', u'肃北蒙古族自治县'),
        ('24', u'阿克塞哈萨克族自治县'),
        ('81', u'玉门市'),
        ('82', u'敦煌市')
    ),

    '1:62:10': (
        ('2', u'西峰区'),
        ('21', u'庆城县'),
        ('22', u'环　县'),
        ('23', u'华池县'),
        ('24', u'合水县'),
        ('25', u'正宁县'),
        ('26', u'宁　县'),
        ('27', u'镇原县')
    ),

    '1:62:11': (
        ('2', u'安定区'),
        ('21', u'通渭县'),
        ('22', u'陇西县'),
        ('23', u'渭源县'),
        ('24', u'临洮县'),
        ('25', u'漳　县'),
        ('26', u'岷　县')
    ),

    '1:62:12': (
        ('2', u'武都区'),
        ('21', u'成　县'),
        ('22', u'文　县'),
        ('23', u'宕昌县'),
        ('24', u'康　县'),
        ('25', u'西和县'),
        ('26', u'礼　县'),
        ('27', u'徽　县'),
        ('28', u'两当县')
    ),

    '1:62:29': (
        ('1', u'临夏市'),
        ('21', u'临夏县'),
        ('22', u'康乐县'),
        ('23', u'永靖县'),
        ('24', u'广河县'),
        ('25', u'和政县'),
        ('26', u'东乡族自治县'),
        ('27', u'积石山保安族东乡族撒拉族自治县')
    ),

    '1:62:30': (
        ('1', u'合作市'),
        ('21', u'临潭县'),
        ('22', u'卓尼县'),
        ('23', u'舟曲县'),
        ('24', u'迭部县'),
        ('25', u'玛曲县'),
        ('26', u'碌曲县'),
        ('27', u'夏河县')
    ),

    '1:63:1': (
        ('2', u'城东区'),
        ('3', u'城中区'),
        ('4', u'城西区'),
        ('5', u'城北区'),
        ('21', u'大通回族土族自治县'),
        ('22', u'湟中县'),
        ('23', u'湟源县')
    ),

    '1:63:21': (
        ('21', u'平安县'),
        ('22', u'民和回族土族自治县'),
        ('23', u'乐都县'),
        ('26', u'互助土族自治县'),
        ('27', u'化隆回族自治县'),
        ('28', u'循化撒拉族自治县')
    ),

    '1:63:22': (
        ('21', u'门源回族自治县'),
        ('22', u'祁连县'),
        ('23', u'海晏县'),
        ('24', u'刚察县')
    ),

    '1:63:23': (
        ('21', u'同仁县'),
        ('22', u'尖扎县'),
        ('23', u'泽库县'),
        ('24', u'河南蒙古族自治县')
    ),

    '1:63:25': (
        ('21', u'共和县'),
        ('22', u'同德县'),
        ('23', u'贵德县'),
        ('24', u'兴海县'),
        ('25', u'贵南县')
    ),

    '1:63:26': (
        ('21', u'玛沁县'),
        ('22', u'班玛县'),
        ('23', u'甘德县'),
        ('24', u'达日县'),
        ('25', u'久治县'),
        ('26', u'玛多县')
    ),

    '1:63:27': (
        ('21', u'玉树县'),
        ('22', u'杂多县'),
        ('23', u'称多县'),
        ('24', u'治多县'),
        ('25', u'囊谦县'),
        ('26', u'曲麻莱县')
    ),

    '1:63:28': (
        ('1', u'格尔木市'),
        ('2', u'德令哈市'),
        ('21', u'乌兰县'),
        ('22', u'都兰县'),
        ('23', u'天峻县')
    ),

    '1:64:1': (
        ('4', u'兴庆区'),
        ('5', u'西夏区'),
        ('6', u'金凤区'),
        ('21', u'永宁县'),
        ('22', u'贺兰县'),
        ('81', u'灵武市')
    ),

    '1:64:2': (
        ('2', u'大武口区'),
        ('5', u'惠农区'),
        ('21', u'平罗县')
    ),

    '1:64:3': (
        ('2', u'利通区'),
        ('3', u'红寺堡区'),
        ('23', u'盐池县'),
        ('24', u'同心县'),
        ('81', u'青铜峡市')
    ),

    '1:64:4': (
        ('2', u'原州区'),
        ('22', u'西吉县'),
        ('23', u'隆德县'),
        ('24', u'泾源县'),
        ('25', u'彭阳县')
    ),

    '1:64:5': (
        ('2', u'沙坡头区'),
        ('21', u'中宁县'),
        ('22', u'海原县')
    ),

    '1:65:1': (
        ('2', u'天山区'),
        ('3', u'沙依巴克区'),
        ('4', u'新市区'),
        ('5', u'水磨沟区'),
        ('6', u'头屯河区'),
        ('7', u'达坂城区'),
        ('9', u'米东区'),
        ('21', u'乌鲁木齐县')
    ),

    '1:65:2': (
        ('2', u'独山子区'),
        ('3', u'克拉玛依区'),
        ('4', u'白碱滩区'),
        ('5', u'乌尔禾区')
    ),

    '1:65:21': (
        ('1', u'吐鲁番市'),
        ('22', u'鄯善县'),
        ('23', u'托克逊县')
    ),

    '1:65:22': (
        ('1', u'哈密市'),
        ('22', u'巴里坤哈萨克自治县'),
        ('23', u'伊吾县')
    ),

    '1:65:23': (
        ('1', u'昌吉市'),
        ('2', u'阜康市'),
        ('23', u'呼图壁县'),
        ('24', u'玛纳斯县'),
        ('25', u'奇台县'),
        ('27', u'吉木萨尔县'),
        ('28', u'木垒哈萨克自治县')
    ),

    '1:65:27': (
        ('1', u'博乐市'),
        ('22', u'精河县'),
        ('23', u'温泉县')
    ),

    '1:65:28': (
        ('1', u'库尔勒市'),
        ('22', u'轮台县'),
        ('23', u'尉犁县'),
        ('24', u'若羌县'),
        ('25', u'且末县'),
        ('26', u'焉耆回族自治县'),
        ('27', u'和静县'),
        ('28', u'和硕县'),
        ('29', u'博湖县')
    ),

    '1:65:29': (
        ('1', u'阿克苏市'),
        ('22', u'温宿县'),
        ('23', u'库车县'),
        ('24', u'沙雅县'),
        ('25', u'新和县'),
        ('26', u'拜城县'),
        ('27', u'乌什县'),
        ('28', u'阿瓦提县'),
        ('29', u'柯坪县')
    ),

    '1:65:30': (
        ('1', u'阿图什市'),
        ('22', u'阿克陶县'),
        ('23', u'阿合奇县'),
        ('24', u'乌恰县')
    ),

    '1:65:31': (
        ('1', u'喀什市'),
        ('21', u'疏附县'),
        ('22', u'疏勒县'),
        ('23', u'英吉沙县'),
        ('24', u'泽普县'),
        ('25', u'莎车县'),
        ('26', u'叶城县'),
        ('27', u'麦盖提县'),
        ('28', u'岳普湖县'),
        ('29', u'伽师县'),
        ('30', u'巴楚县'),
        ('31', u'塔什库尔干塔吉克自治县')
    ),

    '1:65:32': (
        ('1', u'和田市'),
        ('21', u'和田县'),
        ('22', u'墨玉县'),
        ('23', u'皮山县'),
        ('24', u'洛浦县'),
        ('25', u'策勒县'),
        ('26', u'于田县'),
        ('27', u'民丰县')
    ),

    '1:65:40': (
        ('2', u'伊宁市'),
        ('3', u'奎屯市'),
        ('21', u'伊宁县'),
        ('22', u'察布查尔锡伯自治县'),
        ('23', u'霍城县'),
        ('24', u'巩留县'),
        ('25', u'新源县'),
        ('26', u'昭苏县'),
        ('27', u'特克斯县'),
        ('28', u'尼勒克县')
    ),

    '1:65:42': (
        ('65', u'塔城市'),
        ('65', u'乌苏市'),
        ('65', u'裕民县'),
        ('61', u'额敏县'),
        ('63', u'沙湾县'),
        ('64', u'托里县'),
        ('66', u'和布克赛尔蒙古自治县')
    ),

    '1:65:43': (
        ('65', u'阿勒泰市'),
        ('21', u'布尔津县'),
        ('22', u'富蕴县'),
        ('23', u'福海县'),
        ('24', u'哈巴河县'),
        ('25', u'青河县'),
        ('26', u'吉木乃县')
    )
}

COUNTRY_DICT = dict(COUNTRY_CHOICES)

STATE_DICT = {}
for key, states in STATE_CHOICES_MAP.items():
    dic = ( ('%s:%s' % (key, e[0]), e[1]) for e  in states )
    STATE_DICT.update(dic)

CITY_DICT = {}
for key, cities in CITY_CHOICES_MAP.items():
    dic = ( ('%s:%s' % (key, e[0]), e[1]) for e in cities )
    CITY_DICT.update(dic)

REGION_DICT = {}
for key, region in REGION_CHOICES_MAP.items():
    dic = ( ('%s:%s' % (key, e[0]), e[1]) for e in region )
    REGION_DICT.update(dic)

CHINA_STATE_CHOICES = STATE_CHOICES_MAP.get('1')

CHINA_CITY_DICT = {}
for key, cities in CITY_CHOICES_MAP.items():
    if key.startswith('1:'):
        key = key[2:]
        dic = {key: cities}
        CHINA_CITY_DICT.update(dic)
