# -*- coding:utf-8 -*-
detail_589 = {
	'title':'uReal-diva 589 個人撮影 韓国デリヘル嬢の悲惨な事情 Vol.13',
	'description':u'''韓国警察も動いた韓国人デリヘル嬢の盗撮映像の第十三弾。大変申し訳ありませんが今回に限り音声データが破損しており映像のみとなっております。無音では寂しいのでBGMを挿入いたしました。 ご理解の上ご視聴頂きますようお願いいたします。映像を見て皆さんで憶測してみて下さい。まずはいつものようにコースを選びお店へ連絡しお金を渡し、さっそく女の子をベッドで押し倒します！女の子は黒髪で清楚な雰囲気のなかなかの美女です！ お兄さんの性感帯の一つでもある乳首を愛撫してもらい花柄ワンピに着替えさせ仁王立ちフェラ。途中なにやら携帯で話をする彼女　始まってそうそう20分足らずで服を着て立ち去ってしまいました。一度もハメることなく終わってしまうなんて前代未聞です！<br />''',
	'cover_img':u'http://img58.imagetwist.com/th/07692/qr1nqb26ep7m.jpg',
	'screenshosts':[u'http://img21.imagetwist.com/i/07692/j3u9gdxr3jju.jpeg'],
	'categories':[u'Real-diva', u'Uncensored'],
	'tags':[u'Real-diva',u'個人撮影',],
	'file_name':u'detail_589',
}
